{
  "ath-001": {
    "core_argument_zh": "凡有开始的事物都有原因。宇宙有一个开始（大爆炸）。因此，宇宙有一个超越时间、空间和物质的原因。这个原因必须是一个有位格的存在——即上帝。卡拉姆宇宙论证（Kalam Cosmological Argument）表明，无限的过去事件回溯在逻辑上是不可能的，因此宇宙必须有一个第一因。\n\n威廉·莱恩·克雷格（William Lane Craig）在《合理的信仰》中详细论证了这个三段论的每一个前提。第一个前提——\"凡有开始的事物都有原因\"——不仅是日常经验的基础，也是科学研究的根本预设。如果事物可以无缘无故地从绝对的\"无\"中产生，那么任何事物都可以在任何时候凭空出现——但我们从未观察到这种现象。\n\n第二个前提——\"宇宙有一个开始\"——得到当代宇宙学强力支持。大爆炸理论表明宇宙约138亿年前从奇点开始膨胀。2003年的BGV定理表明任何平均膨胀速率大于零的宇宙都必须有过去的时空边界。维连金明确表示：\"宇宙学家已没有办法避免宇宙有一个开端的结论。\"热力学第二定律也支持此结论：永恒宇宙早就该达到热平衡。\n\n从结论出发，我们可以推导这个原因的属性：超越时间、超越空间、非物质、极其强大、有位格的（因为无时间的非物质原因只能通过自由意志的决定来产生有时间开始的效果）。这些属性与基督教所启示的创造者上帝完全一致。正如创世记1:1宣告：\"起初上帝创造天地。\"",
    "core_argument_en": "Whatever begins to exist has a cause. The universe began to exist (Big Bang). Therefore, the universe has a cause transcending time, space, and matter. This cause must be a personal being — God. The Kalam Cosmological Argument shows that an actually infinite regress of past events is logically impossible, requiring a first cause.\n\nWilliam Lane Craig provides detailed defense of each premise in 'Reasonable Faith.' The first premise — 'Whatever begins to exist has a cause' — is foundational to daily experience and scientific inquiry. If things could spring uncaused from absolute nothing, anything could appear at any time — yet we never observe this.\n\nThe second premise receives powerful cosmological support. The Big Bang indicates expansion from a singularity ~13.8 billion years ago. The BGV theorem (2003) proves any universe with average expansion rate > 0 must have a past spacetime boundary. Vilenkin stated: 'Cosmologists can no longer hide behind a past-eternal universe.' The Second Law of Thermodynamics concurs: an eternal universe would have reached heat death.\n\nFrom the conclusion we can deduce this cause's properties: timeless, spaceless, immaterial, enormously powerful, and personal (a timeless immaterial cause can only produce a temporally-begun effect through free will). These align with Christianity's Creator God. As Genesis 1:1 declares: 'In the beginning God created the heavens and the earth.'"
  },
  "ath-002": {
    "core_argument_zh": "如果上帝不存在，客观的道德价值和义务就不存在。然而客观道德确实存在（折磨无辜婴儿取乐是客观错误的）。因此上帝存在。在无神论世界观中，道德只能是进化副产品、社会契约或个人偏好——都无法为客观道德提供基础。\n\n论证的第一个前提得到无神论哲学家自己的承认。尼采宣告\"上帝已死\"后推导出道德随之瓦解。当代无神论者迈克尔·鲁斯承认：\"道德只是帮助生存和繁殖的生物适应，没有什么客观的东西。\"J.L.麦基也承认客观道德在自然主义框架下不存在。\n\n第二个前提——客观道德确实存在——诉诸我们最深层的道德直觉。大屠杀的邪恶不仅是文化偏好——它是客观的恶。C.S.路易斯在《返璞归真》第一卷详细论证了跨文化的道德共识：所有文化都谴责无故的谋杀、偷盗和背叛，都赞扬勇气和公正。\n\n改革宗神学提供了深刻的解答：上帝自身的本性——圣洁、公义、慈爱——就是善的终极标准。这完美回应了游叙弗伦困境。保罗在罗马书2:14-15指出上帝的律法写在人心里，解释了为什么无神论者也能认识道德——但在他们的世界观中缺乏客观基础。",
    "core_argument_en": "If God does not exist, objective moral values and duties do not exist. But objective moral values and duties do exist (torturing an innocent baby for fun is objectively wrong). Therefore God exists. On atheism, morality can only be evolutionary byproduct, social contract, or preference — none grounding objective morality.\n\nThe first premise is acknowledged by atheist philosophers themselves. After Nietzsche proclaimed 'God is dead,' he concluded morality collapses with Him. Atheist Michael Ruse admits: 'Morality is just an aid to survival and reproduction — there is nothing objective about it.' J.L. Mackie also conceded objective morality doesn't exist in a naturalistic framework.\n\nThe second premise appeals to our deepest moral intuitions. The Holocaust's evil is not merely cultural preference — it is objective evil. C.S. Lewis argued extensively for cross-cultural moral consensus in Book I of 'Mere Christianity': all cultures condemn unprovoked murder, theft, and betrayal, all praise courage and justice.\n\nReformed theology provides a profound answer: God's own nature — holiness, justice, love — IS the ultimate standard of goodness. This perfectly resolves the Euthyphro Dilemma. Paul states in Romans 2:14-15 that God's law is written on hearts, explaining why atheists recognize morality — though within their worldview this lacks objective grounding."
  },
  "ath-003": {
    "core_argument_zh": "苦难问题常被用来反对上帝存在，但实际上它预设了客观道德——而客观道德恰恰需要上帝。改革宗神学认为：（1）上帝有充分的道德理由允许苦难；（2）人的有限性使我们无法完全理解上帝的旨意；（3）上帝自己在十字架上进入了人类最深的苦难；（4）上帝应许最终消除一切苦难（启示录21:4）。\n\n普兰丁格在《上帝、自由与恶的本质》中证明了\"逻辑版恶的问题\"已被解决——上帝和恶的共存在逻辑上不矛盾，因为创造拥有自由意志的存在物本身是善，自由意志的可能被滥用是恶的来源。即使麦基也承认普兰丁格的自由意志辩护成功回应了逻辑版恶的问题。\n\n当代讨论转向\"概率版恶的问题\"。\"怀疑有神论\"指出：我们有限的认知使我们没有资格判断某种苦难是否真的\"无意义\"。正如两岁孩子无法理解打针为何是好的，我们也可能无法理解上帝允许某些苦难的理由。\n\n基督教最独特的回应是位格性的：上帝在基督里亲自进入苦难最深处。十字架表明上帝不是旁观者，而是亲自承担了罪恶的终极代价。复活应许苦难的最终结局：上帝将擦去一切眼泪。",
    "core_argument_en": "The problem of evil is often used against God's existence, but it presupposes objective morality — which requires God. Reformed theology holds: (1) God has morally sufficient reasons for permitting suffering; (2) Human finitude prevents fully grasping God's purposes; (3) God Himself entered deepest suffering on the Cross; (4) God promises to eliminate all suffering (Revelation 21:4).\n\nPlantinga in 'God, Freedom, and Evil' demonstrated the logical problem of evil is resolved — God and evil's coexistence isn't logically contradictory, since creating free beings is a good, and possible misuse of free will is evil's source. Even Mackie conceded Plantinga's Free Will Defense succeeded.\n\nContemporary discussion shifted to the evidential problem. Skeptical theism responds: our limited cognition disqualifies us from judging whether any suffering is truly 'pointless.' Just as a two-year-old cannot understand vaccination's benefit, we may not grasp God's reasons for permitting certain sufferings.\n\nChristianity's most unique response is personal: God in Christ entered suffering's deepest depths. The Cross shows God personally bore the ultimate cost of evil. The resurrection promises suffering's final resolution: God will wipe every tear."
  },
  "ath-004": {
    "core_argument_zh": "宇宙的基本物理常数被极其精确地\"调节\"到允许生命存在的范围内，任何微小偏差都会使生命完全不可能。最佳解释是一位智慧的设计者有意设定了这些常数。物理学家彭罗斯计算出宇宙初始低熵状态的概率是10^(10^123)分之一。\n\n精细调节的证据来自多个独立常数：宇宙学常数必须精确到10^120分之一；强核力增强2%氢就不存在，减弱5%恒星就无法核聚变；引力与电磁力比值改变10^40分之一恒星就不适合维持生命。这是涉及几十个独立参数的系统性现象。\n\n天体物理学家弗雷德·霍伊尔——终生无神论者——在发现碳-12共振能级的精确调节后写道：\"一种超级智能在搅动物理学。\"斯坦福物理学家萨斯金德也承认精细调节是\"最深刻的谜团之一\"。\n\n面对精细调节只有三种解释：物理必然性（已被物理学家否定）、偶然性（概率极低）、或设计。设计提供了最简单自然的解释。正如诗篇19:1所宣告：\"诸天述说上帝的荣耀，穹苍传扬他的手段。\"",
    "core_argument_en": "The fundamental physical constants are exquisitely 'tuned' to permit life — any slight variation would make life impossible. The best explanation is an intelligent Designer. Physicist Penrose calculated the probability of the universe's initial low-entropy state at 1 in 10^(10^123).\n\nFine-tuning evidence spans multiple independent constants: the cosmological constant tuned to 1 in 10^120; strong nuclear force +2% eliminates hydrogen, -5% prevents fusion; gravity-to-electromagnetic ratio change of 1 in 10^40 prevents life-sustaining stars. This is a systematic phenomenon across dozens of parameters.\n\nAstrophysicist Fred Hoyle — a lifelong atheist — upon discovering carbon-12's precisely tuned resonance level wrote: 'A super-intellect has monkeyed with physics.' Stanford physicist Susskind acknowledges fine-tuning as 'one of the deepest puzzles in physics.'\n\nOnly three explanations exist: physical necessity (rejected by physicists), chance (vanishingly improbable), or design. Design provides the simplest, most natural explanation. As Psalm 19:1 declares: 'The heavens declare the glory of God; the skies proclaim the work of his hands.'"
  },
  "ath-005": {
    "core_argument_zh": "耶稣复活是基督教信仰的核心，有强有力的历史证据支持。即使怀疑派学者也承认以下\"最小事实\"：（1）耶稣死于十字架；（2）门徒真诚地相信遇见了复活的耶稣；（3）迫害者保罗归信；（4）怀疑者雅各归信；（5）空坟墓。最佳解释是耶稣确实复活了。\n\n哈伯马斯通过调查3400+篇学术论文建立了\"最小事实方法\"——只使用被绝大多数学者承认的事实。即使非基督徒学者如埃尔曼和吕德曼也承认门徒确实经历了他们认为是复活显现的体验。\n\nN.T.赖特在《上帝之子的复活》中从第一世纪犹太教背景论证：犹太人对复活的理解是末日集体性身体复活，没有任何传统期待个人在历史中间复活。门徒不可能从已有宗教期望中\"发明\"复活信念——某种真实的、出乎意料的事件必须已经发生。\n\n保罗在哥林多前书15:3-8引用极古老的信经（追溯到耶稣死后2-5年），列出多位见证人包括500多人同时看见复活的基督。写信时许多见证人仍在世，保罗实际上在邀请读者验证。正如保罗所说：\"基督若没有复活，我们所传的便是枉然。\"",
    "core_argument_en": "The resurrection of Jesus is Christianity's core, supported by strong historical evidence. Even skeptical scholars accept these 'minimal facts': (1) Jesus died by crucifixion; (2) Disciples sincerely believed they encountered the risen Jesus; (3) Persecutor Paul converted; (4) Skeptic James converted; (5) The empty tomb. The best explanation is that Jesus actually rose.\n\nHabermas surveyed 3,400+ academic papers establishing the 'minimal facts approach' — using only facts accepted by the vast majority of scholars. Even non-Christians like Ehrman and Lüdemann acknowledge the disciples genuinely experienced what they believed were resurrection appearances.\n\nN.T. Wright in 'The Resurrection of the Son of God' argues from the first-century Jewish context: Jewish resurrection understanding was end-of-history collective bodily resurrection — no tradition anticipated an individual mid-history rising. Disciples couldn't have 'invented' resurrection from existing expectations — something real and unexpected must have occurred.\n\nPaul cites in 1 Corinthians 15:3-8 an extremely ancient creed (dated 2-5 years post-crucifixion) listing multiple witnesses including 500+ simultaneously seeing the risen Christ. Many witnesses were still alive when Paul wrote, effectively inviting verification. As Paul declared: 'If Christ has not been raised, our preaching is useless.'"
  },
  "islam-001": {
    "core_argument_zh": "穆斯林常声称圣经已被篡改（Tahrif），但这与古兰经自身的教导矛盾。古兰经多次确认之前经典的权威性（5:46-47, 10:94, 3:3-4），命令穆斯林参考之前的经文。如果圣经已被篡改，古兰经确认一部被篡改的经文就动摇了自身可靠性。\n\n死海古卷的发现具有决定性意义。1947年发现的这些手稿比之前已知的最早希伯来文旧约手稿早约1000年，却与后来的马索拉文本几乎完全一致，证明旧约在超过千年传抄中保持了极高准确性。\n\n古兰经创造了自我矛盾的困境：如果圣经在穆罕默德时代可靠（古兰经暗示如此），那么当时与今天基本相同的圣经清楚教导耶稣的神性和十字架救赎。如果圣经更早被篡改，古兰经确认被篡改的经文就是错误的。无论哪种情况伊斯兰立场都面临内在矛盾。\n\n新约学者梅茨格和华莱士的研究表明新约手稿证据远超任何其他古代文献——超过5800份希腊文手稿、10000+份拉丁文手稿。文本批判学能以极高精度重建原文。",
    "core_argument_en": "Muslims often claim the Bible was corrupted (Tahrif), but this contradicts the Quran itself, which repeatedly affirms previous scriptures' authority (5:46-47, 10:94, 3:3-4) and commands consulting them. If the Bible was corrupted, the Quran affirming a corrupted text undermines its own reliability.\n\nThe Dead Sea Scrolls are decisive. Found in 1947, these manuscripts predate the previously earliest known Hebrew OT manuscripts by ~1,000 years, yet are nearly identical to the later Masoretic Text, proving extremely high accuracy over millennia of copying.\n\nThe Quran creates a self-contradictory dilemma: if the Bible was reliable in Muhammad's time (the Quran implies this), then that Bible — textually identical to today's — clearly teaches Jesus' deity and the Cross's atonement. If the Bible was corrupted earlier, the Quran affirming a corrupted text is erroneous. Either way, the Islamic position faces internal contradiction.\n\nNT scholars Metzger and Wallace show NT manuscript evidence far surpasses any other ancient document — over 5,800 Greek manuscripts, 10,000+ Latin manuscripts. Textual criticism reconstructs the original with extremely high precision."
  },
  "islam-002": {
    "core_argument_zh": "伊斯兰教声称古兰经是完美保存的，但历史证据表明情况更为复杂。第三任哈里发奥斯曼在标准化古兰经时烧毁了其他版本，这一事实本身就说明存在不同的版本。伊本·马斯欧德——穆罕默德推荐的古兰经四大权威之一——拥有与奥斯曼版不同的版本。\n\n早期伊斯兰文献记载了多处经文变体。布哈里圣训记录了穆罕默德的妻子阿伊莎声称关于哺乳和石刑的经文曾在古兰经中，后来\"遗失\"了。这些\"废止经文\"的存在与\"完美保存\"的声称存在张力。\n\n2015年发现的伯明翰古兰经手稿经碳-14测定可能早于穆罕默德的传统年代，这为早期古兰经的形成历史增添了新的问题。也门萨那手稿显示了古兰经文本存在早期修改和擦除痕迹。\n\n相比之下，圣经拥有数千份手稿可以相互比较，文本批判学能够精确追踪每一处变体。透明的传承历史实际上增强了而非削弱了圣经的可信度。",
    "core_argument_en": "Islam claims the Quran was perfectly preserved, but historical evidence reveals a more complex picture. The third Caliph Uthman burned variant versions when standardizing the Quran — this fact alone demonstrates different versions existed. Ibn Masud — one of Muhammad's four recommended Quran authorities — possessed a version differing from Uthman's.\n\nEarly Islamic sources record multiple textual variants. Bukhari records Muhammad's wife Aisha claiming verses on suckling and stoning existed in the Quran but were later 'lost.' These 'abrogated verses' tension with 'perfect preservation' claims.\n\nThe Birmingham Quran manuscript discovered in 2015, carbon-14 dated potentially before Muhammad's traditional dates, raises new questions about early Quran formation. The Sana'a manuscript shows early modifications and erasures in the Quranic text.\n\nBy contrast, the Bible possesses thousands of manuscripts for mutual comparison, with textual criticism precisely tracking every variant. This transparent transmission history actually strengthens rather than weakens biblical reliability."
  },
  "islam-003": {
    "core_argument_zh": "十字架是基督教信仰的核心：基督为人的罪而死，通过他的牺牲使人与上帝和好。伊斯兰教否认耶稣被钉十字架（古兰经4:157），但这与几乎所有古代历史来源——包括敌对来源——相矛盾。罗马历史学家塔西佗、犹太历史学家约瑟夫斯、甚至犹太法典都确认了耶稣的死亡。\n\n十字架的历史性在学术界几乎没有争议。即使是最怀疑的学者如约翰·多米尼克·克罗桑也说：\"耶稣的死于十字架在历史确定性方面几乎与任何事物一样确定。\"否认十字架意味着否认古代历史中最有文献记录的事件之一。\n\n更深层的问题是神学性的：上帝为什么需要十字架？因为上帝既是慈爱的也是公义的。罪的后果是死亡（罗马书6:23），公义要求刑罚。但上帝的爱驱使祂亲自承担了这个刑罚——\"上帝在基督里叫世人与自己和好\"（哥林多后书5:19）。十字架不是软弱的表现，而是上帝之爱和公义的最高彰显。\n\n安瑟伦在《上帝为何成为人》中论证了替代赎罪的必要性：人的罪是对无限上帝的冒犯，需要无限的满足——只有上帝自己才能提供。基督既是完全的人（代表人类受刑），又是完全的上帝（提供无限价值的赎价），因此他的死足以为全人类赎罪。",
    "core_argument_en": "The Cross is Christianity's core: Christ died for human sin, reconciling people with God through His sacrifice. Islam denies Jesus' crucifixion (Quran 4:157), but this contradicts virtually all ancient historical sources — including hostile ones. Roman historian Tacitus, Jewish historian Josephus, and even the Talmud confirm Jesus' death.\n\nThe crucifixion's historicity is virtually undisputed in scholarship. Even the most skeptical scholars like John Dominic Crossan say: 'Jesus' death by crucifixion is as historically certain as anything can be.' Denying the Cross means denying one of antiquity's best-documented events.\n\nThe deeper question is theological: why did God need the Cross? Because God is both loving and just. Sin's consequence is death (Romans 6:23); justice demands punishment. But God's love drove Him to bear that punishment Himself — 'God was reconciling the world to himself in Christ' (2 Corinthians 5:19). The Cross is not weakness but the supreme display of God's love and justice.\n\nAnselm in 'Cur Deus Homo' argued for substitutionary atonement's necessity: human sin offends the infinite God, requiring infinite satisfaction — only God Himself can provide it. Christ, fully human (representing humanity under punishment) and fully God (providing infinite-value atonement), makes His death sufficient for all humanity."
  },
  "buddhism-001": {
    "core_argument_zh": "佛教对苦难的解决方案——通过消灭\"自我\"（无我）和欲望来达到涅槃——实际上是消灭了经历苦难的主体，而非真正解决苦难问题。基督教则提供了一位有位格的上帝，祂不是要消灭\"你\"，而是要赎回和恢复\"你\"的完整人格。\n\n佛教的核心教义\"无我\"（anatta）主张没有一个持续存在的自我或灵魂。但这引发了深刻的哲学困难：如果没有自我，是谁在追求觉悟？是谁在轮回中受苦？是谁在修行？佛教试图用\"五蕴\"（色受想行识）的暂时聚合来解释\"人\"，但这无法解释人格同一性——昨天的你和今天的你为什么是同一个人？\n\n基督教对苦难有完全不同的回应：苦难不是需要通过消灭意识来逃避的，而是在一位有位格的上帝的爱中可以被赋予意义和目的。上帝自己在十字架上进入了苦难，表明苦难可以成为救赎的途径。复活应许了苦难的最终解决——不是消灭存在，而是恢复和更新存在。\n\n此外，基督教的盼望不是个人存在的终结（涅槃），而是整个人——身体和灵魂——的复活和更新。上帝应许\"新天新地\"（启示录21:1），在那里有丰盛的生命、关系和喜乐——不是空无，而是丰满。",
    "core_argument_en": "Buddhism's solution to suffering — eliminating the 'self' (anatta) and desire to reach Nirvana — actually eliminates the subject who experiences suffering rather than truly resolving it. Christianity offers a personal God who doesn't aim to annihilate 'you' but to redeem and restore your complete personhood.\n\nBuddhism's core doctrine of 'no-self' (anatta) claims no enduring self or soul exists. But this raises profound philosophical difficulties: if there's no self, who pursues enlightenment? Who suffers in samsara? Who practices? Buddhism attempts to explain the 'person' as a temporary aggregation of five skandhas, but this cannot account for personal identity — why is yesterday's 'you' the same as today's?\n\nChristianity responds to suffering entirely differently: suffering is not something to escape by extinguishing consciousness, but can be given meaning and purpose within a personal God's love. God Himself entered suffering on the Cross, showing suffering can become a path of redemption. The resurrection promises suffering's ultimate resolution — not existence's annihilation but its restoration and renewal.\n\nMoreover, Christianity's hope is not personal existence's termination (Nirvana) but the entire person — body and soul — resurrected and renewed. God promises 'a new heaven and new earth' (Revelation 21:1) with abundant life, relationships, and joy — not emptiness but fullness."
  },
  "buddhism-002": {
    "core_argument_zh": "佛教的因果轮回说面临一个根本的哲学难题：如果没有持续存在的\"自我\"（无我），那是谁在承受业力的果报？是谁从一世轮转到下一世？传统比喻——如蜡烛火焰从一根蜡烛传到另一根——并不能真正解释道德责任的传递：新蜡烛的火焰为什么要为旧蜡烛的\"行为\"负责？\n\n基督教的替代方案有清晰的哲学基础：有一位公义的上帝作为道德的终极标准和审判者。人有真实的灵魂和持续的人格同一性，因此可以为自己的行为承担真实的道德责任。罪的刑罚不是无尽的轮回，而是与上帝永远的隔绝——但上帝在基督里为我们承担了这个刑罚。\n\n轮回的另一个问题是：它实际上使善恶变得无意义。如果一个人受苦是因为前世的业，那帮助他就是干预他的业力清偿——这就是为什么印度教和佛教文化中有时会出现对苦难者冷漠的态度。基督教则教导每个人按上帝形象被造，有固有的尊严和价值，帮助受苦者是上帝的明确命令。\n\n此外，轮回系统没有起点也没有终极公义：业力只是机械的因果链，背后没有位格、没有意图、没有怜悯。但人类对公义的渴望不仅是要因果报应，更是要一位理解我们、关心我们的公义审判者。",
    "core_argument_en": "Buddhism's karma-samsara faces a fundamental philosophical problem: if no enduring 'self' exists (anatta), who bears karmic consequences? Who transmigrates between lives? Traditional metaphors — like a candle flame passing between candles — cannot truly explain moral responsibility transfer: why should the new flame be responsible for the old candle's 'actions'?\n\nChristianity's alternative has clear philosophical grounding: a just God as the ultimate moral standard and judge. Humans have real souls and enduring personal identity, enabling genuine moral responsibility. Sin's penalty isn't endless reincarnation but eternal separation from God — yet God in Christ bore this penalty for us.\n\nAnother problem: karma effectively renders good and evil meaningless. If someone suffers from past-life karma, helping them interferes with their karmic repayment — explaining occasional indifference to suffering in Hindu and Buddhist cultures. Christianity teaches every person is made in God's image with inherent dignity, and helping the suffering is God's explicit command.\n\nFurthermore, samsara has no beginning and no ultimate justice: karma is merely a mechanical causal chain with no personhood, intention, or mercy behind it. But human longing for justice wants more than causal retribution — it wants a just Judge who understands and cares for us."
  },
  "buddhism-003": {
    "core_argument_zh": "佛教的\"空性\"（sunyata）教义——一切事物都没有独立自存的本质——如果贯彻到底，会导致彻底的认识论危机。如果一切都是\"空\"的，那么\"空性\"这个教义本身是否也是空的？如果是，我们为什么要接受它？如果不是，那就至少有一件事不是空的，这就否定了普遍空性。\n\n中观学派的龙树试图通过\"二谛\"理论来回应：世俗谛和胜义谛。但这个回应引发了更多问题：如果世俗层面的所有区分（包括真理与谬误的区分）在胜义层面都不成立，那么佛教教义本身的真理性也在胜义层面不成立。这似乎是一个自我拆台的立场。\n\n基督教提供了截然不同的本体论：万物不是\"空\"的，而是被一位真实的、有位格的上帝所创造和维持的。万物有真实的存在——不是终极的自存性，而是依赖于创造者的真实存在。这为科学探究提供了基础（物质世界是真实的），为人际关系提供了意义（人是真实的），也为道德提供了根基（善恶是真实的区分）。\n\n此外，空性教义在实践层面难以贯彻。如果你的孩子只是\"五蕴的暂时聚合\"，没有真实的自我，那父母之爱的基础是什么？基督教肯定爱是终极实在——因为上帝就是爱（约翰一书4:8），而人的受造就是为了爱和被爱。",
    "core_argument_en": "Buddhism's 'emptiness' (sunyata) doctrine — that nothing has independent self-existence — leads, if taken to its logical conclusion, to a total epistemological crisis. If everything is 'empty,' is the emptiness doctrine itself empty? If so, why accept it? If not, then at least one thing isn't empty, negating universal emptiness.\n\nNagarjuna's Madhyamaka school attempted the 'two truths' response: conventional and ultimate truth. But this raises more problems: if all conventional distinctions (including between truth and falsehood) don't hold at the ultimate level, then Buddhism's own truth claims also don't hold ultimately. This appears self-undermining.\n\nChristianity offers a radically different ontology: things are not 'empty' but created and sustained by a real, personal God. Things have genuine existence — not ultimate self-existence, but real existence dependent on the Creator. This grounds scientific inquiry (the material world is real), gives relationships meaning (persons are real), and provides a moral foundation (good and evil are real distinctions).\n\nMoreover, emptiness is practically unsustainable. If your child is merely a 'temporary aggregation of five skandhas' with no real self, what grounds parental love? Christianity affirms love as ultimate reality — because God IS love (1 John 4:8), and humans were created to love and be loved."
  },
  "cults-001": {
    "core_argument_zh": "耶和华见证人（守望台）最核心的错误是否认耶稣基督的完全神性，将耶稣降格为受造的天使长米迦勒。然而圣经清楚教导耶稣是上帝：约翰福音1:1\"道就是上帝\"，托马斯向复活的耶稣宣告\"我的主，我的上帝\"（约翰福音20:28），以赛亚9:6称弥赛亚为\"全能的上帝\"。\n\n耶和华见证人的《新世界译本》将约翰福音1:1改译为\"道是一个神\"，但这在希腊文法上站不住脚。科尔韦尔规则（Colwell's Rule）表明，前置的无冠词谓词名词通常是限定性的，因此原文的意思就是\"道就是上帝\"，而非\"一个神\"。几乎所有主流希腊文学者都拒绝守望台的翻译。\n\n否认基督神性对救恩有致命后果。如果耶稣只是受造之物，他就不可能为全人类的无限罪债提供足够的赎价——只有无限的上帝才能支付无限的代价。以赛亚43:11上帝宣告\"除我以外没有救主\"，而新约称耶稣为救主（提多书2:13）——这只有在耶稣就是上帝的情况下才不矛盾。\n\n守望台还因多次预言末日日期（1914、1925、1975等）均落空而严重损害了其可信度。按照申命记18:21-22的标准，假先知的特征就是预言不应验。",
    "core_argument_en": "Jehovah's Witnesses' (Watchtower's) most fundamental error is denying Jesus Christ's full deity, reducing Him to the created archangel Michael. But Scripture clearly teaches Jesus is God: John 1:1 'the Word was God,' Thomas declared to the risen Jesus 'My Lord and my God' (John 20:28), Isaiah 9:6 calls the Messiah 'Mighty God.'\n\nThe JW's New World Translation renders John 1:1 as 'the Word was a god,' but this is grammatically untenable in Greek. Colwell's Rule indicates that preverbal anarthrous predicate nominatives are typically definite, so the text means 'the Word was God,' not 'a god.' Virtually all mainstream Greek scholars reject the Watchtower translation.\n\nDenying Christ's deity has fatal soteriological consequences. If Jesus were merely created, He could not provide sufficient atonement for all humanity's infinite sin-debt — only the infinite God can pay an infinite price. Isaiah 43:11 declares 'besides me there is no savior,' while the NT calls Jesus Savior (Titus 2:13) — consistent only if Jesus is God.\n\nThe Watchtower has also severely damaged its credibility through multiple failed end-times predictions (1914, 1925, 1975, etc.). By the standard of Deuteronomy 18:21-22, the hallmark of a false prophet is unfulfilled prophecy."
  },
  "cults-002": {
    "core_argument_zh": "摩门教（耶稣基督后期圣徒教会）在核心教义上与正统基督教存在根本分歧：（1）上帝曾经是另一个星球上的凡人，通过进步成为神（Lorenzo Snow信条\"人可以成为上帝\"）；（2）耶稣是灵世界中众多灵子女之一，与撒旦是\"灵兄弟\"；（3）《摩门经》和后来的启示被置于与圣经同等甚至更高的权威地位。\n\n摩门教的上帝观与圣经直接冲突。圣经教导上帝是从亘古到永远的（诗篇90:2），是不改变的（玛拉基书3:6），是唯一的真神（以赛亚书44:6\"除我以外再没有真神\"）。一位从凡人进化而来的上帝完全不是圣经所启示的上帝。\n\n考古学和语言学也对《摩门经》的可信度提出严重质疑。《摩门经》描述古代美洲有先进的基督教文明，使用钢铁、战马和象形文字——但考古学没有发现任何支持这些描述的证据。美洲原住民的DNA研究也不支持他们来自以色列的说法。\n\n此外，约瑟·斯密的亚伯拉罕书被证明是普通的埃及丧葬文献（呼吸许可书），而非他声称的亚伯拉罕亲笔写的记录。多位埃及学家独立确认了这一点，严重质疑了斯密的翻译能力和先知宣称。",
    "core_argument_en": "Mormonism (LDS Church) fundamentally diverges from orthodox Christianity: (1) God was once a mortal man on another planet who progressed to godhood (Lorenzo Snow couplet: 'As man is, God once was'); (2) Jesus is one of many spirit children in the pre-existence, a 'spirit brother' of Satan; (3) The Book of Mormon and later revelations are placed at equal or higher authority than the Bible.\n\nMormon theology directly conflicts with Scripture. The Bible teaches God is from everlasting to everlasting (Psalm 90:2), unchanging (Malachi 3:6), the only true God (Isaiah 44:6 'besides me there is no God'). A God who evolved from a mortal is utterly foreign to biblical revelation.\n\nArchaeology and linguistics also raise serious questions about the Book of Mormon's credibility. It describes advanced Christian civilizations in ancient America using steel, war horses, and hieroglyphics — but archaeology has found zero evidence supporting these descriptions. DNA studies of Native Americans also don't support Israelite origin claims.\n\nFurthermore, Joseph Smith's Book of Abraham was proven to be an ordinary Egyptian funerary document (Breathing Permit of Hôr), not Abraham's personal record as claimed. Multiple Egyptologists independently confirmed this, severely challenging Smith's translation ability and prophetic claims."
  },
  "cults-003": {
    "core_argument_zh": "东方闪电/全能神教声称基督已经第二次道成肉身为一位中国女性。这一主张与圣经的明确教导直接矛盾。希伯来书9:28教导基督\"一次被献\"，10:12说他\"献了一次永远的赎罪祭\"——基督的道成肉身和赎罪工作是\"一次永远\"的，不需要也不会重复。\n\n耶稣自己对再临的方式有明确描述：\"闪电从东边发出，直照到西边；人子降临也要这样\"（马太福音24:27）。基督的再来是公开的、可见的、荣耀的事件，使徒行传1:11确认\"他怎样往天上去，他还要怎样来\"——驾着天上的云降临，众目要看见他（启示录1:7）。这与秘密的、不为人知的再次道成肉身完全不同。\n\n耶稣特别警告了假基督的出现：\"那时若有人对你们说'基督在这里'，或说'基督在那里'，你们不要信\"（马太福音24:23）。全能神教的主张——基督已经秘密来到中国——恰恰是耶稣所预言的假基督模式。\n\n全能神教还使用恐吓、控制和操纵的手段对待成员和离开者，这与基督教对自由意志和爱的尊重完全相反。加拉太书5:1说\"基督释放了我们，叫我们得以自由\"——真正的基督信仰带来自由，而非恐惧和控制。",
    "core_argument_en": "Eastern Lightning/Church of Almighty God claims Christ has been incarnated a second time as a Chinese woman. This directly contradicts Scripture. Hebrews 9:28 teaches Christ was 'offered once,' 10:12 says He offered 'one sacrifice for sins forever' — Christ's incarnation and atoning work are 'once for all,' neither needing nor receiving repetition.\n\nJesus Himself described His return explicitly: 'As lightning that comes from the east is visible even in the west, so will be the coming of the Son of Man' (Matthew 24:27). Christ's return is a public, visible, glorious event. Acts 1:11 confirms 'He will come back in the same way you have seen him go into heaven' — coming on clouds, every eye seeing Him (Revelation 1:7). This is utterly different from a secret, unknown re-incarnation.\n\nJesus specifically warned about false Christs: 'If anyone tells you, \"Here is the Christ\" or \"There he is,\" do not believe it' (Matthew 24:23). Eastern Lightning's claim — Christ has secretly come to China — matches precisely the false Christ pattern Jesus prophesied.\n\nEastern Lightning also uses intimidation, control, and manipulation against members and those who leave, completely contrary to Christianity's respect for free will and love. Galatians 5:1 says 'It is for freedom that Christ has set us free' — true Christian faith brings freedom, not fear and control."
  },
  "sec-001": {
    "core_argument_zh": "科学方法论自然主义（在科学研究中假设自然原因）是合理的方法论工具，但将其扩展为形而上学自然主义（一切存在的只有自然界）则是一个未经证明的哲学跳跃。科学方法本身不能证明超自然不存在——这超出了科学的方法论范围。\n\n许多伟大的科学家同时是虔诚的基督徒：开普勒、牛顿、法拉第、麦克斯韦、普朗克、海森堡、弗朗西斯·柯林斯（人类基因组计划负责人）。科学和信仰的\"冲突叙事\"是19世纪末约翰·威廉·德雷珀和安德鲁·迪克森·怀特制造的历史神话，当代科学史学家已广泛否定了这一叙事。\n\n事实上，基督教为现代科学的诞生提供了必要的思想基础：（1）宇宙是有序的，因为它是一位理性的上帝所创造的；（2）研究自然界是有价值的，因为它是上帝的创造；（3）人有能力理解自然规律，因为人按上帝的形象被造。这些信念在其他世界观中并非不言自明——在泛神论中，自然界是神圣的，不应被\"解剖\"研究；在无神论中，没有理由假设宇宙是有序可知的。\n\n阿尔文·普兰丁格在《科学与宗教：它们真的冲突吗？》中论证，真正的冲突不是科学与信仰之间，而是自然主义与科学之间——因为如果我们的认知能力是盲目进化的产物，我们就没有理由信任它们能产生真信念，包括关于自然主义本身的信念。",
    "core_argument_en": "Methodological naturalism (assuming natural causes in scientific inquiry) is a reasonable methodological tool, but extending it to metaphysical naturalism (all that exists is nature) is an unproven philosophical leap. Science itself cannot prove the supernatural doesn't exist — this exceeds science's methodological scope.\n\nMany great scientists were devout Christians: Kepler, Newton, Faraday, Maxwell, Planck, Heisenberg, Francis Collins (Human Genome Project director). The science-faith 'conflict narrative' is a late-19th-century myth created by John William Draper and Andrew Dickson White, widely rejected by contemporary historians of science.\n\nIn fact, Christianity provided modern science's necessary intellectual foundations: (1) The universe is orderly because created by a rational God; (2) Studying nature is valuable as God's creation; (3) Humans can understand natural laws because made in God's image. These beliefs aren't self-evident in other worldviews — in pantheism, nature is divine and shouldn't be 'dissected'; in atheism, there's no reason to assume the universe is orderly and knowable.\n\nAlvin Plantinga in 'Where the Conflict Really Lies' argues the real conflict isn't between science and faith but between naturalism and science — because if our cognitive faculties are products of blind evolution, we have no reason to trust them to produce true beliefs, including beliefs about naturalism itself."
  },
  "sec-002": {
    "core_argument_zh": "多元主义声称\"所有宗教最终都指向同一个终极实在\"，但仔细考察会发现各大宗教在最核心的问题上有不可调和的矛盾。基督教说上帝是有位格的三位一体；佛教说终极实在是无我和空性；印度教的不二论说最终只有梵我一如。这些不是同一真理的不同表达——它们是相互排斥的真理声称。\n\n约翰·希克（John Hick）的多元主义理论认为各宗教都是对同一\"真实者\"（the Real）的不同回应。但这个理论自身也是一种排他性声称——它声称自己对宗教本质的理解优于每个宗教自身的理解。这是一种\"超级傲慢\"——你比基督徒更了解基督教，比穆斯林更了解伊斯兰教。\n\n\"盲人摸象\"的比喻常被用来支持多元主义，但这个比喻实际上预设了有一个全知的视角（讲故事的人能看到完整的大象）。谁站在这个全知的位置上？基督教的声称恰恰是上帝在基督里主动启示了完整的真理——不是人类在黑暗中摸索，而是光照进了黑暗中。\n\n真正尊重各宗教的态度不是说\"你们其实都是一样的\"（这是不尊重每个宗教的独特宣称），而是认真对待它们的差异，真诚地寻求哪个的真理声称最有证据支持。C.S.路易斯说得好：基督教不是说其他宗教完全错误——它说基督教是完整的真理，而其他宗教包含部分真理。",
    "core_argument_en": "Pluralism claims 'all religions ultimately point to the same reality,' but careful examination reveals irreconcilable contradictions on core questions. Christianity says God is a personal Trinity; Buddhism says ultimate reality is no-self and emptiness; Hinduism's Advaita says only Brahman-Atman unity exists. These aren't different expressions of the same truth — they're mutually exclusive claims.\n\nJohn Hick's pluralism claims all religions respond differently to the same 'Real.' But this is itself an exclusivist claim — asserting a better understanding of religion's nature than each religion has of itself. This is 'super-arrogance' — claiming to understand Christianity better than Christians, Islam better than Muslims.\n\nThe 'blind men and elephant' parable often supports pluralism, but actually presupposes an omniscient perspective (the storyteller sees the whole elephant). Who occupies that position? Christianity's claim is precisely that God in Christ actively revealed the complete truth — not humans groping in darkness, but light shining into darkness.\n\nTrue respect for religions isn't saying 'you're all the same' (which disrespects each religion's unique claims) but taking their differences seriously and sincerely seeking which truth claims have the strongest evidence. C.S. Lewis said it well: Christianity doesn't say other religions are completely wrong — it says Christianity is the complete truth, while other religions contain partial truths."
  },
  "sec-003": {
    "core_argument_zh": "基督教被指控为\"排他性的\"和\"不宽容的\"，但这种批评本身也是排他性的——它排除了所有认为有绝对真理的世界观。说\"不应该声称自己是唯一的真理\"本身就是一个关于真理的排他性声称。所有严肃的世界观都是\"排他性的\"，包括世俗主义和多元主义。\n\n真正的问题不是一个信仰是否具有排他性，而是它是否为真。如果耶稣真的是上帝道成肉身，真的从死里复活了，那么他说\"我就是道路、真理、生命\"（约翰福音14:6）就不是傲慢——而是事实的陈述。基督教的\"排他性\"不是来自基督徒的傲慢，而是来自基督本人的宣告。\n\n此外，基督教在\"排他性\"的教义中包含了极其\"包容性\"的邀请：救恩对所有人开放，不分种族、性别、社会地位或过去的罪行。\"上帝不偏待人\"（使徒行传10:34）。启示录7:9描绘了来自\"各国、各族、各民、各方\"的人在天上的异象。基督教是历史上最跨文化、最多元种族的信仰运动。\n\n宽容的真正含义不是\"认为所有观点都同样正确\"（这是冷漠），而是\"在不同意的情况下仍然尊重和爱对方\"。基督教教导我们爱仇敌（马太福音5:44）、尊重每个人的尊严——这才是真正的宽容。",
    "core_argument_en": "Christianity is accused of being 'exclusive' and 'intolerant,' but this criticism is itself exclusive — it excludes all worldviews claiming absolute truth. Saying 'no one should claim to have the only truth' is itself an exclusive truth claim. All serious worldviews are 'exclusive,' including secularism and pluralism.\n\nThe real question isn't whether a faith is exclusive but whether it's true. If Jesus truly is God incarnate who truly rose from the dead, then His claim 'I am the way, the truth, and the life' (John 14:6) isn't arrogance — it's a factual statement. Christianity's 'exclusivity' comes not from Christian arrogance but from Christ's own declarations.\n\nMoreover, Christianity's 'exclusive' doctrine contains an extremely 'inclusive' invitation: salvation is open to all, regardless of race, gender, social status, or past sins. 'God shows no partiality' (Acts 10:34). Revelation 7:9 envisions people from 'every nation, tribe, people, and language' in heaven. Christianity is history's most cross-cultural, multi-ethnic faith movement.\n\nTrue tolerance doesn't mean 'considering all views equally correct' (that's indifference) but 'respecting and loving others while disagreeing.' Christianity teaches loving enemies (Matthew 5:44) and respecting every person's dignity — this is genuine tolerance."
  },
  "ath-006": {
    "core_argument_zh": "自然主义认为一切实在都是物质的，但意识经验（qualia）无法用纯物理过程解释。你看到红色时的主观体验、感受疼痛时的内在感觉，都不能被还原为神经元的电化学活动。如果宇宙从根本上只是无意识的物质和能量，意识的出现就是巨大的谜团。\n\n哲学家大卫·查尔默斯将意识分为\"易问题\"和\"难问题\"。\"难问题\"是：为什么物理过程会伴随主观体验？即使完全了解大脑的物理机制，仍然无法回答为什么会有\"感觉像什么\"的内在体验。\n\nJ.P.莫兰德论证，意识对自然主义构成重大挑战。如果宇宙的基本成分都是无意识的物质粒子，意识如何\"涌现\"？说\"意识是大脑复杂性的涌现属性\"只是给问题贴了标签——水的流动性可以从分子运动涌现，但主观体验从无意识物质中涌现是完全不同的本体论跳跃。\n\n有神论提供了自然的解释：如果实在的根基不是盲目物质而是有意识的位格心灵（上帝），那有意识的造物就不是神秘的。创世记2:7描述上帝\"将生气吹在人的鼻孔里，他就成了有灵的活人\"——意识的源头是上帝自己的灵。",
    "core_argument_en": "Naturalism holds all reality is physical, yet conscious experience (qualia) defies purely physical explanation. The subjective experience of seeing red or feeling pain cannot be reduced to electrochemical neural activity. If the universe is fundamentally unconscious matter and energy, consciousness's emergence is a profound mystery.\n\nPhilosopher David Chalmers distinguishes the 'easy problems' and the 'hard problem' of consciousness. The hard problem: why do physical processes involve subjective experience? Even complete brain knowledge wouldn't answer why there's 'something it is like' to have inner experience.\n\nJ.P. Moreland argues consciousness severely challenges naturalism. If the universe's basic constituents are unconscious particles, how does consciousness 'emerge'? Calling it an 'emergent property of brain complexity' merely labels the problem — water's fluidity can emerge from molecular motion, but subjective experience from unconscious matter is an entirely different ontological leap.\n\nTheism provides a natural explanation: if reality's foundation is not blind matter but a conscious personal mind (God), conscious creatures aren't mysterious. Genesis 2:7 describes God 'breathing into man's nostrils the breath of life' — consciousness's source is God's own Spirit."
  },
  "ath-007": {
    "core_argument_zh": "DNA分子中包含高度复杂的指定信息（specified information），类似计算机代码。在所有经验中，复杂的指定信息只有一个已知来源：智慧心灵。自然过程可以筛选和修改已有信息，但从未被观察到能从零产生全新的功能性生物信息。\n\n斯蒂芬·迈尔在《细胞中的签名》中论证：最简单的自我复制细胞需要至少250个功能蛋白质，每个由数百个按特定序列排列的氨基酸组成。获得一个功能蛋白质的概率约10^74分之一，获得完整的最低必需蛋白质组概率远超宇宙的概率资源。\n\nDNA中的信息是功能性指定信息——核苷酸的特定排列指定了蛋白质的氨基酸序列，如同字母构成有意义的句子。弗朗西斯·柯林斯称DNA为\"上帝的语言\"，连发现DNA双螺旋的克里克也承认生物信息起源是深刻的谜。\n\n所有自然主义的生命起源解释——RNA世界假说、代谢优先理论等——都面临严重困难，特别是在解释功能性生物信息起源方面。正如诗篇139:13-14所说：\"我的肺腑是你所造的……我受造奇妙可畏。\"生命的精巧设计指向智慧的造物主。",
    "core_argument_en": "DNA molecules contain highly complex specified information, analogous to computer code. In all experience, complex specified information has one known source: intelligent mind. Natural processes can filter and modify existing information but have never been observed generating novel functional biological information from scratch.\n\nStephen Meyer in 'Signature in the Cell' argues: the simplest self-replicating cell requires at least 250 functional proteins, each of hundreds of amino acids in specific sequences. Probability of one functional protein is ~1 in 10^74; a complete minimal protein set far exceeds the universe's probability resources.\n\nDNA contains functional specified information — specific nucleotide arrangements specify amino acid sequences, like letters forming meaningful sentences. Francis Collins called DNA 'the language of God'; even DNA co-discoverer Crick acknowledged biological information's origin as a profound mystery.\n\nAll naturalistic origin-of-life explanations — RNA World hypothesis, metabolism-first theories — face severe difficulties, particularly regarding functional biological information's origin. As Psalm 139:13-14 states: 'You created my inmost being... I am fearfully and wonderfully made.' Life's intricate design points to an intelligent Creator."
  },
  "ath-008": {
    "core_argument_zh": "新约圣经是古代世界中文献证据最充分的著作。我们拥有超过5800份希腊文手稿、10000多份拉丁文手稿以及大量其他译本和教父引用。最早的手稿片段P52可追溯到约公元125年，距原作仅数十年。相比之下凯撒的《高卢战记》最早手稿距原作约1000年。\n\n文本批判学是通过比较大量手稿来重建原文的严谨方法。华莱士指出新约手稿的数量和质量使文本批判能以极高精度还原原文——99%以上已被准确重建，剩下不到1%的差异主要涉及拼写和词序变化，没有核心教义受影响。\n\n路加福音1:1-4是关键的历史学声明：路加明确表示在调查目击者证词后按次序写出福音书。考古学家威廉·拉姆齐最初以怀疑态度研究使徒行传，最终得出结论路加是\"第一流的历史学家\"。\n\n保罗的书信写于50年代（距耶稣生平仅20年），哥林多前书15:3-8的信经追溯到耶稣死后2-5年内。这种时间框架不允许传说发展——目击者仍在世可以纠正错误。正如彼得后书1:16：\"我们并不是随从乖巧捏造的虚言。\"",
    "core_argument_en": "The New Testament is the best-attested ancient work. We possess over 5,800 Greek manuscripts, 10,000+ Latin manuscripts, plus numerous translations and patristic citations. The earliest fragment P52 dates to ~AD 125, mere decades from the original. By contrast, Caesar's Gallic Wars earliest manuscript is ~1,000 years removed.\n\nTextual criticism rigorously reconstructs the original through manuscript comparison. Wallace notes the NT's manuscript quantity and quality enable reconstruction with extremely high precision — over 99% is accurately reconstructed, with the <1% differences mainly involving spelling and word order, affecting no core doctrine.\n\nLuke 1:1-4 provides a crucial historiographical statement: Luke explicitly investigated eyewitness testimony before writing his orderly account. Archaeologist William Ramsay initially studied Acts skeptically but concluded Luke was 'a historian of the first rank.'\n\nPaul's epistles were written in the AD 50s (only ~20 years after Jesus), and the 1 Corinthians 15:3-8 creed dates to within 2-5 years of the crucifixion. This timeframe doesn't allow legendary development — eyewitnesses were still alive to correct errors. As 2 Peter 1:16 declares: 'We did not follow cleverly devised myths.'"
  },
  "ath-009": {
    "core_argument_zh": "恶的问题通常被用来反对上帝存在，但仔细分析发现恶的存在实际上预设了客观道德标准——而这指向上帝。当无神论者说\"真正的恶存在\"时，不自觉地借用了有神论资源。在纯粹自然主义中，自然界无善恶之分：狮子吃羚羊不是\"恶\"，地震不是\"恶\"——只是自然事件。\n\n格雷格·巴恩森从前设护教学角度深化了这一论证：无神论者使用恶的问题反对上帝时，预设了自己的世界观无法提供的客观道德标准。在无神论框架下，如果人类只是进化偶然产物，\"恶\"不过是主观的不喜欢。但我们知道大屠杀不仅是\"不好的感觉\"——它是真正的客观恶。\n\n因此恶的问题非但不是对有神论的反驳，反而成了论证：如果客观恶存在，客观善也存在；如果客观善恶存在，必须有客观道德标准；如果有客观道德标准，必须有道德标准的赐予者——即上帝。\n\nC.S.路易斯描述了自己正是通过恶的问题发现了上帝：\"我反对上帝的论证恰恰证明了上帝。如果没有善恶之分，又何来不公义呢？\"他的经历说明了恶的问题——当你诚实地追问到底——最终指向的不是无神论，而是一位公义和慈爱的上帝。",
    "core_argument_en": "The problem of evil is typically wielded against God, but careful analysis reveals evil's existence presupposes an objective moral standard — pointing to God. When atheists say 'real evil exists,' they unwittingly borrow theistic resources. In pure naturalism, nature has no moral dimension: lions eating gazelles isn't 'evil,' earthquakes aren't 'evil' — they're natural events.\n\nGreg Bahnsen deepened this from a presuppositional perspective: atheists using the problem of evil presuppose something their worldview can't provide — an objective moral standard. Within atheism, if humans are evolutionary accidents, 'evil' is merely subjective dislike. But we know the Holocaust isn't just a 'bad feeling' — it's genuine objective evil.\n\nThus the problem of evil, far from refuting theism, becomes an argument for it: if objective evil exists, objective good exists; if objective good and evil exist, there must be an objective moral standard; if an objective moral standard exists, there must be a Moral Standard-Giver — God.\n\nC.S. Lewis described discovering God precisely through the problem of evil: 'My argument against God was itself the strongest argument for God. If there is no good and evil, what does injustice even mean?' His experience shows the problem of evil — honestly pursued to its logical end — points not to atheism but to a just and loving God."
  },
  "islam-004": {
    "core_argument_zh": "古兰经4:157声称耶稣并未真正被钉十字架（\"他们没有杀死他，也没有把他钉十字架，只是事情被弄得对他们有些模糊\"），但这一主张与古代历史记录严重矛盾。罗马历史学家塔西佗（约115年）记载基督在本丢·彼拉多手下受难；犹太历史学家约瑟夫斯（约93年）提到耶稣被彼拉多定罪钉十字架；犹太法典也提及耶稣的死刑。\n\n在学术界，耶稣死于十字架几乎是无可争议的历史事实。即使是最怀疑的学者约翰·多米尼克·克罗桑也说：\"耶稣被钉十字架在历史确定性方面几乎与任何事情一样确定。\"否认十字架的立场不是来自历史证据，而是来自古兰经600年后的神学重构。\n\n古兰经的\"替身论\"——即有人被变成耶稣的样子替他死——面临严重的神学和哲学困难：如果上帝使一个无辜者被误认为耶稣而受死，这意味着上帝主动制造了一个历史骗局，误导了数十亿人长达600年。这与上帝的诚实本性直接矛盾。\n\n基督教的十字架不仅有历史证据，更有深刻的神学意义：\"上帝在基督里叫世人与自己和好\"（哥林多后书5:19）。十字架不是失败而是胜利——是上帝之爱和公义的最高彰显。",
    "core_argument_en": "Quran 4:157 claims Jesus was not truly crucified ('they did not kill him, nor did they crucify him, but it appeared so to them'), but this contradicts ancient historical records. Roman historian Tacitus (~115 AD) records Christ suffering under Pontius Pilate; Jewish historian Josephus (~93 AD) mentions Jesus being condemned to crucifixion by Pilate; the Talmud also references Jesus' execution.\n\nAcademically, Jesus' death by crucifixion is virtually undisputed historical fact. Even the most skeptical scholar John Dominic Crossan says: 'Jesus' death by crucifixion is as historically certain as anything can be.' The denial comes not from historical evidence but from the Quran's theological reconstruction 600 years later.\n\nThe Quran's 'substitution theory' — someone being made to look like Jesus and dying in his place — faces severe theological and philosophical difficulties: if God caused an innocent person to be mistaken for Jesus and die, God actively created a historical deception misleading billions for 600 years. This directly contradicts God's truthful nature.\n\nThe Christian Cross has both historical evidence and profound theological meaning: 'God was reconciling the world to himself in Christ' (2 Corinthians 5:19). The Cross is not defeat but victory — the supreme display of God's love and justice."
  },
  "islam-005": {
    "core_argument_zh": "基督教教导的三位一体——圣父、圣子、圣灵是同一位上帝的三个位格——是圣经的明确教导。但古兰经对三位一体的批评似乎误解了这一教义，将其等同于\"上帝、耶稣和马利亚\"三位神（古兰经5:116）。正统基督教从未教导马利亚是神的一部分——古兰经批评的是一个基督教从未持有的立场。\n\n三位一体不是\"三个神\"（三神论），而是一位上帝在三个位格中存在。约翰福音1:1-3教导道（logos）在起初与上帝同在，道就是上帝，万物是借他造的。马太福音28:19的大使命公式\"奉父、子、圣灵的名（单数）给他们施洗\"将三个位格统一在一个\"名\"之下。\n\n三位一体也回答了一个深层哲学问题：如果上帝在创造之前就是爱的上帝（约翰一书4:8），那么在没有受造物之前他爱谁？一元论的上帝在创造之前是孤独的，需要受造物来表达爱——这使爱变得偶然而非本质。但三一上帝在创造之前就有位格之间的永恒相爱——父爱子，子爱父，在圣灵里有永恒的团契。\n\n因此三位一体不是抽象的神学拼图，而是对上帝本性的深刻洞见：上帝在本质上就是关系性的、爱的存在。这也是为什么人——按三一上帝的形象被造——天生渴望关系和爱。",
    "core_argument_en": "The Christian doctrine of the Trinity — Father, Son, and Holy Spirit as three persons of one God — is explicit biblical teaching. But the Quran's critique of the Trinity appears to misunderstand it, equating it with 'God, Jesus, and Mary' as three gods (Quran 5:116). Orthodox Christianity has never taught Mary is part of the Godhead — the Quran criticizes a position Christianity never held.\n\nThe Trinity is not 'three gods' (tritheism) but one God existing in three persons. John 1:1-3 teaches the Word (logos) was with God in the beginning and was God, and all things were made through Him. Matthew 28:19's Great Commission formula — 'baptizing in the name (singular) of the Father, Son, and Holy Spirit' — unifies three persons under one 'name.'\n\nThe Trinity also answers a deep philosophical question: if God was a God of love before creation (1 John 4:8), whom did He love before anything was created? A unitarian God was alone before creation, needing creatures to express love — making love contingent rather than essential. But the Triune God had eternal interpersonal love before creation — Father loving Son, Son loving Father, in eternal fellowship through the Spirit.\n\nThus the Trinity isn't an abstract theological puzzle but a profound insight into God's nature: God is inherently relational and loving. This is also why humans — made in the Triune God's image — inherently crave relationship and love."
  },
  "islam-006": {
    "core_argument_zh": "古兰经和新约对耶稣的描绘存在根本性的不可调和的矛盾。新约教导耶稣是上帝的儿子、是上帝道成肉身（约翰福音1:1, 14）、死在十字架上为人赎罪（哥林多前书15:3）、从死里复活了（哥林多前书15:4-8）。古兰经则说耶稣只是一个人类先知、否认他的神性（5:72, 116）、否认十字架（4:157）。\n\n这些不是可以调和的\"不同视角\"——它们是相互排斥的事实主张。耶稣要么是上帝，要么不是；要么死在十字架上，要么没有。逻辑排中律要求至少有一方是错的。\n\n在证据方面，新约的记载由与耶稣同时代的人或其直接跟随者写成（公元50-90年代），距事件仅20-60年。古兰经是一个人（穆罕默德）在600年后的记述，没有引用任何目击者来源。历史研究的基本原则是：较早的、多重独立的来源比较晚的、单一来源更可靠。\n\n新约不仅有内部多重见证（四福音书、保罗书信、其他使徒书信），还有外部来源的确认（塔西佗、约瑟夫斯、小普林尼、犹太法典等）。古兰经关于耶稣的记述则没有任何独立的历史确认。",
    "core_argument_en": "The Quran and New Testament present fundamentally irreconcilable portraits of Jesus. The NT teaches Jesus is the Son of God, God incarnate (John 1:1, 14), died on the cross for sins (1 Corinthians 15:3), and rose from the dead (1 Corinthians 15:4-8). The Quran says Jesus was merely a human prophet, denies his deity (5:72, 116), and denies the crucifixion (4:157).\n\nThese aren't reconcilable 'different perspectives' — they're mutually exclusive factual claims. Jesus either is God or isn't; either died on the cross or didn't. The law of excluded middle requires at least one side to be wrong.\n\nRegarding evidence, the NT was written by Jesus' contemporaries or their immediate followers (AD 50s-90s), only 20-60 years from events. The Quran is one person's (Muhammad's) account 600 years later, citing no eyewitness sources. A basic principle of historical research: earlier, multiply-attested independent sources are more reliable than later, single sources.\n\nThe NT has both multiple internal witnesses (four Gospels, Paul's letters, other apostolic letters) and external source confirmation (Tacitus, Josephus, Pliny the Younger, the Talmud, etc.). The Quran's account of Jesus has no independent historical confirmation."
  },
  "islam-007": {
    "core_argument_zh": "新约圣经的文本传承是古代世界中最可靠的。我们拥有超过5800份希腊文手稿、10000多份拉丁文手稿，以及数万份其他语言译本和教父引用。最早的手稿片段距离原作仅数十年。这使得文本批判学能够以极高的精度重建原文。\n\n相比之下，古兰经的文本传承历史虽然也相当完善，但面临着自身的文本问题。第三任哈里发奥斯曼标准化古兰经时焚毁了所有其他版本——这本身就说明存在不同版本。伊本·马斯欧德（穆罕默德推荐的古兰经四大权威之一）拥有与奥斯曼版不同的版本，少了两章。\n\n2015年发现的伯明翰古兰经手稿经碳-14测定可能早于穆罕默德的传统年代。也门萨那手稿显示了文本的早期修改痕迹。这些发现表明古兰经的文本传承历史可能比传统叙述更为复杂。\n\n关键区别在于：圣经的文本传承是透明的——我们知道哪里有差异并且可以进行比较分析。古兰经的其他版本被焚毁了，使得比较分析成为不可能。透明的传承历史实际上增强了圣经的可信度，而不是削弱它。",
    "core_argument_en": "The New Testament's textual transmission is the most reliable in the ancient world. We possess over 5,800 Greek manuscripts, 10,000+ Latin manuscripts, and tens of thousands of other translations and patristic citations. The earliest fragments are mere decades from the originals, enabling textual criticism to reconstruct the original with extremely high precision.\n\nBy contrast, the Quran's textual transmission, while also quite good, faces its own challenges. Caliph Uthman burned all variant versions when standardizing the Quran — this itself proves different versions existed. Ibn Masud (one of Muhammad's four recommended Quran authorities) possessed a version differing from Uthman's, lacking two surahs.\n\nThe Birmingham Quran manuscript (2015), carbon-14 dated potentially before Muhammad's traditional dates, raises questions about early Quran formation. The Sana'a manuscript shows early textual modifications. These discoveries suggest the Quran's textual history may be more complex than the traditional narrative.\n\nThe key difference: biblical textual transmission is transparent — we know where variants exist and can conduct comparative analysis. Other Quran versions were burned, making comparison impossible. Transparent transmission history actually enhances rather than diminishes biblical credibility."
  },
  "buddhism-006": {
    "core_argument_zh": "基督教和佛教对正念与冥想有根本不同的理解和目标。佛教冥想的目标是觉察\"无我\"和\"空性\"，最终消灭执着和欲望达到涅槃。基督教默想（meditation）的目标则是加深与有位格的上帝的关系——默想上帝的话语、属性和作为。\n\n世俗化的\"正念\"（mindfulness）已经脱离了佛教原始的灵性框架，被包装成纯粹的心理技术。但需要注意的是，正念背后的哲学假设——如\"一切都是无常的\"、\"自我是幻觉\"——与基督教的世界观不兼容。基督教教导有永恒不变的上帝、有真实的自我（按上帝形象被造）、有永恒的盼望。\n\n从实际效果来看，基督教的祷告和默想同样具有心理健康的益处（这已有科学研究支持），但更重要的是它指向一位真实的、有位格的上帝。佛教冥想中\"观察者\"（被认为是\"无我\"的）的悖论在基督教中不存在：你是一个真实的人格，被一位真实的上帝所爱。\n\n此外，基督教的灵性操练（祷告、圣经默想、团契、敬拜）是在关系中进行的——与上帝的关系和与信仰群体的关系。这反映了人按照关系性的三一上帝的形象被造这一真理。",
    "core_argument_en": "Christianity and Buddhism have fundamentally different understandings and goals for mindfulness and meditation. Buddhist meditation aims to perceive 'no-self' and 'emptiness,' ultimately extinguishing attachment and desire to reach Nirvana. Christian meditation aims to deepen relationship with a personal God — meditating on God's Word, attributes, and works.\n\nSecularized 'mindfulness' has been stripped of Buddhism's spiritual framework and packaged as pure psychological technique. But the philosophical assumptions behind mindfulness — 'everything is impermanent,' 'the self is an illusion' — are incompatible with Christianity. Christianity teaches an eternally unchanging God, a real self (made in God's image), and eternal hope.\n\nPractically, Christian prayer and meditation also have mental health benefits (scientifically supported), but more importantly point to a real, personal God. The paradox of the 'observer' in Buddhist meditation (considered to be 'no-self') doesn't exist in Christianity: you are a real person, loved by a real God.\n\nFurthermore, Christian spiritual practices (prayer, Scripture meditation, fellowship, worship) occur within relationships — with God and the faith community. This reflects the truth that humans are made in the image of the relational Triune God."
  },
  "sec-004": {
    "core_argument_zh": "后现代主义的道德相对主义声称没有客观的善恶标准——一切都是文化建构、权力关系或个人选择。但这个立场在逻辑上是自我拆台的：说\"没有客观真理\"本身就是一个客观真理声称。如果道德真的是相对的，那么说\"种族歧视是错误的\"就只是一种文化偏好，而非客观事实。\n\n文化相对主义面临\"改革者困境\"：如果道德由文化决定，那么任何挑战自己文化的改革者（如马丁·路德·金反对种族隔离）在定义上就是\"不道德的\"，因为他在违背文化共识。但我们直觉上知道有些文化实践（如奴隶制、种族灭绝）是客观错误的，不管多少人支持。\n\n改革宗认识论提供了坚实的基础：上帝的本性是善的终极标准，上帝的启示（自然律和圣经）使人能认识客观道德。这不是武断的权威主义——上帝不是任意规定善恶，而是善恶根植于上帝不变的本性中。\n\n值得注意的是，即使是最彻底的道德相对主义者在实际生活中也无法贯彻自己的理论。当他们的财物被偷、当有人在他们背后说谎、当他们遭受不公正对待时，他们立刻会诉诸客观道德标准——这恰恰说明道德相对主义在理论上可能有趣，但在人类实际道德体验中是站不住的。",
    "core_argument_en": "Postmodern moral relativism claims no objective good or evil exists — everything is cultural construction, power relations, or personal choice. But this position is logically self-defeating: 'there is no objective truth' is itself an objective truth claim. If morality is truly relative, saying 'racism is wrong' is merely cultural preference, not objective fact.\n\nCultural relativism faces the 'reformer's dilemma': if culture determines morality, any reformer challenging their own culture (like MLK opposing segregation) is by definition 'immoral' — violating cultural consensus. Yet we intuitively know some cultural practices (slavery, genocide) are objectively wrong regardless of how many people support them.\n\nReformed epistemology provides a solid foundation: God's nature is the ultimate standard of good, and God's revelation (natural law and Scripture) enables moral knowledge. This isn't arbitrary authoritarianism — God doesn't randomly decree good and evil; rather, morality is grounded in God's unchanging nature.\n\nNotably, even the most thoroughgoing moral relativists cannot live by their theory. When their property is stolen, when someone lies about them, when they're treated unjustly, they immediately appeal to objective moral standards — showing moral relativism may be theoretically interesting but is unsustainable in actual moral experience."
  },
  "sec-005": {
    "core_argument_zh": "如果上帝不存在，人权就失去了客观基础。历史上人权的概念正是从基督教神学中发展出来的：人按上帝的形象被造（创世记1:27），因此每个人都有固有的、不可剥夺的尊严和价值。在纯粹唯物主义的框架下，人类只是进化的偶然产物——凭什么享有\"神圣不可侵犯\"的权利？\n\n独立宣言说\"人人生而平等，造物主赋予他们若干不可剥夺的权利\"——注意这里明确将权利的来源归于\"造物主\"。这不是偶然的措辞，而是反映了洛克和杰弗逊等人的信念：没有超越性的基础，人权就只是人类的约定，可以被其他人类约定取消。\n\n从历史来看，基督教一直是人权和社会正义运动的主要推动力：废奴运动（威廉·威尔伯福斯）、民权运动（马丁·路德·金）、反种族隔离（德斯蒙德·图图）、妇女教育、医疗服务、反人口贩卖。这些运动的领袖不仅是基督徒，而且他们的动力明确来自基督教信念——每个人按上帝形象被造。\n\n世俗人文主义试图在没有上帝的情况下维持人权，但面临着\"搭便车\"问题——他们享受基督教遗产的果实，同时砍掉产生这些果实的根。尼采比当代的新无神论者更诚实：他认识到\"上帝死了\"意味着一切价值——包括人权——都需要被重新评估。",
    "core_argument_en": "Without God, human rights lose their objective foundation. Historically, human rights concepts developed precisely from Christian theology: humans made in God's image (Genesis 1:27), giving every person inherent, inalienable dignity and worth. In a purely materialist framework, humans are merely accidental evolutionary products — what grounds 'sacred and inviolable' rights?\n\nThe Declaration of Independence states 'all men are created equal, endowed by their Creator with certain unalienable rights' — explicitly attributing rights to a 'Creator.' This wasn't accidental but reflects Locke's and Jefferson's conviction: without a transcendent foundation, rights are merely human conventions cancelable by other conventions.\n\nHistorically, Christianity has driven human rights and social justice movements: abolition (William Wilberforce), civil rights (Martin Luther King Jr.), anti-apartheid (Desmond Tutu), women's education, healthcare, anti-trafficking. These leaders were not just Christians but explicitly motivated by Christian conviction — every person made in God's image.\n\nSecular humanism tries maintaining rights without God, but faces a 'free rider' problem — enjoying the fruits of Christian heritage while cutting the root that produced them. Nietzsche was more honest than today's new atheists: he recognized 'God is dead' means all values — including human rights — require reevaluation."
  },
  "sec-006": {
    "core_argument_zh": "如果宇宙是纯粹物质的、没有设计者、没有目的，那么人生的意义从何而来？无神论存在主义承认了这个困境——萨特说\"存在先于本质\"，加缪说人生是荒谬的。但他们的\"解决方案\"——自己创造意义——面临着根本问题：如果宇宙本身没有意义，你怎么能在其中创造真正的意义？自我赋予的意义只是自我欺骗的精致形式。\n\n托尔斯泰在《忏悔录》中描述了他的存在主义危机：尽管他拥有文学成就、家庭幸福和财富，但\"生命的意义\"问题几乎把他逼到自杀的边缘。他最终在基督教信仰中找到了答案——不是通过抽象哲学，而是通过与永生上帝的位格关系。\n\n基督教提供了一个有根基的意义观：人是被一位有位格的上帝有目的地创造的，被赋予了特定的使命（爱上帝、爱人）和永恒的盼望。这种意义不是自我发明的，而是被发现的——就像你不会\"发明\"自己生命的目的，而是\"发现\"创造者赋予你的目的。\n\n此外，基督教的盼望超越了个人死亡和宇宙的终结：上帝应许\"新天新地\"（启示录21:1），在那里\"不再有死亡、也不再有悲哀、哭号\"。这不是逃避现实，而是终极现实——如果基督复活了，那么这个盼望就有历史证据的支撑。",
    "core_argument_en": "If the universe is purely material with no designer and no purpose, where does life's meaning come from? Atheistic existentialism acknowledged this predicament — Sartre said 'existence precedes essence,' Camus called life absurd. But their 'solution' — creating your own meaning — faces a fundamental problem: if the universe itself has no meaning, how can you create genuine meaning within it? Self-assigned meaning is merely sophisticated self-deception.\n\nTolstoy described in 'A Confession' his existential crisis: despite literary achievement, family happiness, and wealth, the question of 'life's meaning' nearly drove him to suicide. He ultimately found his answer in Christian faith — not through abstract philosophy but through personal relationship with the living God.\n\nChristianity offers a grounded view of meaning: humans were purposefully created by a personal God, given specific mission (love God, love people) and eternal hope. This meaning isn't self-invented but discovered — you don't 'invent' your life's purpose but 'discover' the purpose your Creator gave you.\n\nMoreover, Christian hope transcends personal death and cosmic ending: God promises 'a new heaven and new earth' (Revelation 21:1) where 'there will be no more death or mourning or crying.' This isn't escapism but ultimate reality — if Christ rose, this hope has historical evidence backing it."
  },
  "sec-007": {
    "core_argument_zh": "科学主义（scientism）认为只有科学方法才能给我们可靠的知识，但这个立场本身就是自我拆台的——\"只有科学能给我们知识\"这个声称本身不是一个科学发现，而是一个哲学立场。它无法被实验测试或观察证实。科学主义不是科学的结论，而是一种信念。\n\n科学方法预设了许多非科学的前提：（1）自然界的一致性（归纳法假设过去的规律将来也适用——但这无法被科学证明）；（2）逻辑法则的有效性（科学推理依赖逻辑，但逻辑是先验的，不是科学发现）；（3）数学的可靠性（物理学依赖数学，但数学真理不是经验发现）；（4）人类理性的可信度（我们信任大脑的推理能力——但这个信任本身不是科学实验的结果）。\n\n著名的哲学家和科学家都承认科学的局限性。物理学家约翰·波尔金霍恩指出，科学回答\"怎样\"的问题，但不能回答\"为什么\"。化学家彼得·阿特金斯虽然是无神论者，也承认科学不能解释为什么有自然律。科学是探索自然界的强大工具，但将它绝对化为唯一的知识来源就超出了它的合法范围。\n\n基督教完全支持科学研究（历史上是基督教推动了科学的诞生），但它认识到科学是人类知识的一部分，不是全部。道德知识、美学判断、形而上学真理、历史知识——这些都是真正的知识，但都不是通过科学方法获得的。",
    "core_argument_en": "Scientism holds only scientific method yields reliable knowledge, but this position is self-defeating — 'only science gives knowledge' is not itself a scientific discovery but a philosophical stance. It can't be experimentally tested or observationally confirmed. Scientism isn't a conclusion of science but a belief.\n\nScience presupposes many non-scientific premises: (1) Nature's uniformity (induction assumes past regularities continue — unprovable by science); (2) Logical laws' validity (scientific reasoning requires logic, but logic is a priori, not a scientific discovery); (3) Mathematics' reliability (physics depends on math, but mathematical truths aren't empirical discoveries); (4) Human reason's trustworthiness (we trust our brain's reasoning — but this trust itself isn't an experimental result).\n\nProminent philosophers and scientists acknowledge science's limits. Physicist John Polkinghorne notes science answers 'how' questions but not 'why.' Chemist Peter Atkins, though an atheist, admits science can't explain why natural laws exist. Science is a powerful tool for exploring nature, but absolutizing it as the only knowledge source exceeds its legitimate scope.\n\nChristianity fully supports scientific research (historically Christianity birthed modern science) but recognizes science is part of human knowledge, not all of it. Moral knowledge, aesthetic judgment, metaphysical truth, historical knowledge — all are genuine knowledge obtained through non-scientific means."
  },
  "cults-004": {
    "core_argument_zh": "新兴教派常常偏离核心正统教义，但包装在基督教的术语和形式中，使信徒难以辨别。辨别真假教导的关键标准包括：（1）基督的位格——耶稣是否被承认为完全的上帝和完全的人？（2）救恩的方式——是唯独恩典、因信称义，还是需要人的功德或特定仪式？（3）圣经的权威——是否有\"额外启示\"被置于圣经之上？（4）领袖的角色——是否有不可质疑的人类权威？\n\n使徒信经和尼西亚信经代表了基督教两千年的核心共识。任何偏离这些核心教义的教导都应该引起警惕。加拉太书1:8-9保罗严厉警告：\"即便是我们，或天上来的使者，若传福音给你们，与我们所传给你们的不同，他就应当被咒诅。\"\n\n新兴教派的常见特征包括：（a）一个有绝对权威的领袖，其解释优先于圣经；（b）信息控制——限制成员接触外部信息；（c）\"我们对，所有人都错\"的心态；（d）离开的高代价（被剥夺社交关系、被诅咒等）。这些特征与基督教的基本精神——自由、真理、爱——相违背。\n\n辨别力不是怀疑一切，而是\"凡事察验，善美的要持守\"（帖撒罗尼迦前书5:21）。帖撒罗尼迦的信徒被称赞为\"贤于\"其他人，因为他们\"天天考查圣经\"来验证所听到的教导（使徒行传17:11）。",
    "core_argument_en": "Emerging sects often deviate from core orthodox doctrines while wrapped in Christian terminology and forms, making discernment difficult. Key criteria include: (1) Christ's person — is Jesus acknowledged as fully God and fully human? (2) Means of salvation — grace alone through faith, or requiring human merit or special rituals? (3) Scripture's authority — is 'extra revelation' placed above the Bible? (4) Leadership — is there unquestionable human authority?\n\nThe Apostles' and Nicene Creeds represent two millennia of Christian core consensus. Any teaching deviating from these core doctrines should raise concern. Galatians 1:8-9, Paul warns sternly: 'Even if we or an angel from heaven should preach a gospel other than the one we preached, let them be under God's curse.'\n\nCommon characteristics of emerging sects include: (a) A leader with absolute authority whose interpretation supersedes Scripture; (b) Information control — restricting members' external information access; (c) 'We're right, everyone else is wrong' mentality; (d) High cost of leaving (social shunning, curses, etc.). These contradict Christianity's fundamental spirit of freedom, truth, and love.\n\nDiscernment isn't doubting everything but 'testing everything and holding fast to what is good' (1 Thessalonians 5:21). The Thessalonians were commended as 'more noble' because they 'examined the Scriptures daily' to verify teachings (Acts 17:11)."
  },
  "cults-005": {
    "core_argument_zh": "在多元化的宗教环境中，基督教的核心信息——福音——提供了独特而完整的救赎方案。福音的核心是：人因罪与上帝隔绝，无法通过自己的努力获得拯救，但上帝在基督里主动施行拯救，通过耶稣的十字架和复活使信靠祂的人与上帝和好。\n\n这个信息与所有其他宗教和世俗方案的根本区别在于\"恩典\"原则。几乎所有其他体系（宗教的和世俗的）都以某种形式的\"业绩\"为基础——做好事、积功德、遵守律法、修炼自我、为社会做贡献。基督教独特地宣告：救恩完全是上帝白白的恩典，不是人的功劳。\"你们得救是本乎恩，也因着信；这并不是出于自己，乃是上帝所赐的\"（以弗所书2:8）。\n\n这种恩典不是廉价的。迪特里希·朋霍费尔区分了\"廉价的恩典\"和\"重价的恩典\"。福音的恩典是重价的——它的代价是上帝自己在十字架上的牺牲。但对于接受者来说，它完全是白白的——你不需要也不可能赚取它。这解决了人类宗教经验中最深层的焦虑：我是否足够好？我做的够不够多？福音的回答是：不是你的好，而是基督的好。\n\n在面对其他宗教和邪教的替代方案时，基督徒需要既有真理的确信也有爱的态度——\"用温柔敬畏的心回答各人\"（彼得前书3:15）。福音不是通过强制传播的，而是通过生命见证和真理宣讲传递的。",
    "core_argument_en": "In a pluralistic religious landscape, Christianity's core message — the Gospel — provides a unique and complete salvation plan. The Gospel's core: humans are separated from God by sin, unable to save themselves, but God in Christ actively provides salvation through Jesus' cross and resurrection, reconciling believers with God.\n\nThis message's fundamental distinction from all other religious and secular systems is the 'grace' principle. Nearly all other systems (religious and secular) are 'performance'-based — doing good, accumulating merit, keeping laws, self-cultivation, contributing to society. Christianity uniquely declares: salvation is entirely God's free grace, not human achievement. 'It is by grace you have been saved, through faith — and this is not from yourselves, it is the gift of God' (Ephesians 2:8).\n\nThis grace isn't cheap. Dietrich Bonhoeffer distinguished 'cheap grace' from 'costly grace.' Gospel grace is costly — its price was God's own sacrifice on the cross. But for recipients, it's entirely free — you don't need to and cannot earn it. This resolves humanity's deepest religious anxiety: Am I good enough? Have I done enough? The Gospel answers: it's not about your goodness but Christ's.\n\nFacing alternative offers from other religions and cults, Christians need both truthful conviction and loving attitude — 'always being prepared to give an answer with gentleness and respect' (1 Peter 3:15). The Gospel spreads not through coercion but through life witness and truth proclamation."
  },
  "cults-006": {
    "core_argument_zh": "唯独圣经（Sola Scriptura）是宗教改革的核心原则之一：圣经是信仰和实践的最终权威。这不是说圣经是唯一的知识来源（那是\"唯独论\"Nuda Scriptura），而是说在信仰和教义的争议中，圣经拥有最高和最终的裁决权。教会传统、信条和个人经验都有价值，但必须受圣经的检验和纠正。\n\n这一原则在面对异端和邪教时尤为重要。异端的共同特征是在圣经之外增加或替代权威来源：摩门教加入了《摩门经》、全能神教加入了新的\"神的话语\"、耶和华见证人依赖守望台的解释。当一个组织声称有超越圣经的权威来源时，它就打开了通向教义偏差的大门。\n\n历史上教会最严重的错误——如中世纪赎罪券的买卖——正是因为教会传统被置于圣经权威之上而产生的。路德通过回到圣经本身，发现了\"义人必因信得生\"（罗马书1:17）的福音真理。唯独圣经原则保护教会不受人为传统的腐蚀。\n\n唯独圣经的实质在早期教会中已有深厚根基。奥古斯丁明确表示只将正典圣经放在不可质疑的最高权威地位。伊里奈乌在反对诺斯替异端时一贯诉诸使徒所传的圣经作为真理标准。这不是路德的发明，而是对使徒传统的回归。",
    "core_argument_en": "Sola Scriptura is a core Reformation principle: Scripture is the ultimate authority for faith and practice. This doesn't mean Scripture is the only knowledge source (that's Nuda Scriptura) but that in faith and doctrinal disputes, Scripture holds supreme and final adjudicating authority. Church tradition, creeds, and personal experience have value but must be tested and corrected by Scripture.\n\nThis principle is especially vital when confronting heresies and cults. Heresies share the common feature of adding or substituting authority sources beyond Scripture: Mormonism adds the Book of Mormon, Eastern Lightning adds new 'words of God,' JWs rely on Watchtower interpretations. When an organization claims authority surpassing Scripture, it opens the door to doctrinal deviation.\n\nHistory's worst church errors — like medieval indulgence sales — arose precisely from placing church tradition above Scripture's authority. Luther, returning to Scripture itself, discovered the Gospel truth: 'The righteous shall live by faith' (Romans 1:17). Sola Scriptura protects the church from human tradition's corruption.\n\nSola Scriptura's substance was already deeply rooted in the early church. Augustine explicitly placed only canonical Scripture in the highest, unquestionable authority position. Irenaeus, opposing Gnostic heresies, consistently appealed to the apostolic Scriptures as the truth standard. This was not Luther's invention but a return to apostolic tradition."
  },
  "pre-001": {
    "core_argument_zh": "前设护教学（Presuppositional Apologetics）由哥尼流·范泰尔（Cornelius Van Til）发展，后由格雷格·巴恩森（Greg Bahnsen）推广，认为所有人的思想和推理都建立在某些前设（presuppositions）之上，而只有基督教的前设能够为逻辑、科学和道德提供一致的基础。无神论世界观无法解释逻辑规律的存在、自然界的一致性和道德的客观性——它必须在不自觉中\"借用\"基督教的世界观资源。\n\n范泰尔论证说，传统护教学（如托马斯主义或古典证据主义）的问题在于它承认了非信徒的认识论立足点的合法性，试图在\"中立\"的基础上进行论证。但范泰尔认为不存在认知的中立地带——每个人的推理都被其最终前设所塑造。基督徒的前设是三一上帝已经启示了自己；无神论者的前设是自主的人类理性是一切知识的起点。\n\n巴恩森在著名的\"巴恩森-斯坦论辩\"中展示了前设方法的力量。他向无神论者提出\"超验论证\"（Transcendental Argument for God, TAG）：如果上帝不存在，你连论证上帝不存在的能力都没有——因为逻辑、科学方法和道德推理都预设了一个有理性的、有秩序的、有道德目的的宇宙，而这些特征只能在有神论的框架中得到说明。\n\n前设方法的实际应用是：不要试图在非信徒的前设基础上证明上帝存在，而是要揭示非信徒前设的内在矛盾，同时展示基督教世界观如何为一切人类知识和经验提供唯一连贯的基础。正如罗马书1:18-20所教导的，所有人在内心深处都知道上帝存在，只是在不义中压制真理。",
    "core_argument_en": "Presuppositional Apologetics, developed by Cornelius Van Til and popularized by Greg Bahnsen, holds that all human thought and reasoning rest on certain presuppositions, and only Christian presuppositions can provide a consistent foundation for logic, science, and morality. Atheistic worldviews cannot account for the existence of logical laws, nature's uniformity, or morality's objectivity — they must unconsciously 'borrow' from the Christian worldview.\n\nVan Til argued traditional apologetics (Thomistic or classical evidentialist) err by conceding the legitimacy of the unbeliever's epistemological starting point, attempting to argue on 'neutral' ground. But Van Til maintained no cognitive neutral ground exists — everyone's reasoning is shaped by their ultimate presuppositions. The Christian's presupposition is that the Triune God has revealed Himself; the atheist's is that autonomous human reason is the starting point for all knowledge.\n\nBahnsen demonstrated the presuppositional method's power in the famous 'Bahnsen-Stein Debate,' presenting the Transcendental Argument for God (TAG): if God doesn't exist, you wouldn't even have the ability to argue He doesn't — because logic, scientific method, and moral reasoning all presuppose a rational, orderly, morally purposeful universe, features only accountable within a theistic framework.\n\nThe method's practical application: instead of proving God's existence on the unbeliever's presuppositions, reveal the internal contradictions of non-Christian presuppositions while demonstrating how the Christian worldview provides the only coherent foundation for all human knowledge and experience. As Romans 1:18-20 teaches, all people deep down know God exists but suppress the truth in unrighteousness."
  },
  "pre-002": {
    "core_argument_zh": "逻辑规律（如矛盾律：某事物不能同时既是A又不是A）是普遍的、必然的、不变的。但在无神论的唯物主义世界观中，这些规律的存在无法得到解释。如果宇宙只是物质和能量的偶然组合，为什么会存在非物质的、普遍的、必然的逻辑规律？物质可以改变，但逻辑规律不变；物质是具体的，但逻辑规律是抽象的；物质是偶然的，但逻辑规律是必然的。\n\n无神论者在使用逻辑来反对上帝存在时，实际上预设了一个他们的世界观无法解释的东西。这就是前设护教学的核心洞察：你反对上帝的工具（逻辑）本身就需要上帝来解释它的存在。正如巴恩森所说：\"无神论者不是站在自己的地面上反对上帝——他是站在上帝的地面上反对上帝。\"\n\n基督教世界观为逻辑规律提供了自然的解释：逻辑规律反映了上帝理性本性的不变特征。上帝是全知的、理性的、不变的，逻辑规律是上帝思维方式的表达。因为上帝创造了人按他的形象，人天生就有逻辑推理的能力——但这种能力的基础在于上帝，而非自主的人类理性。\n\n这个论证不是说无神论者不能使用逻辑（他们显然可以），而是说他们的世界观无法为逻辑的存在提供一致的解释。正如一个人可以在不知道氧气存在的情况下呼吸，无神论者可以在不承认上帝的情况下使用逻辑——但逻辑的存在条件仍然需要解释。",
    "core_argument_en": "Laws of logic (e.g., the law of non-contradiction: something cannot be both A and not-A simultaneously) are universal, necessary, and invariant. But in atheistic materialism, these laws' existence cannot be explained. If the universe is merely an accidental arrangement of matter and energy, why do immaterial, universal, necessary logical laws exist? Matter changes, but logical laws don't; matter is particular, but logical laws are abstract; matter is contingent, but logical laws are necessary.\n\nWhen atheists use logic to argue against God's existence, they presuppose something their worldview cannot explain. This is presuppositional apologetics' core insight: the very tool you use against God (logic) requires God to explain its existence. As Bahnsen said: 'The atheist is not standing on his own ground to oppose God — he is standing on God's ground to oppose God.'\n\nThe Christian worldview naturally explains logical laws: they reflect God's invariant rational nature. God is all-knowing, rational, and unchanging; logical laws express God's way of thinking. Because God created humans in His image, humans have innate logical reasoning ability — but this ability's foundation is in God, not autonomous human reason.\n\nThis argument doesn't claim atheists cannot use logic (they obviously can) but that their worldview cannot provide a consistent explanation for logic's existence. Just as one can breathe without knowing oxygen exists, atheists can use logic without acknowledging God — but logic's existence conditions still require explanation."
  },
  "pre-003": {
    "core_argument_zh": "科学方法依赖于一个关键假设：自然界是有规律的、可预测的（自然界的一致性，uniformity of nature）。我们假设过去的规律将来也适用，物理定律在宇宙各处都一样。但这个假设本身无法被科学证明——它是科学的前设，不是科学的结论。在无神论世界观中，为什么一个偶然产生的宇宙应该具有可靠的规律性？为什么明天的物理定律应该和今天一样？大卫·休谟提出的\"归纳问题\"正是指出了这个哲学困难。\n\n无神论者无法逃避这个问题。说\"自然界一直都是有规律的，所以将来也会是\"——这是循环论证，因为你正是用归纳法来证明归纳法的可靠性。说\"科学假设一致性，而科学是成功的\"——这也是循环的，因为\"科学成功\"的评判也依赖于归纳法（过去的成功预示未来的成功）。\n\n基督教世界观为自然界的一致性提供了真正的基础：一位信实的、不变的上帝创造并维持了宇宙的秩序。\"耶和华的信实存到万代\"（诗篇119:90）。上帝与挪亚的约（创世记8:22）应许了自然秩序的持续性——\"地还存留的时候，稼穑、寒暑、冬夏、昼夜就永不停息了。\"自然规律的可靠性不是偶然的——它反映了创造者的信实本性。\n\n这也解释了为什么现代科学诞生于基督教文明中而非其他文化：科学家们相信自然界有可发现的规律，正是因为他们相信一位理性的上帝创造了一个有序的宇宙。开普勒说他是在\"思考上帝的想法\"（thinking God's thoughts after Him）。",
    "core_argument_en": "The scientific method depends on a key assumption: nature is regular and predictable (uniformity of nature). We assume past regularities continue and physical laws are universal. But this assumption cannot be scientifically proven — it is science's presupposition, not its conclusion. In an atheistic worldview, why should an accidentally-produced universe have reliable regularity? Why should tomorrow's physics match today's? David Hume's 'problem of induction' identified precisely this philosophical difficulty.\n\nAtheists cannot escape this. Saying 'nature has always been regular, so it will continue' is circular — using induction to prove induction's reliability. Saying 'science assumes uniformity and science works' is also circular — judging 'science works' also depends on induction (past success predicts future success).\n\nThe Christian worldview provides a genuine foundation for nature's uniformity: a faithful, unchanging God who created and sustains cosmic order. 'The Lord's faithfulness continues through all generations' (Psalm 119:90). God's covenant with Noah (Genesis 8:22) promises nature's continuity — 'As long as the earth endures, seedtime and harvest, cold and heat, summer and winter, day and night will never cease.' Natural law's reliability isn't accidental — it reflects the Creator's faithful nature.\n\nThis also explains why modern science was born in Christian civilization rather than elsewhere: scientists believed nature had discoverable laws precisely because they believed a rational God created an orderly universe. Kepler said he was 'thinking God's thoughts after Him.'"
  }
}