[{"num":1,"q":"人一生的首要目的（chief end）是什么？","a":"（一）荣耀神；（二）以祂为乐，直到永远。"},{"num":2,"q":"神曾赐下什么准则，指教我们可以怎样荣耀祂，以祂为乐？","a":"神的道（就是载于新旧两约的圣经）是惟一的准则，指教我们可以怎样荣耀神，以祂为乐。"},{"num":3,"q":"圣经主要教导的是什么？","a":"（一） 人对于神当信的真理，（二） 神要求人当尽的本分。"},{"num":4,"q":"神是怎样的神？","a":"神是个灵，祂的本体、智慧、权能、圣洁、公义、恩慈、真实，都是无限无量、无始无终，永无改变的。"},{"num":5,"q":"神是独一的吗？","a":"神是独一无二、又真又活的。"},{"num":6,"q":"神有几个位格？","a":"神有三个位格：就是圣父、圣子、圣灵；这三个位格是同一位神，同质、同权、同荣。"},{"num":7,"q":"神的元旨是什么？","a":"神的元旨（decrees of God）就是祂在永恒中所定的心意；这乃是照着祂旨意的计划，借此预定一切将要发生的事，使祂自己得荣耀。"},{"num":8,"q":"神怎样执行祂的元旨？","a":"神用创造和护理之工来执行祂的元旨。"},{"num":9,"q":"创造之工是什么？","a":"创造之工，是神用祂权能的话，在六日之内，从无有中造出万有，并且都甚好。"},{"num":10,"q":"神怎样造人？","a":"神照着自己的形像造男造女，有知识、仁义、圣洁，并赋予他们管理、支配一切受造之物的权柄。"},{"num":11,"q":"神的护理之工是什么？","a":"神的护理之工，就是用祂至高的圣洁、智慧、权能，保护祂所造的万物，并且管理他们一切的动作。"},{"num":12,"q":"神造人的时候，有什么特别的护理之工？","a":"当神造人时，就与人立了生命之约（covenant of life）──这约是以完全顺服为条件，禁止人吃分别善恶树的果子，否则必受死亡的刑罚。"},{"num":13,"q":"始祖守住他们被造的地位吗？","a":"始祖因为神让他们凭自己的意思作决定，于是他们犯罪违背了神，就从被造的地位堕落了。"},{"num":14,"q":"罪是什么？","a":"凡不遵守或违背神的律法的，都是罪。"},{"num":15,"q":"始祖犯了什么罪，而从被造的地位中堕落呢？","a":"始祖因吃了禁果，就从被造的地位堕落了。"},{"num":16,"q":"亚当初次犯罪时，世人都在这罪中和他一同堕落了吗？","a":"神和亚当所立的约，不是单为他自己，也是为他的后裔；所以，所有的人类──凡按一般的方式从亚当而生的人，都在亚当初次的过犯中和他一同犯了罪、一同堕落了。"},{"num":17,"q":"始祖堕落将世人陷入什么境况中？","a":"始祖堕落将世人陷入罪恶和苦境中。"},{"num":18,"q":"世人堕落陷入罪恶的境况，这罪恶的实质内容是什么？","a":"（一） 我们要承担亚当初次犯罪所负的罪债；（二） 我们丧失了原有的仁义，整个人性因而败坏，这就是所谓的原罪；（三） 从原罪所犯的一切本罪。"},{"num":19,"q":"世人因着堕落，陷入怎样的苦境中？","a":"全人类由于堕落，丧失了与神之间的相交，反落在神的忿怒和咒诅之下，要受今生的一切愁苦悲惨，就是要死亡，并且永远在地狱受苦。"},{"num":20,"q":"神任凭世人在罪恶和苦境中沉沦吗？","a":"神在永恒里，按着自己意旨所喜悦的，拣选了一些人得永生，就为他们立下恩典之约，要借着一位救主，救他们脱离罪恶和苦境，而进入蒙拯救的地位。"},{"num":21,"q":"谁是神选民的救赎主？","a":"神选民惟一的救赎主就是主耶稣基督。祂从永恒就是神的儿子，但在时候满足时，便降世为人；此后，神人两性虽在同一位格里却清晰可分，并成为一位，直到永远。"},{"num":22,"q":"基督既为神的儿子，又是如何成为人的？","a":"神的儿子耶稣基督成为人，乃是取了人真实的身体和有理性的灵魂（reasonable soul），借着圣灵的能力，在童女马利亚的腹中成胎而生，但是没有罪。"},{"num":23,"q":"基督作为我们的救赎主，所要执行的职分是什么？","a":"基督作为我们的救赎主，在降卑与升高的境况中执行先知、祭司、君王的职分。"},{"num":24,"q":"基督如何执行先知的职分？","a":"基督执行先知的职分，在于用祂的道和圣灵，将神的旨意启示给我们，为要叫我们得救。"},{"num":25,"q":"基督如何执行祭司的职分？","a":"基督执行祭司的职分，在于将自己一次献上为祭，以满足人对神公义的亏欠，并使我们与神和好；又持续不断地为我们代求。"},{"num":26,"q":"基督如何执行君王的职分？","a":"基督执行君王的职分，在于使我们降服、归向祂，治理、保护我们；并且克制、征服祂和我们的仇敌。"},{"num":27,"q":"「基督的降卑」所指为何？","a":"基督的降卑在于降生为人，且生在卑微的环境中，又服在律法之下；忍受今生的苦难、神的震怒，和被咒诅的十架死亡；被埋葬，暂时伏于死权之下。"},{"num":28,"q":"「基督的升高」所指为何？","a":"基督的升高，在于第三日从死里复活，升上高天，坐在父神的右边，并要在末日来审判世界。"},{"num":29,"q":"我们如何才能领受基督所完成的赎罪之恩？","a":"我们要领受基督所完成的赎罪之恩，必须借着圣灵将这恩有效应用在我们身上。"},{"num":30,"q":"圣灵如何使基督赎罪之恩，有效应用在我们身上？","a":"圣灵使基督赎罪之恩在我们心里发生效力，乃是借着祂运行在我们里面的信心，又借着祂有效的恩召（effectual calling），使我们与基督联合。"},{"num":31,"q":"「有效的恩召」是什么？","a":"有效的恩召是神的灵所完成的工作，使我们觉悟自己的罪恶和苦境，又光照我们的心使我们认识基督，并更新我们的心志；借以劝服我们，叫我们能接受在福音中所白白赐给我们的耶稣基督。"},{"num":32,"q":"人蒙了有效的恩召，可以在今世得着什么益处？","a":"人蒙了有效的恩召，在今世所得的益处就是称义、得儿子的名分、成圣，并因着这些在今世所带来的一切福乐。"},{"num":33,"q":"「称义」是什么？","a":"「称义」是我们从神白白领受恩典的动作，神借此赦免我们一切的罪恶，接纳我们在祂面前为义人；这都因为祂将基督的义算为我们的义，而我们只是凭信心接受而已。"},{"num":34,"q":"「得儿子的名分」是什么？","a":"「得儿子的名分」是我们从神白白领受恩典的作为，我们因此被收纳算为神众子的一员，有权享受神众子一切的特权。"},{"num":35,"q":"「成圣」是什么？","a":"「成圣」是我们从神白白领受恩典的工作，祂按自己的形像，更新我们的全人，使我们愈来愈能向罪死，并向义而活。"},{"num":36,"q":"称义、得儿子的名分与成圣，在今生所带给我们的福乐是什么？","a":"称义、得儿子的名分与成圣，在今生所带给我们的福乐，就是确知神的慈爱、得良心的平安、在圣灵中的喜乐、在恩典上长进，并持守（persevere）在恩典中。"},{"num":37,"q":"信徒离世的时候，从基督得着什么益处？","a":"信徒离世时，灵魂就得以完全圣洁，立刻进入荣耀里；他们的身体则等待与基督联合，所以暂时在坟墓里安然歇息，直等到复活的时候。"},{"num":38,"q":"在复活的时候，信徒又从基督得着什么益处？","a":"在复活的时候，信徒要在荣耀中复活。并在审判的日子，在众人面前被主承认；又被断定无罪，全然蒙福，以神为乐，直到永远。"},{"num":39,"q":"神要人尽什么本分？","a":"神所要人尽的本分，就是顺服祂所启示的旨意。"},{"num":40,"q":"神起初向人启示了什么法则，好使人能以顺服？","a":"神起初向人启示了道德律，作为顺服的法则。"},{"num":41,"q":"神所赐的道德律，可以总括在什么里面？","a":"道德律总括在十诫里面。"},{"num":42,"q":"十诫的总纲是什么？","a":"十诫的总纲就是：要尽心、尽性、尽意、尽力爱主──我们的神，并且爱邻舍如己。"},{"num":43,"q":"十诫的序言说什么？","a":"十诫的序言说：「我是耶和华──你的神，曾将你从埃及地为奴之家领出来。」"},{"num":44,"q":"十诫的序言教导我们什么事？","a":"十诫的序言教导我们：因为耶和华是主、是我们的神，又是我们的救赎主，所以我们应当遵守祂一切的诫命。"},{"num":45,"q":"第一诫是什么？","a":"第一诫是：除了我以外，你不可有别的神（出廿3）。"},{"num":46,"q":"第一诫吩咐我们做什么？","a":"第一诫吩咐我们要认识神，并且承认祂是独一的真神，又是我们的神，因此我们当敬拜、荣耀祂。"},{"num":47,"q":"第一诫禁止我们做什么？","a":"第一诫禁止我们（一） 否认真神，或不将祂当作神、当作我们的神来敬拜、荣耀祂；（二） 禁止我们将那只当归与神的敬拜和荣耀归给其他任何受造之物。"},{"num":48,"q":"第一诫中的「在我面前」，这句话所要教导我们的是什么？","a":"第一诫中的「在我面前」意思是：那鉴察万物的神，祂留心观看世人，并且十分憎恶人敬拜别神的罪。"},{"num":49,"q":"第二诫是什么？","a":"第二诫是：「不可为自己雕刻偶像，也不可做什么形像，彷彿上天、下地和地底下、水中的百物。不可跪拜那些像，也不可事奉它，因为我耶和华──你的神是忌邪的神。恨我的，我必追讨他的罪，自父及子，直到三四代；爱我、守我诫命的，我必向他们发慈爱，直到千代」（出廿4-6）。"},{"num":50,"q":"第二诫吩咐我们做什么？","a":"第二诫吩咐我们要领受、遵从神在圣经中所规定一切有关崇拜的规则，并保守其纯全与完整。"},{"num":51,"q":"第二诫禁止我们做什么？","a":"第二诫禁止我们用任何图像、样式来敬拜神，或用圣经所未规定的任何方式敬拜祂。"},{"num":52,"q":"第二诫告诉我们什么理由，使我们遵守这诫？","a":"我们当守第二诫，因为「我耶和华──你的神是忌邪的神」，所以惟独神在我们身上有主权──我们是祂的子民、祂的产业；并且神切切要我们专心敬拜祂。"},{"num":53,"q":"第三诫是什么？","a":"第三诫是：「不可妄称耶和华──你神的名；因为妄称耶和华名的，耶和华必不以他为无罪」（出廿7）。"},{"num":54,"q":"第三诫吩咐我们做什么？","a":"第三诫吩咐我们当存圣洁、敬畏的心使用神一切的名字、称号、属性、法则、圣经的话，和祂一切的作为、工作。"},{"num":55,"q":"第三诫禁止我们做什么？","a":"第三诫禁止我们亵渎、妄用神借以彰显祂自己的任何事物。"},{"num":56,"q":"第三诫告诉我们什么理由，使我们遵守这诫？","a":"我们当守第三诫，因为这诫告诉我们：凡干犯它的人，虽能逃避人的刑罚，但主我们的神决不容他逃脱神公义的审判。"},{"num":57,"q":"第四诫是什么？","a":"第四诫是：「当记念安息日，守为圣日。六日要劳碌做你一切的工，但第七日是向耶和华──你神当守的安息日。这一日你和你的儿女、仆婢、牲畜和你城里寄居的客旅，无论何工都不可做；因为六日之内，耶和华造天、地、海，和其中的万物，第七日便安息，所以耶和华赐福与安息日，定为圣日」（出廿8-11）。"},{"num":58,"q":"第四诫吩咐我们做什么？","a":"第四诫吩咐我们，要将神在圣经中所规定的时日都向祂守为圣。特别是七日中要有一个整天向祂守为圣安息日。"},{"num":59,"q":"神指定七日的哪一日为安息日？","a":"从世界的起头直到基督复活之前，神是规定七日的第七日为安息日；基督复活之后，神就规定七日的头一日为基督徒的安息日，直到世界的末了。"},{"num":60,"q":"当如何守安息日为圣？","a":"守安息日为圣，当在那一整天中有合乎圣洁的休息，连平日正当的世事和娱乐也不可做；除了必要的和怜悯人的事外，那一天所有的时间都当与众人或个人私下敬拜神。"},{"num":61,"q":"第四诫禁止我们做什么？","a":"第四诫禁止我们推卸或忽略安息日所当尽的本分，也禁止以閒懒妄用这日，或行那本来为罪的事；更禁止我们思想、谈论和从事一切不必要的俗务和娱乐，以免亵渎这日。"},{"num":62,"q":"第四诫附加什么理由要我们守安息日？","a":"我们当守安息日，因为神吩咐我们六日内要劳碌做自己一切的工作；但祂要我们特别尊重第七日，作为祂的日子，祂也给我们作榜样，并赐福与安息日。"},{"num":63,"q":"第五诫是什么？","a":"第五诫是：「当孝敬父母，使你的日子在耶和华──你神所赐你的地上，得以长久」（出廿12）。"},{"num":64,"q":"第五诫吩咐我们做什么？","a":"第五诫吩咐我们无论是对长辈（或位分大的）、晚辈（或位分小的），或平辈（或位分相同的），总要按着彼此的辈分和关系尽本分、表尊崇。"},{"num":65,"q":"第五诫禁止我们做什么？","a":"第五诫禁止我们轻忽或损害各人按其辈分和地位当得的尊崇、当受的服事。"},{"num":66,"q":"第五诫附加什么理由要我们遵守？","a":"我们当守第五诫，因为神应许凡遵守这诫命的，在世可得享长寿与昌盛。"},{"num":67,"q":"第六诫是什么？","a":"第六诫是：「不可杀人」（出廿13）。"},{"num":68,"q":"第六诫吩咐我们做什么？","a":"第六诫吩咐我们要竭尽全力依法保守自己与别人的生命。"},{"num":69,"q":"第六诫禁止我们做什么？","a":"第六诫禁止我们夺去自己的生命，或以不义的手段夺取别人的生命，并一切有这倾向的事。"},{"num":70,"q":"第七诫是什么？","a":"第七诫是：「不可奸淫」（出廿14）。"},{"num":71,"q":"第七诫吩咐我们做什么？","a":"第七诫吩咐我们，无论存心、说话、行事，都要保守自己与别人的贞洁。"},{"num":72,"q":"第七诫禁止我们做什么？","a":"第七诫禁止我们一切不纯洁的意念、言语和行为。"},{"num":73,"q":"第八诫是什么？","a":"第八诫是：「不可偷盗」（出廿15）。"},{"num":74,"q":"第八诫吩咐我们做什么？","a":"第八诫吩咐我们合法地取得并增进自己和别人的财富与产业。"},{"num":75,"q":"第八诫禁止我们做什么？","a":"第八诫禁止我们非法地妨碍自己和别人财富、产业的增进。"},{"num":76,"q":"第九诫是什么？","a":"第九诫是：「不可作假见证陷害人」（出廿16）。"},{"num":77,"q":"第九诫吩咐我们做什么？","a":"第九诫吩咐我们要促进人与人之间的真诚，并要保守自己和邻舍的名声，特别在作见证时，更当如此。"},{"num":78,"q":"第九诫禁止我们做什么？","a":"第九诫禁止我们行一切有损真理的事，或有害自己和邻舍名声的事。"},{"num":79,"q":"第十诫是什么？","a":"第十诫是：「不可贪恋人的房屋；也不可贪恋人的妻子、仆婢、牛驴，并他一切所有的」（出廿17）。"},{"num":80,"q":"第十诫吩咐我们做什么？","a":"第十诫吩咐我们无论处在什么境遇，总要知足，并要对邻舍和他一切所有的，存正直、仁爱之心。"},{"num":81,"q":"第十诫禁止我们做什么？","a":"第十诫禁止我们不以自己所有的为满足，也禁止我们嫉妒别人的福分，而对他所有的起贪恋的私心。"},{"num":82,"q":"人能完全遵守神的诫命吗？","a":"不能；从始祖堕落以来，除了耶稣以外，没有人能在今生将神的诫命守得完全；反倒天天在意念、言语和行为上，触犯神的诫命。"},{"num":83,"q":"所有违背律法的罪都是一样可憎吗？","a":"有一些罪会因其本身性质的缘故，或因人累犯而更形可憎；所以有的罪在神眼中就比别的罪更为可憎。"},{"num":84,"q":"每一项罪当受什么样的刑罚？","a":"每个人每次犯每一项罪，在今世和来世都当受到神的忿怒和咒诅。"},{"num":85,"q":"为使我们能以逃脱因罪所当受之神的忿怒和咒诅，神吩咐我们做什么？","a":"为要逃脱因罪所当受的忿怒和咒诅，神吩咐我们信服耶稣基督──悔改以致得生，并勤用基督所设立的一切外在蒙恩的管道（means of grace），好叫救赎的益处归于我们。"},{"num":86,"q":"「信服耶稣基督」是什么意思？","a":"信服耶稣基督是神所赐的得救恩典；使我们借此可以照着福音的信息与劝勉而接受基督，并惟独靠祂得救。"},{"num":87,"q":"「悔改以致得生」是什么意思？","a":"「悔改以致得生」是神所赐的得救恩典；一个真实觉悟自己有罪，而又确知神在基督里之怜悯的罪人，就会因此为罪忧伤痛悔，恨恶并离弃自己的罪，而归向神，立志竭力重新顺服。"},{"num":88,"q":"基督设立了哪些外在的蒙恩管道，好叫救赎的益处能归于我们？","a":"基督为叫救赎的益处归于我们，所设立那明显而常用的蒙恩管道就是：圣经、圣礼和祈祷；这些方法对选民的得救都是有效力的。"},{"num":89,"q":"圣经如何有得救的效力？","a":"神的灵时常借着诵读、听讲圣经而使罪人醒悟，因而知罪、回转归正，并借着信心在圣洁与安慰上建造他们，以致得救。"},{"num":90,"q":"圣经要怎样读、怎样听，才能有得救的效力？","a":"要使圣经有救人的效力，我们必须以专注、殷勤、预备、祷告的态度，来读、来听圣经的话，用信心和爱心领受并存记在心，更要在日常生活中实行出来。"},{"num":91,"q":"圣礼如何成为得救的有效工具？","a":"圣礼之所以是一种得救的有效方法，并不是因为圣礼本身有能力，也不是因为施行圣礼的人有能力，乃惟独借基督所赐的恩典，和圣灵在那些以信领受的人心中所做的工作。"},{"num":92,"q":"圣礼是什么？","a":"圣礼是基督所设立的仪式，用有形的记号将基督和新约的益处，向信徒表明、印证，并应用在他们心里。"},{"num":93,"q":"新约中的圣礼有几个？","a":"新约的圣礼有两个，就是洗礼和主的晚餐。"},{"num":94,"q":"洗礼是什么？","a":"洗礼是一种圣礼，在洗礼中要奉父、子、圣灵的名用水洗；借此表明且印证我们归入耶稣，可以承受恩典之约的益处，并且许配给耶稣，成为主的人。"},{"num":95,"q":"当为谁施行洗礼？","a":"教会以外的人，必须等他们相信了基督，并承诺顺服基督之后，才可以为他们施洗；但是教会内信徒的婴孩都当接受洗礼。"},{"num":96,"q":"圣餐是什么？","a":"圣餐是一种圣礼。我们在圣餐中照着基督的吩咐分饼喝杯，借此表明主的死。得以领受圣餐的人，不是凭着肉体，乃是凭着信心来领用主的身体和血，并祂一切的益处，以致灵性得着餵养，并在恩典上有所长进。"},{"num":97,"q":"当如何领受圣餐？","a":"为要按理领受圣餐，应当先自己省察：（一）是否分辨是主的身体？（二）是否凭信心吃喝主自己？（三）有没有悔改的心、爱心并重新顺服的心？免得因不按理吃喝，就吃喝自己的罪了。"},{"num":98,"q":"祷告是什么？","a":"祷告是奉基督的名，向神祈求心中所愿而又合乎神旨意的事；并承认自己的罪，也为神诸般的怜悯献上感恩。"},{"num":99,"q":"神赐下什么准则指教我们如何祷告？","a":"整本圣经都在指教我们怎样祷告。但基督教导门徒的主祷文，特别是我们祷告的准则。"},{"num":100,"q":"主祷文的首句教导我们什么？","a":"主祷文的首句：「我们在天上的父」，教导我们存恭敬、信靠的心，坦然无惧地来亲近父神；就如同儿女亲近父亲一样，笃信祂肯帮助、且能帮助我们。并且这句话也教导我们要和他人一同祷告，并要为人代祷。"},{"num":101,"q":"主祷文的第一条所祈求的是什么？","a":"主祷文第一条说：「愿人都尊你的名为圣」，我们在此求神赐力量，使我们和众人在祂显明自己的一切事上，能荣耀祂的名，并求祂为自己的荣耀调度万事。"},{"num":102,"q":"主祷文的第二条所祈求的是什么？","a":"主祷文第二条说：「愿你的国降临」，我们在此求神使撒但的国衰败，而祂恩典的国度则更加兴旺，并使我们自己和众人都得以进入并一直住在其内；又求祂荣耀的国早日降临。"},{"num":103,"q":"主祷文的第三条所祈求的是什么？","a":"主祷文第三条说：「愿你的旨意行在地上，如同行在天上」，我们在此求神赐恩，使我们能在凡事上明白祂的旨意，并甘心乐意地遵从、降服祂的旨意，如同天使在天上所行的一样。"},{"num":104,"q":"主祷文的第四条所祈求的是什么？","a":"主祷文第四条说：「我们日用的饮食，今日赐给我们」，我们在此求神因祂白白的恩典，使我们得着今生所需要的够用而美善的东西，并使我们在使用这些东西时也能同时享受到祂所赐的福乐。"},{"num":105,"q":"主祷文的第五条所祈求的是什么？","a":"主祷文第五条说：「免我们的债，如同我们免了人的债」，我们在这里求神开恩，因基督的缘故白白赦免我们一切的罪；并且我们之所以敢这样求，是因为我们蒙了神的恩典也能从心里去饶恕别人。"},{"num":106,"q":"主祷文的第六条所祈求的是什么？","a":"主祷文第六条说：「不叫我们遇见试探，救我们脱离凶恶」，我们在此求神保守我们不受试探而犯罪，或在受试探时扶助并拯救我们脱离凶恶。"},{"num":107,"q":"主祷文的结语教导我们什么？","a":"主祷文的结语说：「因为国度、权柄、荣耀，全是你的，直到永远，阿们」，这是教导我们：惟独神能应允我们的祷告，并且我们要在祷告中来称颂祂，将国度、权柄、荣耀都归给祂。末了为要证明所求的是诚心所愿，又深信这是必蒙应允的，所以就说：「阿们」。"}]