[
  {
    "id": "youth-033",
    "section": "bible-guide",
    "category": "圣经导读",
    "title_zh": "创世记导读：一切的开始",
    "title_en": "Genesis Guide: Where It All Begins",
    "content_zh": "创世记是圣经的第一卷书，讲述了宇宙、人类和救赎计划的开始。这卷书分为两大部分，每一部分都充满了深刻的属灵真理。\n\n前十一章是「史前史」，描述了人类早期的重大事件。上帝用祂的话语创造了天地万物，一切都是美好的。祂按着自己的形象造人，赋予人类尊贵的身份和管理世界的使命。然而亚当和夏娃选择了悖逆，罪因此进入世界，带来死亡、痛苦和关系的破碎。之后该隐杀弟弟亚伯，人类的罪恶越来越严重，上帝用洪水审判世界，但保存了挪亚一家。巴别塔事件显示人类骄傲地想要取代上帝的位置。这些故事回答了人生最根本的问题：我从哪里来？为什么世界有苦难？人的问题究竟出在哪里？\n\n从第十二章开始进入「列祖历史」。上帝呼召亚伯拉罕离开本地本族，应许他的后裔要成为大国，万国要因他得福。这个应许贯穿整本圣经，最终在耶稣基督身上完全实现。接下来是以撒的故事，展示上帝信实地成就应许。雅各虽然诡诈，上帝仍然恩待他，后来改名为以色列。约瑟被兄弟出卖到埃及，却成为拯救全家的器皿，他说「从前你们的意思是要害我，但上帝的意思原是好的」，这完美展示了上帝的主权如何化咒诅为祝福。\n\n创世记的关键主题包括：上帝的主权创造、人的尊贵与堕落、罪的严重后果、以及恩典应许的开端。这本书为整本圣经奠定了根基，每个故事都指向那位最终的救主耶稣基督——祂要来修复罪所破坏的一切。",
    "content_en": "Genesis is the Bible's first book, telling the story of the universe, humanity, and God's rescue plan from its very beginning. This book divides into two major sections, each filled with profound spiritual truths.\n\nThe first eleven chapters cover 'primeval history,' describing humanity's earliest major events. God created heaven and earth by His word, and everything was good. He made humans in His own image, giving them dignity and the mission to steward the world. Yet Adam and Eve chose rebellion, and sin entered the world, bringing death, suffering, and broken relationships. Cain killed his brother Abel, human wickedness escalated, God judged the world through the flood but preserved Noah's family. The Tower of Babel showed humanity's pride in trying to replace God. These stories answer life's most fundamental questions: Where did I come from? Why does the world have suffering? What is humanity's real problem?\n\nFrom chapter twelve, we enter 'patriarchal history.' God called Abraham to leave his homeland, promising his descendants would become a great nation and all nations would be blessed through him. This promise runs through the entire Bible, ultimately fulfilled in Jesus Christ. Isaac's story shows God faithfully keeping His promises. Though Jacob was deceitful, God still showed him grace, later renaming him Israel. Joseph was sold by his brothers to Egypt yet became the instrument saving his whole family. He said, 'You meant evil against me, but God meant it for good' — perfectly demonstrating God's sovereignty turning curses into blessings.\n\nGenesis's key themes include: God's sovereign creation, human dignity and fall, sin's serious consequences, and the beginning of grace's promise. This book lays the foundation for the entire Bible, with every story pointing to the ultimate Savior Jesus Christ — who would come to restore everything sin had broken.",
    "bible_verses": [
      "Genesis 1:1",
      "Genesis 3:15",
      "Genesis 12:1-3",
      "Genesis 50:20"
    ],
    "discussion_questions": [
      "创世记中哪个人物最让你有共鸣？为什么？Which character in Genesis do you relate to most? Why?",
      "上帝的形象'意味着什么？What does it mean to be made 'in God's image'?",
      "约瑟的故事如何显示上帝的主权？How does Joseph's story show God's sovereignty?"
    ],
    "tags": [
      "genesis",
      "creation",
      "bible-study"
    ]
  },
  {
    "id": "youth-034",
    "section": "bible-guide",
    "category": "圣经导读",
    "title_zh": "出埃及记导读：救赎的故事",
    "title_en": "Exodus Guide: The Redemption Story",
    "content_zh": "出埃及记是一个关于救赎的史诗故事，也是整本圣经中最震撼人心的篇章之一。以色列人在埃及做了四百年奴隶，受尽压迫和苦难。但上帝没有忘记祂与亚伯拉罕的约定，祂听见了百姓的哀求。\n\n上帝兴起摩西作为拯救者。摩西原本是一个逃亡的杀人犯，在旷野牧羊四十年，觉得自己什么也做不了。但上帝在燃烧的荆棘中向他显现，差遣他去面对当时世界上最有权力的人——法老。十灾一个接一个降临，显示上帝胜过法老和埃及所有的假神。每一灾都针对埃及的一位神明，证明只有耶和华才是真神。最后一灾最为关键：灭长子之灾。以色列人要宰杀羔羊，把血涂在门框上，灭命天使看到血就越过那家。这就是逾越节的由来，完美预表了基督在十字架上为我们流血牺牲。\n\n红海分开是旧约中最伟大的神迹之一，显示上帝拯救的大能。以色列人走干地过海，追赶的埃及军队却被海水吞没。在西奈山，上帝颁布律法，包括十诫，建立了与以色列的约。律法的目的不是让人靠行为得救，而是显明上帝的圣洁标准和人的不足。金牛犊事件令人心碎地显示了人心的悖逆，才刚被拯救就转去拜偶像。但上帝仍然怜悯，没有放弃祂的百姓。会幕的建造说明上帝渴望住在祂子民中间，与他们同在。\n\n这整个故事就是我们属灵经历的缩影：我们都曾是罪的奴隶，上帝通过耶稣这位真正的逾越节羔羊拯救我们，给我们新的生命法则，并且应许永远与我们同在。从黑暗进入光明，从奴役得到自由——这是每个基督徒的故事。",
    "content_en": "Exodus is an epic story about redemption and one of the most powerful passages in all of Scripture. The Israelites were slaves in Egypt for four hundred years, enduring oppression and suffering. But God did not forget His covenant with Abraham — He heard His people's cries.\n\nGod raised up Moses as deliverer. Moses was originally a fugitive murderer who spent forty years shepherding in the wilderness, feeling he could do nothing. But God appeared to him in a burning bush and sent him to face the most powerful man in the world — Pharaoh. The ten plagues fell one by one, showing God's victory over Pharaoh and all Egypt's false gods. Each plague targeted a specific Egyptian deity, proving only the LORD is the true God. The final plague was most critical: the death of the firstborn. Israel had to slaughter a lamb and put its blood on the doorframe; the angel of death would pass over that house. This is the origin of Passover, perfectly foreshadowing Christ's blood sacrifice on the cross.\n\nThe Red Sea parting is one of the Old Testament's greatest miracles, displaying God's mighty deliverance. Israel walked through on dry ground while the pursuing Egyptian army was swallowed by the waters. At Mount Sinai, God gave the law including the Ten Commandments, establishing a covenant with Israel. The law's purpose wasn't salvation by works but revealing God's holy standard and human inadequacy. The golden calf incident heartbreakingly shows human rebellion — just rescued yet already turning to idols. But God remained merciful, not abandoning His people. Building the tabernacle shows God's desire to dwell among His people.\n\nThis entire story is a picture of our spiritual experience: we were all slaves to sin, God rescued us through Jesus the true Passover Lamb, gave us new life principles, and promises to be with us forever. From darkness to light, from slavery to freedom — this is every Christian's story.",
    "bible_verses": [
      "Exodus 12:13",
      "Exodus 14:13-14",
      "Exodus 20:1-17",
      "Exodus 25:8"
    ],
    "discussion_questions": [
      "出埃及的故事如何反映你自己的救赎经历？How does the Exodus story reflect your own redemption experience?",
      "为什么上帝要用这么多神迹拯救以色列人？Why did God use so many miracles to rescue Israel?",
      "律法的目的是什么？不只是规则吗？What's the purpose of the law? Isn't it just rules?"
    ],
    "tags": [
      "exodus",
      "redemption",
      "moses"
    ]
  },
  {
    "id": "youth-035",
    "section": "bible-guide",
    "category": "圣经导读",
    "title_zh": "诗篇导读：心灵的歌声",
    "title_en": "Psalms Guide: Songs of the Soul",
    "content_zh": "诗篇是圣经中的歌本和祷告册，收录了一百五十篇诗歌，表达了人类各种各样的情感：喜乐、感恩、恐惧、愤怒、困惑、盼望、悲伤、赞美。大卫写了其中很多篇，但也有摩西、亚萨、可拉后裔等其他作者，跨越了好几百年的历史。\n\n这些诗歌不是「属灵正确」的表面文字，而是真实、原始、毫不掩饰的情感表达。你会看到诗人对敌人极其愤怒，向上帝发出质问和困惑，在深深的绝望中痛哭，也在得胜中高声歌唱。诗篇第二十二篇以「我的上帝，我的上帝，为什么离弃我」开始，这正是耶稣在十字架上的呼喊。诗篇第二十三篇「耶和华是我的牧者」带来无尽的安慰。诗篇第五十一篇是大卫犯罪后真诚的悔改祷告。诗篇第一三九篇描绘上帝对我们无微不至的认识和关怀。\n\n关键信息是：你可以把任何情感带到上帝面前！祂不怕你的愤怒、疑惑或眼泪。很多人以为祷告必须用正式虔诚的语言，但诗篇告诉我们，最真实的祷告才是最好的祷告。上帝宁愿听到你真实的呐喊，也不要听虚伪的赞美。\n\n诗篇大致可以分为几种类型：赞美诗、哀歌、感恩诗、智慧诗、皇室诗。其中很多篇也预言了弥赛亚的到来，耶稣在世时经常引用诗篇。读诗篇时，试着找找自己的情感共鸣。当你开心时读赞美诗篇，当你痛苦时读哀歌诗篇，然后学习诗人如何在各种处境中转向上帝。诗篇教导我们如何诚实地祷告，如何在困难中依然信靠上帝，如何用整个生命来赞美敬拜祂。让诗篇成为你每天亲近上帝的好伙伴吧。",
    "content_en": "Psalms is the Bible's songbook and prayer book, containing one hundred and fifty songs expressing every kind of human emotion: joy, gratitude, fear, anger, confusion, hope, grief, and praise. David wrote many of them, but there were also other authors including Moses, Asaph, and the sons of Korah, spanning several hundred years of history.\n\nThese songs aren't 'spiritually correct' surface words but real, raw, unfiltered emotional expressions. You'll see psalmists furious at enemies, questioning God in confusion, weeping in deep despair, and singing loudly in victory. Psalm 22 begins with 'My God, my God, why have you forsaken me' — the very words Jesus cried on the cross. Psalm 23, 'The LORD is my shepherd,' brings endless comfort. Psalm 51 is David's sincere prayer of repentance after sin. Psalm 139 depicts God's intimate knowledge and care for us.\n\nThe key message is: you can bring any emotion before God! He's not afraid of your anger, doubts, or tears. Many think prayer must use formal pious language, but Psalms tells us the most authentic prayer is the best prayer. God would rather hear your genuine cry than insincere praise.\n\nPsalms can be roughly categorized into several types: hymns of praise, laments, thanksgiving psalms, wisdom psalms, and royal psalms. Many also prophesy the Messiah's coming — Jesus frequently quoted Psalms during His earthly ministry. When reading Psalms, try to find your emotional connection. Read praise psalms when happy, lament psalms when hurting, then learn how the psalmist turned to God in every circumstance. Psalms teach us how to pray honestly, trust God through difficulties, and worship Him with our whole lives. Let Psalms become your daily companion in drawing near to God.",
    "bible_verses": [
      "Psalm 23",
      "Psalm 51:10",
      "Psalm 139:23-24",
      "Psalm 1:1-3"
    ],
    "discussion_questions": [
      "你最喜欢哪一篇诗篇？为什么？What's your favorite psalm? Why?",
      "诗篇如何帮助你更诚实地祷告？How do psalms help you pray more honestly?",
      "困难时期哪些诗篇最能安慰你？Which psalms comfort you most during difficult times?"
    ],
    "tags": [
      "psalms",
      "prayer",
      "worship"
    ]
  },
  {
    "id": "youth-036",
    "section": "bible-guide",
    "category": "圣经导读",
    "title_zh": "箴言导读：生活的智慧",
    "title_en": "Proverbs Guide: Wisdom for Living",
    "content_zh": "箴言是一本极其实用的生活手册，充满了智慧的短句和生活原则。主要作者是所罗门王，他向上帝求智慧而成为历史上最有智慧的君王。这不是一本承诺书——不是说「如果你这样做，一定会发生那样的结果」，而是告诉你一般性的原则：在通常情况下什么是明智的选择。\n\n全书的核心主题是「敬畏耶和华是智慧的开端」。真正的智慧不是从课本或经验开始，而是从认识上帝、敬畏上帝开始。一个敬畏上帝的人，即使知识有限，也比一个聪明却不认识上帝的人活得更有智慧。\n\n箴言涵盖了生活的方方面面，对青少年特别有帮助：金钱管理（不要做债务的奴隶）、朋友关系（近朱者赤近墨者黑）、工作态度（懒惰人总有借口）、言语的力量（舌头能造就人也能毁灭人）、纯洁的生活（远离不道德的诱惑）、对待酒精的态度、骄傲与谦卑的对比等等。书中特别警告几种人：愚昧人（听到智慧却拒绝接受）、懒惰人（总是拖延推卸）、骄傲人（觉得自己不需要帮助）、好争吵的人（到处制造矛盾）。相反，箴言赞扬勤劳的人、谦卑受教的人、诚实正直的人、慷慨施与的人。\n\n这本书对青少年特别有价值，因为你们正处在需要做很多重要人生决定的阶段。读箴言最好的方法是每天读一章，全书三十一章刚好对应一个月。慢慢消化其中的智慧，让它渗透到你的日常选择中。记住，知识是知道事实，智慧是知道如何运用事实来过好生活。箴言帮助你在上帝的智慧中做出明智的选择。",
    "content_en": "Proverbs is an extremely practical life manual, packed with wise sayings and life principles. The main author is King Solomon, who asked God for wisdom and became history's wisest ruler. This isn't a promise book — not saying 'if you do this, that will definitely happen' — but rather general principles: what's usually the wise choice under normal circumstances.\n\nThe book's core theme is 'the fear of the LORD is the beginning of wisdom.' True wisdom doesn't start with textbooks or experience but with knowing and fearing God. A person who fears God, even with limited knowledge, lives more wisely than someone clever but ignorant of God.\n\nProverbs covers every area of life and is especially helpful for teenagers: money management (don't become debt's slave), friendships (you become like those you hang around), work ethic (the lazy always have excuses), power of words (the tongue can build up or destroy), pure living (flee immoral temptation), attitudes toward alcohol, contrast between pride and humility, and more. The book especially warns against several types: fools (who hear wisdom but refuse it), the lazy (always procrastinating and passing blame), the proud (who think they need no help), and the quarrelsome (who create conflict everywhere). Conversely, Proverbs praises the diligent, the humbly teachable, the honest and upright, and the generous.\n\nThis book is particularly valuable for teenagers because you're at a stage requiring many important life decisions. The best way to read Proverbs is one chapter daily — thirty-one chapters perfectly match one month. Slowly digest the wisdom within, letting it permeate your daily choices. Remember, knowledge is knowing facts; wisdom is knowing how to apply facts to live well. Proverbs helps you make wise choices rooted in God's wisdom.",
    "bible_verses": [
      "Proverbs 1:7",
      "Proverbs 3:5-6",
      "Proverbs 27:17",
      "Proverbs 31:10"
    ],
    "discussion_questions": [
      "箴言中哪句话最挑战你？Which verse in Proverbs challenges you most?",
      "青少年最需要箴言中的哪种智慧？What wisdom from Proverbs do teenagers need most?",
      "你如何区分'一般原则'和'绝对承诺'？How do you distinguish between 'general principles' and 'absolute promises'?"
    ],
    "tags": [
      "proverbs",
      "wisdom",
      "practical-living"
    ]
  },
  {
    "id": "youth-037",
    "section": "bible-guide",
    "category": "圣经导读",
    "title_zh": "马太福音导读：王的福音",
    "title_en": "Matthew Guide: The Gospel of the King",
    "content_zh": "马太福音是新约的第一卷书，主要写给犹太人读者，要证明耶稣就是旧约所应许、他们世世代代等候的弥赛亚君王。马太是耶稣十二门徒之一，原本是被人鄙视的税吏，蒙耶稣呼召后成为忠心的跟随者。\n\n全书从耶稣的家谱开始，清楚显示祂是亚伯拉罕的后裔、大卫的子孙，完全符合旧约关于弥赛亚的预言。博士从远方来朝拜婴孩耶稣，预示祂不仅是犹太人的王，更是万国万民的王。\n\n登山宝训是马太福音最著名的段落之一，记录在第五到第七章。耶稣在这里展示了天国的伦理标准：八福教导什么样的人是真正有福的（不是世界所说的成功人士，而是虚心的、哀恸的、温柔的、渴慕公义的人）；主祷文教导我们如何亲近天父；金律「你们愿意人怎样待你们，你们也要怎样待人」成为人际关系的最高原则。这些教导今天读起来仍然震撼人心、挑战我们的生活方式。\n\n马太特别强调耶稣的教导，记录了大量比喻。第十三章的天国比喻用生活化的故事解释上帝的国度如何运作。耶稣行了许多神迹——医病、赶鬼、平静风浪、喂饱五千人——证明祂拥有上帝的权柄。然而宗教领袖却因为嫉妒和骄傲拒绝接受祂，最终把祂钉在十字架上。但这位王的死不是失败，而是救赎计划的高峰。第三天祂从死里复活，证明祂真是上帝的儿子，掌管生命和死亡。\n\n全书以大使命作为结尾：「天上地下所有的权柄都赐给我了。所以你们要去使万民作我的门徒。」耶稣不只是一个好老师或道德楷模，祂是宇宙的王，配得我们全心的顺服和敬拜。今天祂仍然在呼召我们跟随祂、效法祂、为祂而活。",
    "content_en": "Matthew is the New Testament's first book, primarily written for Jewish readers to prove that Jesus is the promised Messiah King they had awaited for generations. Matthew was one of Jesus' twelve disciples, originally a despised tax collector who became a faithful follower after Jesus' calling.\n\nThe book begins with Jesus' genealogy, clearly showing He is Abraham's descendant and David's son, perfectly fulfilling Old Testament Messianic prophecies. Wise men traveled far to worship baby Jesus, foreshadowing that He is not only King of the Jews but King of all nations.\n\nThe Sermon on the Mount is one of Matthew's most famous passages, recorded in chapters five through seven. Here Jesus reveals kingdom ethics: the Beatitudes teach who is truly blessed (not the world's 'successful' people but the poor in spirit, mourning, meek, and those hungering for righteousness); the Lord's Prayer teaches how to draw near to the Father; the Golden Rule 'do to others what you would have them do to you' becomes the highest principle for relationships. These teachings still shock and challenge our lifestyles today.\n\nMatthew especially emphasizes Jesus' teaching, recording many parables. Chapter thirteen's kingdom parables use everyday stories to explain how God's kingdom operates. Jesus performed many miracles — healing, casting out demons, calming storms, feeding five thousand — proving His divine authority. Yet religious leaders rejected Him out of jealousy and pride, ultimately crucifying Him. But this King's death wasn't defeat — it was redemption's climax. On the third day He rose from the dead, proving He truly is God's Son, sovereign over life and death.\n\nThe book concludes with the Great Commission: 'All authority in heaven and on earth has been given to me. Therefore go and make disciples of all nations.' Jesus isn't just a good teacher or moral example — He is the universe's King, deserving our wholehearted obedience and worship. Today He still calls us to follow Him, imitate Him, and live for Him.",
    "bible_verses": [
      "Matthew 1:1",
      "Matthew 5:3-12",
      "Matthew 16:16",
      "Matthew 28:18-20"
    ],
    "discussion_questions": [
      "耶稣作为王对你的日常生活意味着什么？What does Jesus as King mean for your daily life?",
      "登山宝训中哪个教导最挑战你？Which teaching in the Sermon on the Mount challenges you most?",
      "你如何向朋友解释耶稣是王？How would you explain to friends that Jesus is King?"
    ],
    "tags": [
      "matthew",
      "jesus-king",
      "gospel"
    ]
  },
  {
    "id": "youth-038",
    "section": "bible-guide",
    "category": "圣经导读",
    "title_zh": "罗马书导读：救恩的逻辑",
    "title_en": "Romans Guide: The Logic of Salvation",
    "content_zh": "罗马书是使徒保罗写给罗马教会的书信，被称为「信仰的导航系统」，因为它系统而清晰地解释了基督教的核心真理。如果你想要真正理解福音的全貌，罗马书是必读之书。\n\n前三章描述了人类的共同困境：所有人——无论犹太人还是外邦人，无论道德高尚还是作恶多端——都犯了罪，亏缺了上帝的荣耀。没有一个人能靠自己的行为、努力或善良在上帝面前站立得住。这个诊断虽然严厉，却是诚实的。只有先承认病情，才能接受治疗。\n\n第四章用亚伯拉罕做例子，说明因信称义不是新发明，而是上帝从起初就定下的救恩方式。亚伯拉罕不是因为行为完美被上帝接纳，而是因为他相信上帝的应许。第五章做了一个震撼人心的对比：亚当的悖逆带来罪和死亡临到全人类，但基督的顺服带来恩典和生命临到一切相信的人。恩典的力量远超过罪的破坏力。\n\n第六到八章解释信主之后的新生活。我们已经向罪死了，要靠着圣灵活出新的生命。虽然内心仍有挣扎（保罗诚实地承认这一点），但圣灵住在我们里面赐给我们力量。第八章是全书的高峰，宣告「如今那些在基督耶稣里的就不定罪了」，并且没有任何事物能使我们与上帝的爱隔绝。\n\n第九到十一章讨论以色列在上帝计划中的地位，显明上帝的信实和主权。最后几章转向实际的基督徒生活：如何彼此相爱、如何对待政府、如何处理良心问题。核心信息是因信称义——我们不是因为好行为被上帝接纳，而是单单因为相信耶稣基督。这恩典是白白赐给我们的礼物，但它必然改变我们的生命，使我们渴望顺服上帝。罗马书回答了人类最深刻的问题：罪人如何能与圣洁的上帝建立和好的关系？",
    "content_en": "Romans is the Apostle Paul's letter to the Roman church, called 'faith's navigation system' because it systematically and clearly explains Christianity's core truths. If you want to truly understand the Gospel's full picture, Romans is essential reading.\n\nThe first three chapters describe humanity's shared predicament: all people — whether Jewish or Gentile, morally upstanding or openly wicked — have sinned and fall short of God's glory. No one can stand before God through their own works, effort, or goodness. Though this diagnosis is severe, it's honest. Only by first acknowledging the illness can we accept the cure.\n\nChapter four uses Abraham as an example, showing that justification by faith isn't a new invention but God's salvation method from the beginning. Abraham wasn't accepted by God for perfect behavior but because he believed God's promise. Chapter five makes a stunning comparison: Adam's disobedience brought sin and death to all humanity, but Christ's obedience brought grace and life to all who believe. Grace's power far exceeds sin's destructive force.\n\nChapters six through eight explain the new life after believing. We have died to sin and must live new lives through the Spirit. Though inner struggle remains (Paul honestly acknowledges this), the Holy Spirit dwelling in us gives us power. Chapter eight is the book's peak, declaring 'there is now no condemnation for those in Christ Jesus,' and that nothing can separate us from God's love.\n\nChapters nine through eleven discuss Israel's place in God's plan, revealing God's faithfulness and sovereignty. The final chapters turn to practical Christian living: how to love one another, relate to government, handle conscience issues. The core message is justification by faith — we're not accepted by God because of good works but solely through believing in Jesus Christ. This grace is a free gift, but it inevitably transforms our lives, making us desire to obey God. Romans answers humanity's deepest question: how can sinners establish a reconciled relationship with a holy God?",
    "bible_verses": [
      "Romans 1:16-17",
      "Romans 3:23",
      "Romans 6:23",
      "Romans 8:1"
    ],
    "discussion_questions": [
      "因信称义如何改变你看自己的方式？How does justification by faith change how you see yourself?",
      "为什么保罗花这么多时间论证人人都有罪？Why does Paul spend so much time proving everyone has sinned?",
      "第8章'不被定罪'对你意味着什么？What does 'no condemnation' in chapter 8 mean to you?"
    ],
    "tags": [
      "romans",
      "salvation",
      "justification"
    ]
  },
  {
    "id": "youth-039",
    "section": "bible-guide",
    "category": "圣经导读",
    "title_zh": "约翰福音导读：相信耶稣",
    "title_en": "John's Gospel: Believe in Jesus",
    "content_zh": "约翰福音与马太、马可、路加三卷福音书有很大不同。如果说其他福音书像新闻报道，约翰福音更像是一个法庭辩论，要从多个角度证明一个核心命题：耶稣是上帝的儿子，是道成肉身的上帝。\n\n约翰福音的开篇就气势非凡：「太初有道，道与上帝同在，道就是上帝。」直接宣告耶稣的永恒神性。接着说「道成了肉身，住在我们中间」，无限的上帝竟然成为有限的人，这是何等不可思议的奥秘和恩典。\n\n约翰精心选择了七个神迹（他称之为「记号」而不是「奇事」，因为每个神迹都是指向更深真理的标志）来证明耶稣的身份：变水为酒、医治大臣的儿子、医好瘫子、喂饱五千人、在海面上行走、医好生来瞎眼的人、使拉撒路从死里复活。每一个神迹都在说：耶稣拥有创造主的权柄。\n\n同样震撼的是七个「我是」宣告：「我是生命的粮」——祂满足我们最深的饥渴；「我是世界的光」——祂照亮黑暗中的道路；「我是羊的门」——祂是通往上帝的唯一入口；「我是好牧人」——祂为羊舍命；「我是复活和生命」——祂掌管死亡；「我是道路、真理、生命」——祂是认识上帝的唯一途径；「我是真葡萄树」——我们的生命力来自与祂的连结。每一个「我是」都在宣告祂的神圣身份。\n\n约翰福音中有许多精彩的个人故事：第三章尼哥底母夜访耶稣，学到人必须重生；第四章耶稣与撒玛利亚妇人谈话，打破种族和性别的壁垒；第九章生来瞎眼的人得医治，引发关于属灵盲目的深刻讨论。这些都显示人需要属灵的重生和眼光。\n\n约翰特别强调「相信」这个词，在全书中出现了九十八次。全书的目的非常清楚：「记这些事要叫你们信耶稣是基督，是上帝的儿子，并且叫你们信了祂，就可以因祂的名得生命。」这既是一卷传福音的书，也是一卷坚固信心的书。无论你是初次认识耶稣，还是已经跟随祂多年，约翰福音都会加深你对祂的认识和爱。",
    "content_en": "John's Gospel differs significantly from Matthew, Mark, and Luke. If the other Gospels read like news reports, John's reads more like a courtroom argument, proving from multiple angles one core proposition: Jesus is the Son of God, God incarnate.\n\nJohn's opening is magnificent: 'In the beginning was the Word, and the Word was with God, and the Word was God.' This directly declares Jesus' eternal deity. Then, 'The Word became flesh and dwelt among us' — the infinite God becoming finite man, what an incredible mystery and grace.\n\nJohn carefully selected seven miracles (he calls them 'signs' rather than 'wonders,' because each miracle points to deeper truth) to prove Jesus' identity: turning water to wine, healing the official's son, healing the paralytic, feeding five thousand, walking on water, healing the man born blind, raising Lazarus from the dead. Every miracle declares: Jesus possesses the Creator's authority.\n\nEqually stunning are seven 'I am' statements: 'I am the bread of life' — He satisfies our deepest hunger; 'I am the light of the world' — He illuminates paths through darkness; 'I am the gate for the sheep' — He's the only entrance to God; 'I am the good shepherd' — He lays down His life for the sheep; 'I am the resurrection and the life' — He has authority over death; 'I am the way, the truth, and the life' — He's the only path to knowing God; 'I am the true vine' — our vitality comes from connection with Him. Each 'I am' declares His divine identity.\n\nJohn's Gospel contains many brilliant personal stories: chapter three's Nicodemus visits Jesus at night, learning one must be born again; chapter four's Jesus talks with the Samaritan woman, breaking racial and gender barriers; chapter nine's man born blind is healed, sparking profound discussion about spiritual blindness. These all show humanity's need for spiritual rebirth and sight.\n\nJohn especially emphasizes 'believe' — the word appears ninety-eight times throughout the book. The purpose is crystal clear: 'These are written that you may believe that Jesus is the Messiah, the Son of God, and that by believing you may have life in his name.' This is both an evangelistic book and a faith-strengthening book. Whether you're encountering Jesus for the first time or have followed Him for years, John's Gospel will deepen your knowledge and love of Him.",
    "bible_verses": [
      "John 1:1",
      "John 3:16",
      "John 14:6",
      "John 20:30-31"
    ],
    "discussion_questions": [
      "七个'我是'宣告中哪个最触动你？Which of the seven 'I am' statements touches you most?",
      "约翰为什么这么强调'相信'？Why does John emphasize 'believe' so much?",
      "如何向朋友解释耶稣的神性？How would you explain Jesus' deity to friends?"
    ],
    "tags": [
      "john",
      "deity-of-christ",
      "believe"
    ]
  },
  {
    "id": "youth-040",
    "section": "bible-guide",
    "category": "圣经导读",
    "title_zh": "使徒行传导读：教会的诞生",
    "title_en": "Acts Guide: The Church Is Born",
    "content_zh": "使徒行传是教会历史的开篇，由路加医生撰写，记录了从耶稣升天到使徒保罗在罗马传道大约三十年的历史。这卷书是路加福音的续集，讲述复活的耶稣升天之后，圣灵如何带领门徒把福音从耶路撒冷传到地极。\n\n五旬节是整卷书的起点。圣灵像火焰一样降临在门徒身上，赐给他们超自然的能力和勇气。原本因恐惧躲藏的渔夫彼得，站起来大胆讲道，三千人悔改信主，教会就此诞生了。初期教会的生活令人向往：信徒恒心遵守使徒的教训，彼此交接，一起擘饼，一同祷告。他们甚至变卖家产分给有需要的人。这不是被迫的共产主义，而是圣灵充满后自发的爱心和慷慨。\n\n但教会很快就面临了逼迫。司提反成为第一个殉道者，他在被石头打死前看见天开了，耶稣站在上帝的右边。年轻的扫罗参与了对教会的迫害，到处搜捕基督徒。但上帝的计划远超人的恶行：逼迫反而让信徒四散，福音因此传到更远的地方。而那个迫害者扫罗，在大马士革的路上遇见复活的耶稣，生命彻底翻转，成为保罗——教会历史上最伟大的宣教士。\n\n保罗的三次宣教旅程是使徒行传后半部分的重点。他走遍地中海沿岸，在各地建立教会，向犹太人和外邦人传福音。他遭遇了监禁、鞭打、沉船、饥饿，但从不退缩。福音从耶路撒冷一路传到了罗马帝国的中心。\n\n使徒行传的关键主题包括：圣灵的大能、勇敢的见证、教会的增长、福音的普世性、以及上帝主权的引导。这本书让我们看到初期基督徒如何生活、如何面对逼迫、如何传福音。今天的教会同样需要圣灵的充满和传福音的火热心志。使徒行传的故事还没有结束——我们就是这故事的延续。",
    "content_en": "Acts is the opening chapter of church history, written by Luke the physician, recording about thirty years from Jesus' ascension to the Apostle Paul's ministry in Rome. This book is Luke's Gospel sequel, telling how after the risen Jesus ascended, the Holy Spirit led disciples to spread the Gospel from Jerusalem to the ends of the earth.\n\nPentecost is the book's starting point. The Holy Spirit descended on the disciples like fire, granting supernatural power and courage. Peter, the fisherman who had been hiding in fear, stood up to preach boldly. Three thousand repented and believed, and the church was born. Early church life was enviable: believers devoted themselves to the apostles' teaching, fellowship, breaking bread, and prayer. They even sold possessions to share with those in need — not forced communism but spontaneous love and generosity from being Spirit-filled.\n\nBut the church quickly faced persecution. Stephen became the first martyr, seeing heaven open and Jesus standing at God's right hand before being stoned to death. Young Saul participated in persecuting the church, hunting Christians everywhere. But God's plan far exceeded human evil: persecution actually scattered believers, spreading the Gospel further. And that persecutor Saul, encountering the risen Jesus on the Damascus road, was completely transformed into Paul — church history's greatest missionary.\n\nPaul's three missionary journeys are the focus of Acts' second half. He traveled throughout the Mediterranean coast, establishing churches everywhere, preaching to Jews and Gentiles alike. He endured imprisonment, flogging, shipwreck, and hunger, yet never retreated. The Gospel spread from Jerusalem all the way to the Roman Empire's center.\n\nActs' key themes include: the Holy Spirit's power, bold witness, church growth, the Gospel's universality, and God's sovereign guidance. This book shows us how early Christians lived, faced persecution, and evangelized. Today's church equally needs the Spirit's filling and passionate evangelistic zeal. The story of Acts hasn't ended — we are its continuation.",
    "bible_verses": [
      "Acts 1:8",
      "Acts 2:42",
      "Acts 4:12",
      "Acts 16:31"
    ],
    "discussion_questions": [
      "初期教会的哪个特点最吸引你？What early church characteristic attracts you most?",
      "为什么逼迫反而帮助福音传播？Why did persecution actually help Gospel spread?",
      "今天我们如何像使徒那样勇敢见证？How can we witness boldly like the apostles today?"
    ],
    "tags": [
      "acts",
      "church-history",
      "holy-spirit"
    ]
  },
  {
    "id": "youth-041",
    "section": "bible-guide",
    "category": "圣经导读",
    "title_zh": "哥林多前书导读：教会问题解答",
    "title_en": "1 Corinthians Guide: Church Problems Solved",
    "content_zh": "哥林多教会是一个问题多多的教会：分党结派、道德败坏、混乱的敬拜、对复活的怀疑等等。哥林多城本身就是一个充满诱惑的商业大都市，信徒虽然信了耶稣，但旧有的文化习惯和思维方式仍然深深影响着他们。保罗写这封信，逐一解决这些棘手的问题，给我们留下了处理教会冲突的宝贵范例。\n\n第一章直击分党问题。信徒们说「我属保罗」「我属亚波罗」，把人的教师当偶像。保罗提醒他们：十字架的信息才是核心，基督没有被分开。第六章论身体的圣洁，提醒信徒的身体是圣灵的殿，不可放纵情欲。第八章讨论一个微妙的话题：基督徒有自由吃祭过偶像的食物，但如果你的自由绊倒了信心软弱的弟兄姐妹，爱心就比自由更重要。\n\n第十一章论敬拜的秩序，第十二到十四章详细讨论属灵恩赐。保罗用身体的比喻说明教会的合一与多元：眼睛不能对手说「我不需要你」，每个肢体都重要。恩赐不是用来炫耀的，而是用来建造教会的。而在所有恩赐之上，最重要的是爱。\n\n第十三章就是举世闻名的「爱的篇章」：爱是恒久忍耐又有恩慈，爱是不嫉妒不自夸不张狂，不做害羞的事，不求自己的益处，不轻易发怒，不计算人的恶。这段经文常在婚礼上被朗读，但保罗写它的原始背景是教会冲突——他在说，没有爱的恩赐毫无价值。\n\n第十五章详细论证复活的真实性和重要性。如果基督没有复活，我们的信仰就是空的。但基督确实复活了，我们也必复活。这是基督教信仰的根基。\n\n保罗处理问题的方法值得学习：他总是回到福音的根基，用爱心说诚实话，不回避问题但始终指向基督。这本书教导我们一个重要真理：教会不是完美的人聚集的地方，而是不完美的人一起学习跟随基督的地方。关键是谦卑、爱心，以及始终以基督为中心。",
    "content_en": "The Corinthian church was a problem-riddled congregation: divisions, moral corruption, chaotic worship, doubts about resurrection, and more. Corinth itself was a temptation-filled commercial metropolis; though believers had come to faith in Jesus, old cultural habits and mindsets still deeply influenced them. Paul wrote this letter addressing each thorny issue, leaving us valuable examples for handling church conflicts.\n\nChapter one strikes at divisions. Believers were saying 'I follow Paul,' 'I follow Apollos,' making idols of human teachers. Paul reminds them: the cross's message is central, Christ is not divided. Chapter six addresses bodily holiness, reminding believers their bodies are the Holy Spirit's temple — don't indulge in immorality. Chapter eight discusses a nuanced topic: Christians have freedom to eat idol-sacrificed food, but if your freedom causes a weaker brother or sister to stumble, love trumps freedom.\n\nChapter eleven covers worship order, chapters twelve through fourteen discuss spiritual gifts in detail. Paul uses the body metaphor to illustrate church unity and diversity: the eye cannot say to the hand 'I don't need you' — every member matters. Gifts aren't for showing off but for building up the church. And above all gifts, love is most important.\n\nChapter thirteen is the world-famous 'love chapter': love is patient and kind, love does not envy or boast, is not arrogant or rude, does not insist on its own way, is not irritable, keeps no record of wrongs. This passage is often read at weddings, but Paul's original context was church conflict — he's saying gifts without love are worthless.\n\nChapter fifteen thoroughly argues resurrection's reality and importance. If Christ has not been raised, our faith is empty. But Christ has indeed risen, and we too shall rise. This is Christian faith's foundation.\n\nPaul's method of handling problems is worth learning: he always returns to Gospel foundations, speaks truth in love, never avoids issues but always points to Christ. This book teaches an important truth: church isn't where perfect people gather, but where imperfect people learn together to follow Christ. The keys are humility, love, and keeping Christ always at the center.",
    "bible_verses": [
      "1 Corinthians 1:10",
      "1 Corinthians 6:19-20",
      "1 Corinthians 13:1-3",
      "1 Corinthians 15:3-4"
    ],
    "discussion_questions": [
      "哥林多教会的哪个问题在今天的教会也存在？Which Corinthian church problem exists in churches today?",
      "第13章的爱如何解决教会冲突？How does chapter 13's love solve church conflicts?",
      "属灵恩赐的目的是什么？What's the purpose of spiritual gifts?"
    ],
    "tags": [
      "1-corinthians",
      "church-problems",
      "love"
    ]
  },
  {
    "id": "youth-042",
    "section": "bible-guide",
    "category": "圣经导读",
    "title_zh": "以弗所书导读：在基督里的丰盛",
    "title_en": "Ephesians Guide: Riches in Christ",
    "content_zh": "以弗所书是保罗在罗马监狱里写的，虽然身体被囚禁，但他的灵却飞到了属灵真理的最高处。这封书信被称为「基督徒信仰的最高峰」，因为它把我们在基督里所拥有的属灵祝福描绘得如此丰富、壮丽。\n\n前三章讲的是我们在基督里已经拥有的属灵身份和祝福。第一章是一首壮丽的三位一体颂赞：圣父在创世之前就拣选了我们，圣子用宝血救赎了我们，圣灵印证我们是属上帝的人。想想看，在宇宙被创造之前，上帝就已经爱你、拣选你了！这不是因为你多好，完全是因为祂的恩典。\n\n第二章描述了一个戏剧性的转变：我们原本死在过犯罪恶之中，随从世界的潮流和自己的私欲。但上帝因着丰富的怜悯和大爱，使我们与基督一同复活。「你们得救是本乎恩，也因着信。这并不是出于自己，乃是上帝所赐的；也不是出于行为，免得有人自夸。」这是整本圣经最清晰的恩典宣言之一。我们从前是远离上帝的外邦人，如今却成了上帝家里的人。\n\n第三章保罗跪下来为教会祷告，求上帝开启心灵的眼睛，让信徒能够明白基督的爱是何等长阔高深。\n\n后三章从身份转向生活实践。第四章呼吁教会合一，各人用不同的恩赐彼此服侍，一同成长。第四到五章描绘新人应有的生活样式：脱去旧人的行为（谎言、愤怒、偷窃、污秽的话），穿上新人的品格（真实、良善、彼此饶恕）。第五章论家庭关系中的爱与顺服。\n\n第六章的全副军装是最广为人知的段落之一。保罗提醒我们，基督徒的争战不是对抗血肉之体，而是对抗属灵的黑暗权势。我们需要穿戴真理的腰带、公义的护心镜、和平福音的鞋、信德的盾牌、救恩的头盔、圣灵的宝剑（就是上帝的道），加上不住的祷告。\n\n整本书的主题词是「在基督里」，出现了一百六十多次。我们的身份、能力、盼望、力量全都在基督里。这不是停留在头脑里的神学理论，而是需要活出来的属灵现实：谦卑地彼此相爱，过圣洁的生活，勇敢面对属灵的争战。",
    "content_en": "Ephesians was written by Paul from a Roman prison — though physically confined, his spirit soared to the highest realms of spiritual truth. This letter is called 'the summit of Christian faith' because it portrays our spiritual blessings in Christ with such richness and grandeur.\n\nThe first three chapters describe our spiritual identity and blessings already possessed in Christ. Chapter one is a magnificent Trinitarian doxology: the Father chose us before creation, the Son redeemed us with His precious blood, the Spirit sealed us as belonging to God. Consider this: before the universe was created, God already loved and chose you! Not because of your merit, entirely because of His grace.\n\nChapter two describes a dramatic transformation: we were dead in transgressions and sins, following the world's currents and our own desires. But God, rich in mercy and great love, raised us with Christ. 'For it is by grace you have been saved, through faith — and this is not from yourselves, it is the gift of God — not by works, so that no one can boast.' This is one of Scripture's clearest declarations of grace. We who were once far from God as Gentiles have now become members of God's household.\n\nIn chapter three, Paul kneels to pray for the church, asking God to open spiritual eyes so believers can comprehend how wide, long, high, and deep Christ's love is.\n\nThe latter three chapters shift from identity to practical living. Chapter four calls for church unity, each person serving with different gifts, growing together. Chapters four and five describe the new person's lifestyle: putting off the old self's behavior (lies, anger, theft, corrupt speech) and putting on the new self's character (truthfulness, goodness, mutual forgiveness). Chapter five discusses love and submission in family relationships.\n\nChapter six's full armor of God is one of the best-known passages. Paul reminds us that the Christian's battle isn't against flesh and blood but against spiritual dark powers. We need the belt of truth, breastplate of righteousness, Gospel of peace shoes, shield of faith, helmet of salvation, sword of the Spirit (God's Word), plus constant prayer.\n\nThe book's theme phrase 'in Christ' appears over one hundred sixty times. Our identity, power, hope, and strength are all in Christ. This isn't theological theory staying in our heads but spiritual reality to be lived out: humbly loving one another, living holy lives, and courageously facing spiritual warfare.",
    "bible_verses": [
      "Ephesians 1:3",
      "Ephesians 2:8-10",
      "Ephesians 4:1",
      "Ephesians 6:11"
    ],
    "discussion_questions": [
      "'在基督里'对你的身份认知有什么影响？How does being 'in Christ' affect your identity?",
      "属灵争战在青少年生活中如何体现？How does spiritual warfare manifest in teenage life?",
      "教会合一为什么这么重要？Why is church unity so important?"
    ],
    "tags": [
      "ephesians",
      "in-christ",
      "spiritual-warfare"
    ]
  },
  {
    "id": "youth-043",
    "section": "bible-guide",
    "category": "圣经导读",
    "title_zh": "腓立比书导读：在基督里的喜乐",
    "title_en": "Philippians Guide: Joy in Christ",
    "content_zh": "腓立比书是保罗的「喜乐书信」。让人惊奇的是，这封洋溢着喜乐的信竟然是在监狱里写成的。保罗被铁链锁着，前途未卜，随时可能被处死，却在信中提到「喜乐」或「欢喜」超过十六次。这告诉我们一个深刻的真理：真正的喜乐不取决于外在环境，而取决于你与基督的关系。\n\n第一章保罗宣告了基督徒人生观的精髓：「因为我活着就是基督，我死了就有益处。」活着有意义，因为可以服侍基督；死了也不可怕，因为可以与基督同在。这样的人生观让我们在任何处境中都有盼望。\n\n第二章包含了新约中最伟大的基督论经文之一。耶稣本有上帝的形象，却不以自己与上帝同等为强夺的，反倒虚己，取了奴仆的形象，成为人的样式。既有人的样子，就自己卑微，存心顺服以至于死，且死在十字架上。因此上帝将祂升为至高，叫万口称耶稣为主。保罗说我们也当以基督的心为心——学习祂的谦卑和顺服。在一个追求自我、崇拜成功的时代，这个呼召格外有力。\n\n第三章保罗分享自己的见证。他曾经拥有令人羡慕的宗教资历：出身名门、受过最好的教育、严格遵守律法。但他说这一切在认识基督之后都变得毫无价值。「我以认识我主基督耶稣为至宝。我为祂已经丢弃万事，看作粪土，为要得着基督。」这不是说教育和成就不重要，而是说与认识基督相比，这些都是次要的。\n\n第四章教导知足和平安的秘诀。「我靠着那加给我力量的，凡事都能做。」这不是说我们无所不能，而是说在基督里我们有足够的力量面对一切。「应当一无挂虑，只要凡事藉着祷告祈求和感谢，将你们所要的告诉上帝。」当我们把忧虑交给上帝，祂的平安就会保守我们的心怀意念。\n\n腓立比书的核心信息是：喜乐不依赖环境，而依赖基督。真正的满足来自认识祂、效法祂、信靠祂，而不是追求世界所推崇的东西。基督徒应该是最有喜乐的人，因为我们拥有永恒的盼望和不会改变的爱。",
    "content_en": "Philippians is Paul's 'joy epistle.' What's remarkable is that this joy-overflowing letter was written from prison. Paul was chained, his future uncertain, potentially facing execution, yet mentions 'joy' or 'rejoice' over sixteen times. This tells us a profound truth: true joy doesn't depend on external circumstances but on your relationship with Christ.\n\nChapter one declares the essence of the Christian life perspective: 'For to me, to live is Christ and to die is gain.' Living has meaning because we serve Christ; death isn't fearful because we'll be with Christ. This life perspective gives hope in any situation.\n\nChapter two contains one of the New Testament's greatest Christological passages. Jesus, being in the form of God, did not count equality with God something to be grasped but emptied Himself, taking the form of a servant, being made in human likeness. Being found in human form, He humbled Himself, becoming obedient to death — even death on a cross. Therefore God exalted Him to the highest, that every tongue confess Jesus is Lord. Paul says we should have this same mindset — learning Christ's humility and obedience. In an age pursuing self and worshiping success, this call is especially powerful.\n\nChapter three shares Paul's testimony. He once had enviable religious credentials: prestigious birth, finest education, strict law observance. But he says all this became worthless after knowing Christ. 'I consider knowing Christ Jesus my Lord as surpassingly valuable. For His sake I have lost all things, counting them as garbage, to gain Christ.' This doesn't mean education and achievement don't matter, but compared to knowing Christ, they're secondary.\n\nChapter four teaches the secret of contentment and peace. 'I can do all things through him who strengthens me.' This doesn't mean we're omnipotent but that in Christ we have sufficient strength for everything. 'Be anxious for nothing, but in everything by prayer and supplication with thanksgiving let your requests be made known to God.' When we hand worries to God, His peace guards our hearts and minds.\n\nPhilippians' core message: joy doesn't depend on circumstances but on Christ. True satisfaction comes from knowing Him, imitating Him, trusting Him — not pursuing what the world values. Christians should be the most joyful people because we possess eternal hope and unchanging love.",
    "bible_verses": [
      "Philippians 1:21",
      "Philippians 2:5-8",
      "Philippians 3:7-8",
      "Philippians 4:13"
    ],
    "discussion_questions": [
      "在困难中如何保持喜乐？How can we maintain joy during difficulties?",
      "基督的谦卑对你有什么挑战？How does Christ's humility challenge you?",
      "什么是真正的知足？What is true contentment?"
    ],
    "tags": [
      "philippians",
      "joy",
      "contentment"
    ]
  },
  {
    "id": "youth-044",
    "section": "bible-guide",
    "category": "圣经导读",
    "title_zh": "加拉太书导读：自由的福音",
    "title_en": "Galatians Guide: The Gospel of Freedom",
    "content_zh": "加拉太书被称为「基督徒自由的大宪章」，是保罗写得最激动、最直接的一封书信。加拉太地区的教会被假教师严重误导，这些人教导说单单信耶稣还不够，还必须遵守犹太律法（特别是割礼）才能得救。保罗听到这个消息后非常震怒，因为这触及了福音的核心。\n\n保罗开门见山地宣告：如果有人传与他所传不同的福音，那人就应当被咒诅。语气之严厉在保罗书信中罕见。他接着用自己的经历证明他所传的福音直接来自耶稣基督的启示，不是从人学来的。\n\n第二章记录了一件惊人的事：保罗当面抵挡使徒彼得。因为彼得在犹太人面前假装不和外邦人基督徒一起吃饭，他的行为实际上否认了因信称义的真理。保罗说：「我已经与基督同钉十字架，现在活着的不再是我，乃是基督在我里面活着。」这节经文成为基督徒生命的座右铭。\n\n第三章保罗用旧约的证据论证：律法的目的从来不是让人靠守律法得救。律法像一位严厉的导师，把我们引到基督面前，让我们看到自己根本无法达到上帝的标准，从而转向恩典。如今基督已经来了，我们就不再需要那位导师了。\n\n第四章用生动的比喻说明我们的身份变化：从前我们像奴仆一样被律法辖制，如今因着基督我们成了上帝的儿女，可以亲密地称上帝为「阿爸父」。\n\n第五章是全书的实际应用。基督释放了我们，叫我们得以自由，所以要站立得稳，不要再被奴役的轭挟制。但自由不等于放纵——不要用这自由当作放纵肉体情欲的机会，总要用爱心互相服侍。保罗对比了肉体的行为（淫乱、仇恨、嫉妒、纷争等）和圣灵的果子（仁爱、喜乐、和平、忍耐、恩慈、良善、信实、温柔、节制）。第六章教导信徒互相担当重担，各人在基督里成就上帝的律法。\n\n关键信息是：救恩完全出于恩典，不需要加上任何人的行为或功德。律法主义（靠行为赚取救恩）和放纵主义（滥用恩典去犯罪）都是对福音的扭曲。真正的自由是被释放来爱上帝、爱人，用生命彼此服侍。",
    "content_en": "Galatians is called 'the Magna Carta of Christian freedom' — Paul's most passionate and direct letter. Churches in the Galatian region were seriously misled by false teachers claiming that faith in Jesus alone wasn't enough — one must also observe Jewish law (especially circumcision) to be saved. When Paul heard this, he was furious because it struck at the Gospel's core.\n\nPaul declares straightaway: if anyone preaches a gospel different from what he preached, that person should be cursed. Such severity is rare in Paul's letters. He then uses his own experience to prove that his Gospel came directly from Jesus Christ's revelation, not learned from humans.\n\nChapter two records something stunning: Paul confronted the Apostle Peter face-to-face. Peter had been pretending not to eat with Gentile Christians in front of Jewish believers — his behavior effectively denied the truth of justification by faith. Paul says: 'I have been crucified with Christ. It is no longer I who live, but Christ who lives in me.' This verse has become the Christian life's motto.\n\nChapter three uses Old Testament evidence to argue: the law's purpose was never for people to be saved by keeping it. The law was like a strict tutor leading us to Christ, showing us we could never reach God's standard, thus turning us toward grace. Now that Christ has come, we no longer need that tutor.\n\nChapter four uses vivid metaphor to illustrate our identity change: formerly we were like slaves under the law's control; now through Christ we've become God's children, able to intimately call God 'Abba, Father.'\n\nChapter five is the book's practical application. Christ has set us free for freedom, so stand firm and don't submit again to a yoke of slavery. But freedom doesn't equal indulgence — don't use this freedom as opportunity for fleshly desires, but serve one another through love. Paul contrasts works of the flesh (sexual immorality, hatred, jealousy, strife, etc.) with the Spirit's fruit (love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control). Chapter six teaches believers to bear one another's burdens, each fulfilling God's law in Christ.\n\nThe key message: salvation is entirely by grace, requiring no human works or merit. Both legalism (earning salvation through works) and licentiousness (abusing grace to sin) distort the Gospel. True freedom is being released to love God, love people, and serve one another with our lives.",
    "bible_verses": [
      "Galatians 2:20",
      "Galatians 3:24",
      "Galatians 5:1",
      "Galatians 6:2"
    ],
    "discussion_questions": [
      "基督徒的自由包括什么？不包括什么？What does Christian freedom include? What doesn't it include?",
      "为什么律法主义这么有吸引力？Why is legalism so attractive?",
      "如何平衡自由与责任？How do we balance freedom and responsibility?"
    ],
    "tags": [
      "galatians",
      "freedom",
      "grace"
    ]
  },
  {
    "id": "youth-045",
    "section": "bible-guide",
    "category": "圣经导读",
    "title_zh": "歌罗西书导读：基督的至上性",
    "title_en": "Colossians Guide: Christ's Supremacy",
    "content_zh": "歌罗西教会面临一种危险的错误教导：有人说单单信基督还不够，还需要加上特别的知识、神秘的仪式、天使崇拜或严格的禁欲规条才能达到更高的属灵境界。保罗写这封信就是要纠正这个错误，并且坚定地宣告：基督就是一切，祂完全足够。\n\n第一章包含了新约中最伟大的基督论宣言之一。保罗说基督是「那不能看见之上帝的像」——看见耶稣就是看见上帝。祂是「首生的，在一切被造的以先」——不是说祂被造，而是说祂的地位高于一切受造物。「万有都是靠祂造的，又是为祂造的」——从浩瀚的星系到微小的原子，一切都因祂而存在，也为祂而存在。祂在凡事上居首位。这些话彻底否定了任何试图把基督降低为「众多属灵存在之一」的想法。\n\n第二章发出严厉的警告：不要被人用哲学和虚空的妄言把你掳去，那些不过是人间的遗传和世上的小学，不是照着基督。保罗宣告一个惊人的真理：在基督里面有上帝本性一切的丰盛，都有形有体地居住在祂里面。而我们在基督里面也得了丰盛。意思是说，你已经拥有了你所需要的一切属灵资源，不需要基督以外的任何添加物。不要让任何人因为饮食规条、节期规定或所谓的神秘体验来论断你、辖制你。\n\n第三章转向新生活的实际操作。保罗说你们既然与基督一同复活了，就当求在上面的事。要治死地上的邪情私欲：淫乱、污秽、贪婪、恼恨、恶毒的言语。要穿上新人的品格：怜悯、恩慈、谦虚、温柔、忍耐，彼此包容、互相饶恕。在这一切之上还要穿上爱心，因为爱心是联络全德的。让基督的话语丰丰富富地住在你们心里，用诗章、颂词、灵歌彼此教导、互相劝诫。\n\n第四章论到信徒在各种关系中应有的品格和见证。核心信息始终不变：基督足够了！祂是万有的主宰，我们在祂里面已经完全了。不需要「基督加上别的什么东西」。今天我们也面临同样的诱惑——各种流行思潮、灵修方法、成功学说试图取代或补充基督的地位。歌罗西书提醒我们牢牢抓住基督，因为祂就是一切。",
    "content_en": "The Colossian church faced a dangerous false teaching: some said faith in Christ alone wasn't enough — one needed special knowledge, mystical rituals, angel worship, or strict ascetic rules to reach higher spiritual levels. Paul wrote this letter to correct this error and firmly declare: Christ is everything, He is completely sufficient.\n\nChapter one contains one of the New Testament's greatest Christological declarations. Paul says Christ is 'the image of the invisible God' — seeing Jesus is seeing God. He is 'the firstborn over all creation' — not meaning He was created, but that His position is above all creation. 'All things were created through him and for him' — from vast galaxies to tiny atoms, everything exists because of and for Him. He has supremacy in everything. These words thoroughly refute any attempt to reduce Christ to 'one among many spiritual beings.'\n\nChapter two issues a stern warning: don't let anyone take you captive through philosophy and empty deception based on human tradition and worldly principles rather than Christ. Paul declares an stunning truth: in Christ all the fullness of deity dwells bodily. And in Christ we have been made complete. This means you already possess every spiritual resource you need — no supplements outside Christ required. Don't let anyone judge or control you with dietary rules, festival regulations, or supposed mystical experiences.\n\nChapter three turns to practical new-life application. Paul says since you've been raised with Christ, seek things above. Put to death earthly sinful desires: sexual immorality, impurity, greed, rage, malicious speech. Put on the new self's character: compassion, kindness, humility, gentleness, patience, bearing with and forgiving one another. Above all, put on love, which binds everything together in perfect harmony. Let Christ's word dwell richly in your hearts, teaching and admonishing one another with psalms, hymns, and spiritual songs.\n\nChapter four addresses the character and witness believers should have in various relationships. The core message remains unchanged: Christ is enough! He is Lord of all, and we are complete in Him. No need for 'Christ plus something else.' Today we face the same temptation — various trendy ideologies, spiritual methods, and success philosophies try to replace or supplement Christ's position. Colossians reminds us to hold firmly to Christ, because He is everything.",
    "bible_verses": [
      "Colossians 1:15-17",
      "Colossians 2:9-10",
      "Colossians 3:1-3",
      "Colossians 3:16"
    ],
    "discussion_questions": [
      "今天什么东西试图与基督竞争首位？What tries to compete with Christ for first place today?",
      "基督的至上性如何影响你的日常决定？How does Christ's supremacy affect your daily decisions?",
      "'在基督里完全'对你意味着什么？What does being 'complete in Christ' mean to you?"
    ],
    "tags": [
      "colossians",
      "supremacy-of-christ",
      "complete"
    ]
  },
  {
    "id": "youth-046",
    "section": "bible-guide",
    "category": "圣经导读",
    "title_zh": "提摩太前书导读：教会生活指南",
    "title_en": "1 Timothy Guide: Church Life Manual",
    "content_zh": "提摩太前书是保罗写给他最亲密的年轻同工提摩太的教牧书信。提摩太当时留在以弗所负责牧养教会，面对各种挑战和压力。保罗像一位属灵父亲一样，用这封信指导他如何管理教会、持守真道、活出敬虔的生命。\n\n第一章警告提摩太要防备异端教导。有些人偏离了信仰的核心，热衷于无穷的家谱和争论，这些东西只引起辩论，对信仰成长毫无帮助。保罗强调律法本身是好的，但要按正意使用——律法的目的是显明罪，把人引向恩典，而不是成为辖制人的工具。\n\n第二章论到祷告和敬拜的教导。保罗劝勉为万人祷告，特别为在位的执政者祷告，好让信徒过安静平稳的生活。这章也讨论了男女在教会敬拜中的不同角色，虽然这个话题有不同的理解，但核心是秩序和彼此尊重。\n\n第三章详细说明教会领袖——监督（长老）和执事的资格。这里特别值得注意的是：保罗强调的重点不是能力、学历或恩赐，而是品格。一个教会领袖必须是无可指责的、忠于配偶、有节制、自守、端正、乐意接待人、善于教导、不醉酒不暴躁、温和、不贪财。管好自己的家，因为不能管好自己家的人怎能照管上帝的教会呢？\n\n第四章预言末世必有人离弃真道，被虚假的教导迷惑。保罗的对策不是恐惧，而是鼓励提摩太在敬虔上操练自己。就像运动员需要每天训练身体，基督徒也需要每天操练属灵生命。\n\n第五章论到如何对待教会中不同年龄段的信徒、如何照顾寡妇、如何尊重和监督长老。第六章严厉警告贪财的危险：「贪财是万恶之根」。不是说金钱本身是恶的，而是说对金钱的贪恋会引人离开信仰，陷入各种试探。要追求敬虔加上知足，这才是真正的大利。\n\n对提摩太个人最重要的劝勉是：「不可叫人小看你年轻，总要在言语、行为、爱心、信心、清洁上，都作信徒的榜样。」这对今天的年轻基督徒特别有意义。年龄不是限制，品格才是关键。上帝可以大大使用年轻人——关键是你愿不愿意在生命的各个方面追求卓越，成为别人的榜样。",
    "content_en": "1 Timothy is Paul's pastoral letter to his closest young coworker Timothy. Timothy was stationed in Ephesus to shepherd the church, facing various challenges and pressures. Paul, like a spiritual father, used this letter to guide him in church management, holding to truth, and living a godly life.\n\nChapter one warns Timothy to guard against false teaching. Some had strayed from faith's core, obsessing over endless genealogies and arguments that only produce debates without building faith. Paul emphasizes the law itself is good but must be used properly — the law's purpose is revealing sin and leading people to grace, not becoming a controlling tool.\n\nChapter two covers prayer and worship instruction. Paul urges prayer for all people, especially governing authorities, so believers can live quiet, peaceful lives. This chapter also discusses different roles for men and women in church worship — though interpretations vary, the core is order and mutual respect.\n\nChapter three details qualifications for church leaders — overseers (elders) and deacons. Notably, Paul's emphasis isn't on ability, education, or giftedness but character. A church leader must be above reproach, faithful to spouse, temperate, self-controlled, respectable, hospitable, able to teach, not given to drunkenness or violence, gentle, not lovers of money. Managing their own household well — for how can someone who can't manage their own family care for God's church?\n\nChapter four prophesies that in later times some will abandon the faith, deceived by false teachings. Paul's remedy isn't fear but encouraging Timothy to train himself in godliness. Just as athletes train daily, Christians need daily spiritual exercise.\n\nChapter five covers how to treat different age groups in church, caring for widows, respecting and overseeing elders. Chapter six sternly warns against the danger of loving money: 'the love of money is a root of all kinds of evil.' Not that money itself is evil, but craving it leads people away from faith into various temptations. Pursue godliness with contentment — that's true gain.\n\nThe most important personal exhortation to Timothy: 'Don't let anyone look down on you because you are young, but set an example for the believers in speech, in conduct, in love, in faith and in purity.' This is especially meaningful for young Christians today. Age isn't the limitation — character is key. God can greatly use young people — the question is whether you're willing to pursue excellence in every area of life, becoming an example for others.",
    "bible_verses": [
      "1 Timothy 3:16",
      "1 Timothy 4:12",
      "1 Timothy 6:6",
      "1 Timothy 6:10"
    ],
    "discussion_questions": [
      "年轻人在教会中可以怎样服侍？How can young people serve in church?",
      "什么是真正的敬虔？What is true godliness?",
      "如何平衡谦卑与做榜样？How do we balance humility with being an example?"
    ],
    "tags": [
      "1-timothy",
      "church-leadership",
      "youth-example"
    ]
  },
  {
    "id": "youth-047",
    "section": "bible-guide",
    "category": "圣经导读",
    "title_zh": "提摩太后书导读：最后的嘱托",
    "title_en": "2 Timothy Guide: Final Charge",
    "content_zh": "提摩太后书是保罗的遗言，在即将殉道前从罗马监狱写给他最亲爱的属灵儿子提摩太。这封信充满了紧迫感、深情和力量，读来让人感动不已。一个即将离世的老战士，把一生最重要的教训留给下一代。\n\n第一章保罗鼓励提摩太不要以福音为耻，也不要以保罗这个囚犯为耻。上帝给我们的不是胆怯的心，而是刚强、仁爱、谨守的心。提摩太天性可能比较胆小内向，但保罗提醒他：勇气不是没有恐惧，而是在恐惧中依然前行。要为福音受苦的预备心，因为跟随基督从来都不是一条轻松的路。\n\n第二章用三个精彩的比喻说明事奉的品格。士兵不将世务缠身，好叫征召他的人喜悦——专心是关键。运动员要按规矩比赛，不然得不到冠冕——守规矩、有纪律很重要。农夫劳力耕种，理当先得粮食——勤劳终有回报。「你要和我同受苦难，好像基督耶稣的精兵」，服侍上帝需要甘愿吃苦的心志。\n\n第三章对末世发出严肃的预言。末后的日子人会变得自私、贪财、自夸、狂傲、不孝、忘恩、不圣洁、无亲情。这些描述放在今天来看何等准确。面对这样的世代，保罗的处方不是悲观绝望，而是坚守圣经。「圣经都是上帝所默示的，于教训、督责、使人归正、教导人学义都是有益的，叫属上帝的人得以完全，预备行各样的善事。」这节经文是基督教圣经观的根基——圣经不是人写的普通书籍，而是上帝亲自默示的话语，有改变生命的大能。\n\n第四章是保罗最著名、最感人的嘱托：「务要传道，无论得时不得时，总要专心，并用百般的忍耐各样的教训责备人、警戒人、劝勉人。」不管环境好坏，不管有没有人听，都要忠心地传讲上帝的话语。\n\n保罗最后回顾自己的一生，写下了那段千古名言：「那美好的仗我已经打过了，当跑的路我已经跑尽了，所信的道我已经守住了。从此以后，有公义的冠冕为我存留。」这不是骄傲的自夸，而是一个忠心仆人的坦然交账。每一个基督徒都应该以这样的目标来过自己的一生——到最后能说：我尽力了，我没有退缩，我持守了信仰。这是为主而活的最高典范。",
    "content_en": "2 Timothy is Paul's last will, written to his dearest spiritual son Timothy from a Roman prison before martyrdom. This letter is filled with urgency, deep affection, and power — deeply moving to read. An old warrior about to depart, leaving life's most important lessons for the next generation.\n\nChapter one encourages Timothy not to be ashamed of the Gospel or of Paul the prisoner. God gave us a spirit not of timidity but of power, love, and self-discipline. Timothy may have been naturally timid and introverted, but Paul reminds him: courage isn't absence of fear but pressing forward despite it. Be prepared to suffer for the Gospel, because following Christ has never been an easy road.\n\nChapter two uses three brilliant analogies to describe ministry character. A soldier doesn't entangle himself in civilian affairs, pleasing his commanding officer — focus is key. An athlete competes according to the rules, otherwise no crown — discipline matters. A hardworking farmer deserves first share of the crops — diligence is rewarded. 'Share in suffering as a good soldier of Christ Jesus' — serving God requires willingness to endure hardship.\n\nChapter three solemnly prophesies about the last days. In the final times people will be self-loving, money-loving, boastful, arrogant, disobedient to parents, ungrateful, unholy, unloving. How accurate these descriptions are today. Facing such times, Paul's prescription isn't pessimistic despair but holding firm to Scripture. 'All Scripture is God-breathed and useful for teaching, rebuking, correcting and training in righteousness, so that the servant of God may be thoroughly equipped for every good work.' This verse is the foundation of the Christian view of Scripture — the Bible isn't an ordinary human book but God's personally inspired Word with life-transforming power.\n\nChapter four is Paul's most famous, most moving charge: 'Preach the word; be prepared in season and out of season; correct, rebuke and encourage — with great patience and careful instruction.' Whether circumstances are favorable or not, whether anyone listens or not, faithfully proclaim God's Word.\n\nPaul finally reviews his life, writing those immortal words: 'I have fought the good fight, I have finished the race, I have kept the faith. Now there is in store for me the crown of righteousness.' This isn't proud boasting but a faithful servant's honest accounting. Every Christian should live with this goal — to say at the end: I gave my all, I didn't retreat, I kept the faith. This is the highest model of living for the Lord.",
    "bible_verses": [
      "2 Timothy 1:7",
      "2 Timothy 2:3",
      "2 Timothy 3:16-17",
      "2 Timothy 4:7"
    ],
    "discussion_questions": [
      "面对困难时你如何不以福音为耻？How do you not be ashamed of the Gospel when facing difficulties?",
      "圣经在你生活中的作用是什么？What role does Scripture play in your life?",
      "你希望在生命终点时能说什么？What do you hope to say at the end of your life?"
    ],
    "tags": [
      "2-timothy",
      "perseverance",
      "scripture"
    ]
  },
  {
    "id": "youth-048",
    "section": "bible-guide",
    "category": "圣经导读",
    "title_zh": "希伯来书导读：基督更美的约",
    "title_en": "Hebrews Guide: Christ's Better Covenant",
    "content_zh": "希伯来书写给一群正在考虑放弃基督教信仰、回到犹太教的基督徒。他们可能因为逼迫的压力，觉得回到从前的宗教传统更安全。作者用严密的论证告诉他们：你们千万不要回头，因为基督和新约在每一方面都胜过旧约。\n\n第一章开篇就宣告基督比天使更尊贵。在犹太传统中天使地位很高，但基督是上帝的儿子，是上帝荣耀的光辉、本体的真像。天使不过是服役的灵，基督却坐在至高者的右边掌权。\n\n第三到四章论证基督比摩西更伟大。摩西虽然忠心，但他是仆人，基督却是上帝的儿子治理上帝的家。摩西带领以色列人出埃及，但他们因为不信没能进入应许之地。基督带来的安息远超迦南地的安息——祂给我们灵魂的真正安息。\n\n第五到七章是全书的核心论证：基督是更美的大祭司。旧约的祭司按亚伦的等次，他们自己也有罪，需要先为自己献祭，而且会老死需要替换。但基督是按麦基洗德的等次——一个永恒的祭司体系。祂无罪，不需要为自己献祭。祂永远活着，不需要替换。祂能体恤我们的软弱，因为祂凡事受过试探，却没有犯罪。所以我们可以坦然无惧地来到施恩的宝座前。\n\n第八到十章论证基督献上更美的祭。旧约每年都要献祭，因为牛羊的血不能真正除罪。但基督一次将自己献上，就永远除掉了罪。祂用自己的血立了新约，不是用动物的血。这个祭是一次完成、永远有效的。\n\n第十一章是著名的「信心英雄榜」，列举了亚伯拉罕、摩西、拉合等旧约圣徒的信心榜样。他们虽然没有看见应许的实现，却凭着信心活着。第十二章发出呼召：既然有这么多信心的见证人像云彩一样围绕着我们，我们就当仰望耶稣——为了前面的喜乐忍受了十字架的苦难。上帝的管教也是出于爱，为要我们在祂的圣洁上有份。\n\n核心信息是：千万不要回头！基督已经成就了完美的救恩。旧约的一切都只是影子，基督才是实体。我们有更美的指望、更美的祭司、更美的祭物、更美的约。向前走，不要退后。",
    "content_en": "Hebrews was written to Christians considering abandoning their faith to return to Judaism. Perhaps under persecution's pressure, they felt returning to former religious traditions was safer. The author uses rigorous argumentation to tell them: don't go back, because Christ and the new covenant surpass the old in every way.\n\nChapter one opens declaring Christ is superior to angels. In Jewish tradition angels held high status, but Christ is God's Son — the radiance of God's glory and exact representation of His being. Angels are merely ministering spirits; Christ sits at the right hand of the Majesty in heaven, ruling.\n\nChapters three and four argue Christ is greater than Moses. Though Moses was faithful, he was a servant; Christ is God's Son governing God's household. Moses led Israel out of Egypt, but they failed to enter the promised land due to unbelief. Christ's rest far surpasses Canaan's rest — He gives our souls true rest.\n\nChapters five through seven are the book's core argument: Christ is a better high priest. Old Testament priests served in Aaron's order — they themselves were sinful, needing to sacrifice for themselves first, and died requiring replacement. But Christ serves in Melchizedek's order — an eternal priesthood. He is sinless, needing no sacrifice for Himself. He lives forever, needing no replacement. He can sympathize with our weaknesses, having been tempted in every way yet without sin. So we can approach the throne of grace with confidence.\n\nChapters eight through ten argue Christ offered a better sacrifice. Old Testament sacrifices were repeated annually because animal blood couldn't truly remove sin. But Christ offered Himself once, removing sin forever. He established the new covenant with His own blood, not animals'. This sacrifice is completed once, effective eternally.\n\nChapter eleven is the famous 'hall of faith,' listing faith examples of Abraham, Moses, Rahab, and other Old Testament saints. Though they didn't see the promises fulfilled, they lived by faith. Chapter twelve issues the call: since we're surrounded by such a great cloud of witnesses, let us fix our eyes on Jesus — who for the joy set before Him endured the cross. God's discipline also comes from love, that we may share in His holiness.\n\nThe core message: don't go back! Christ has accomplished perfect salvation. Everything in the old covenant was shadow; Christ is the reality. We have better hope, better priest, better sacrifice, better covenant. Press forward, don't retreat.",
    "bible_verses": [
      "Hebrews 1:1-2",
      "Hebrews 4:14-16",
      "Hebrews 9:12",
      "Hebrews 12:1-2"
    ],
    "discussion_questions": [
      "为什么基督比旧约制度更好？Why is Christ better than the Old Testament system?",
      "第11章的信心英雄如何鼓励你？How do the faith heroes in chapter 11 encourage you?",
      "什么会让你想要'回头'？What might tempt you to 'go back'?"
    ],
    "tags": [
      "hebrews",
      "better-covenant",
      "perseverance"
    ]
  },
  {
    "id": "youth-049",
    "section": "bible-guide",
    "category": "圣经导读",
    "title_zh": "启示录导读：最终的胜利",
    "title_en": "Revelation Guide: Ultimate Victory",
    "content_zh": "启示录是使徒约翰被放逐在拔摩岛上时得到的异象，是圣经最后一卷书，也是最常被误解的一卷。全书充满了象征性的语言和奇异的画面，但核心信息其实很清楚：耶稣基督是历史的主宰，无论现在多么黑暗，祂必得胜，祂的子民也必与祂一同得胜。\n\n第一到三章是复活的基督向亚细亚七个教会说话。每个教会都有不同的属灵状况：有的教会失去了起初的爱心，有的在逼迫中坚定不移，有的容忍错误的教导，有的不冷不热让基督想要吐出去。这些信息不只是写给古代教会的，也是对今天每个信徒和教会的提醒和警告。\n\n第四到五章描绘了天上的敬拜场景，无比壮丽。上帝坐在宝座上，二十四位长老和四活物昼夜不住地赞美。但有一卷书卷没有人配展开——直到犹大支派的狮子、被杀的羔羊出现。这是耶稣：祂既是得胜的狮子，又是牺牲的羔羊。天上的敬拜宣告祂配得荣耀和尊贵。\n\n第六到十九章是审判的异象：七印、七号、七碗，描述末日的灾难和上帝对罪恶的最终审判。这些象征性的画面可能让人害怕，但启示录的目的不是吓唬人，而是给受苦的教会带来安慰和盼望：上帝在掌权，邪恶不会永远横行，祂必定会为圣徒伸冤，为受压迫的人伸张正义。巴比伦大城（代表一切抵挡上帝的权势）最终必然倒塌。\n\n第二十章讲到千禧年的异象和最后的审判。撒但最终被扔进火湖，死亡和阴间也被消灭。一切的邪恶都将彻底终结。\n\n第二十一到二十二章是全书也是整本圣经最美丽的结尾：新天新地，圣城新耶路撒冷从天而降。上帝亲自与祂的子民同住，「祂要擦去他们一切的眼泪，不再有死亡，也不再有悲哀、哭号、疼痛，因为以前的事都过去了。」那里有生命河和生命树，上帝的荣光代替了日月的光辉。这是我们最终的盼望——不是逃避现实的幻想，而是确定的将来。\n\n启示录以耶稣的应许作为结束：「是了，我必快来！」约翰回应说：「阿们！主耶稣啊，我愿你来！」这也应该是我们每个人的心声。无论现在的世界多么黑暗混乱，基督已经得胜了，我们站在胜利者的一边。坚持到底的人必得生命的冠冕。",
    "content_en": "Revelation is the Apostle John's vision received while exiled on the island of Patmos — the Bible's last book and most frequently misunderstood. Filled with symbolic language and extraordinary imagery, its core message is actually clear: Jesus Christ is history's sovereign Lord; no matter how dark the present, He will be victorious, and His people will triumph with Him.\n\nChapters one through three feature the risen Christ speaking to seven churches in Asia. Each church has different spiritual conditions: some lost their first love, some stood firm under persecution, some tolerated false teaching, some were lukewarm making Christ want to spit them out. These messages weren't just for ancient churches — they're reminders and warnings for every believer and church today.\n\nChapters four and five depict indescribably magnificent heavenly worship. God sits on the throne, twenty-four elders and four living creatures praise ceaselessly day and night. But a scroll exists that no one is worthy to open — until the Lion of Judah, the slain Lamb appears. This is Jesus: both conquering Lion and sacrificial Lamb. Heaven's worship declares Him worthy of glory and honor.\n\nChapters six through nineteen are visions of judgment: seven seals, seven trumpets, seven bowls, describing end-time calamities and God's final judgment on evil. These symbolic images may frighten, but Revelation's purpose isn't to terrify but to bring comfort and hope to the suffering church: God reigns, evil won't prevail forever, He will vindicate His saints and bring justice for the oppressed. Babylon the great (representing all powers opposing God) will ultimately fall.\n\nChapter twenty covers the millennial vision and final judgment. Satan is finally thrown into the lake of fire; death and Hades are also destroyed. All evil will be completely terminated.\n\nChapters twenty-one and twenty-two are the book's — and the entire Bible's — most beautiful conclusion: new heaven and new earth, the holy city New Jerusalem descending from heaven. God Himself dwells with His people: 'He will wipe every tear from their eyes. There will be no more death or mourning or crying or pain, for the old order of things has passed away.' There flows the river of life and grows the tree of life; God's glory replaces sun and moon. This is our ultimate hope — not escapist fantasy but certain future.\n\nRevelation closes with Jesus' promise: 'Yes, I am coming soon!' John responds: 'Amen. Come, Lord Jesus!' This should be every one of our heart's cry. No matter how dark and chaotic the present world, Christ has already won — we stand on the victor's side. Those who persevere to the end will receive the crown of life.",
    "bible_verses": [
      "Revelation 1:8",
      "Revelation 5:9-10",
      "Revelation 21:3-4",
      "Revelation 22:20"
    ],
    "discussion_questions": [
      "启示录中的象征如何帮助我们理解属灵真理？How do Revelation's symbols help us understand spiritual truths?",
      "面对苦难时，最终胜利的盼望如何安慰你？How does hope of ultimate victory comfort you during suffering?",
      "新天新地与现在的世界有什么不同？How will the new heaven and earth be different from now?"
    ],
    "tags": [
      "revelation",
      "victory",
      "new-creation"
    ]
  },
  {
    "id": "youth-054",
    "section": "campus",
    "category": "校园生活",
    "title_zh": "校园霸凌：在困难中寻求帮助",
    "title_en": "School Bullying: Seeking Help in Difficulties",
    "content_zh": "校园霸凌是一个严重的问题，不仅仅是身体上的伤害，更是深层的情感创伤。霸凌可能表现为肢体暴力、言语嘲讽、社交排挤、网络攻击等不同形式。如果你正在经历霸凌，首先请知道这几件重要的事。\n\n第一，这不是你的错。很多被霸凌的同学会自责，觉得是自己哪里不好才被欺负。但霸凌反映的是施暴者的问题，不是你的问题。上帝深深地爱你，祂看见你的痛苦，祂的心与你同在。「耶和华靠近伤心的人，拯救灵性痛悔的人。」\n\n第二，立即寻求帮助。告诉父母、老师、学校辅导员或其他你信任的成年人。不要试图独自承担这一切。有些同学觉得「告状」很丢脸，但寻求帮助不是软弱，而是智慧和勇气的表现。上帝经常通过人来帮助我们，不要拒绝祂放在你身边的帮助者。\n\n第三，为伤害你的人祷告。这可能是最难做到的一点，但这不是说你要继续忍受被欺负。祷告是为了保护你自己的心，不让仇恨和苦毒在里面生根。仇恨最终伤害的是怀恨的人自己。耶稣说「要爱你们的仇敌，为那逼迫你们的祷告」，这是超自然的力量，靠我们自己做不到，但靠圣灵可以。\n\n第四，记录每次事件的时间、地点、具体情况和目击证人。这些记录在向学校或相关机构寻求帮助时非常重要，能帮助大人们了解情况的严重性并采取行动。\n\n第五，如果你看到别人被霸凌，要有勇气站出来，至少去寻求成年人的帮助。沉默有时候就是帮凶。做一个旁观者需要的勇气，可能正是别人需要的救命稻草。\n\n第六，永远记住你的真正身份：你是上帝的儿女，拥有无限的价值和尊严。霸凌者的话、拳头或排挤不能定义你。你的价值不是由任何人的评价决定的，而是由创造你的上帝决定的。如果你出现了严重的情绪问题甚至自杀的想法，请立即寻求专业心理帮助。生命宝贵，上帝对你的人生有美好的计划。黑暗会过去，光明一定会来。",
    "content_en": "School bullying is a serious issue involving not just physical harm but deep emotional trauma. Bullying can manifest as physical violence, verbal mockery, social exclusion, cyberbullying, and other forms. If you're experiencing bullying, first know these important things.\n\nFirst, it's not your fault. Many bullied students blame themselves, thinking something's wrong with them. But bullying reflects the perpetrator's problems, not yours. God deeply loves you, sees your pain, and His heart is with you. 'The LORD is close to the brokenhearted and saves those who are crushed in spirit.'\n\nSecond, immediately seek help. Tell parents, teachers, school counselors, or other trusted adults. Don't try to bear this alone. Some students feel 'telling' is embarrassing, but seeking help isn't weakness — it's wisdom and courage. God often helps us through people; don't refuse the helpers He's placed around you.\n\nThird, pray for those hurting you. This may be the hardest point, but it doesn't mean continuing to endure being bullied. Prayer protects your own heart from hatred and bitterness taking root. Hatred ultimately hurts the one harboring it most. Jesus said 'love your enemies and pray for those who persecute you' — this is supernatural strength, impossible on our own but possible through the Holy Spirit.\n\nFourth, document each incident — time, place, specifics, and witnesses. These records are crucial when seeking help from school or relevant authorities, helping adults understand the severity and take action.\n\nFifth, if you see others being bullied, have the courage to step up, or at least seek adult help. Silence sometimes makes us accomplices. The courage needed to be an active bystander may be the lifeline someone desperately needs.\n\nSixth, always remember your true identity: you are God's child with infinite worth and dignity. Bullies' words, fists, or exclusion cannot define you. Your value isn't determined by anyone's assessment but by the God who created you. If you're experiencing severe emotional distress or suicidal thoughts, please immediately seek professional psychological help. Life is precious; God has beautiful plans for your future. Darkness will pass; light will surely come.",
    "bible_verses": [
      "Psalm 34:18",
      "Isaiah 41:10",
      "Romans 8:38-39",
      "Proverbs 31:8-9"
    ],
    "discussion_questions": [
      "为什么校园霸凌这么普遍？Why is school bullying so common?",
      "如何帮助被霸凌的同学？How can you help bullied classmates?",
      "面对霸凌时，饶恕和保护自己如何平衡？How do you balance forgiveness and self-protection when facing bullying?"
    ],
    "tags": [
      "bullying",
      "help-seeking",
      "identity"
    ]
  },
  {
    "id": "youth-055",
    "section": "campus",
    "category": "校园生活",
    "title_zh": "在校园里自然地传福音",
    "title_en": "Natural Evangelism on Campus",
    "content_zh": "向同学传福音常常让人紧张，担心被拒绝、被嘲笑，或者损害辛苦建立的友谊。但福音本来就是好消息，好消息应该是让人乐意分享的，关键在于找到自然、真诚的方式。\n\n首先，最有力的传福音方式是活出基督的样式。你的同学每天都在观察你：你是否诚实？你怎么对待不受欢迎的人？你在压力下的反应是什么？你跟别人有什么不同？当你的生活展现出基督的品格——诚实、善良、有爱心、可靠、在困难中仍有平安——人们自然会好奇你为什么不一样。这种好奇心往往是福音对话最好的开始。\n\n其次，要建立真诚的友谊。不要把同学只看作「传福音的对象」，好像一完成任务就可以不管了。要真心关心他们的生活、学习、困难和梦想。耶稣不是在路上抓住陌生人背诵福音大纲，祂是和人一起吃饭、聊天、分享生活中遇见他们。\n\n第三，分享而不是争论。与其跟同学辩论上帝存不存在，不如说出上帝在你生命中的真实作为。个人见证比任何神学辩论都更有说服力，因为别人可以质疑你的论点，但很难否认你的亲身经历。「上帝如何帮助我度过那段最难的时期」比「你必须相信上帝否则下地狱」有效得多。\n\n第四，善用邀请的方式。邀请同学参加教会青年聚会、圣诞节特别活动、夏令营或是基督徒组织的公益活动。在轻松友好的环境中接触福音，比在课桌旁被说教要容易接受得多。很多人的信仰旅程都是从一次不经意的邀请开始的。\n\n第五，为你的同学恒切祷告。不要低估祷告的力量。圣灵在人心里的工作，比你的口才和说服力重要一万倍。你的责任是忠心地播种和浇灌，让种子生长的是上帝自己。\n\n第六，接受拒绝，保持耐心。不是每个人听到福音都会立刻相信。有些人可能需要很长时间、很多次的接触才会愿意敞开心。被拒绝不代表失败，继续做朋友，继续祷告。你可能只是他们信仰旅程中的一个环节，但每个环节都很重要。记住保罗的话：「我栽种了，亚波罗浇灌了，惟有上帝叫他生长。」",
    "content_en": "Evangelizing classmates often makes people nervous — worried about rejection, mockery, or damaging hard-built friendships. But the Gospel is good news, and good news should be something we're eager to share. The key is finding natural, sincere ways.\n\nFirst, the most powerful evangelism is living out Christ's character. Your classmates observe you daily: Are you honest? How do you treat unpopular people? How do you respond under pressure? What makes you different? When your life displays Christ's character — honesty, kindness, love, reliability, peace amid difficulties — people naturally become curious about why you're different. This curiosity is often the best starting point for Gospel conversations.\n\nSecond, build genuine friendships. Don't view classmates merely as 'evangelism targets' to be abandoned once the mission is complete. Truly care about their lives, studies, struggles, and dreams. Jesus didn't grab strangers on the road to recite Gospel outlines — He ate with people, chatted, and shared life with them.\n\nThird, share rather than argue. Instead of debating God's existence, tell what God has actually done in your life. Personal testimony is more persuasive than any theological debate, because others can challenge your arguments but can hardly deny your lived experience. 'How God helped me through my hardest season' is far more effective than 'you must believe in God or go to hell.'\n\nFourth, leverage invitations. Invite classmates to church youth gatherings, Christmas events, summer camps, or Christian-organized service activities. Encountering the Gospel in a relaxed, friendly environment is much more receptive than being lectured at a desk. Many people's faith journeys began with one casual invitation.\n\nFifth, pray persistently for your classmates. Don't underestimate prayer's power. The Holy Spirit's work in human hearts is ten thousand times more important than your eloquence or persuasion. Your responsibility is faithful planting and watering; making seeds grow is God's work.\n\nSixth, accept rejection and remain patient. Not everyone who hears the Gospel will immediately believe. Some may need a very long time and many encounters before they're willing to open up. Rejection doesn't mean failure — continue being friends, continue praying. You may be just one link in their faith journey, but every link matters. Remember Paul's words: 'I planted the seed, Apollos watered it, but God has been making it grow.'",
    "bible_verses": [
      "1 Peter 3:15",
      "Matthew 5:16",
      "1 Corinthians 3:6",
      "Colossians 4:5-6"
    ],
    "discussion_questions": [
      "你觉得向同学传福音最大的障碍是什么？What do you think is the biggest obstacle to evangelizing classmates?",
      "分享见证和争论教义有什么区别？What's the difference between sharing testimony and arguing doctrine?",
      "如何在不伤害友谊的前提下分享信仰？How do you share faith without damaging friendships?"
    ],
    "tags": [
      "evangelism",
      "testimony",
      "friendship-evangelism"
    ]
  },
  {
    "id": "youth-056",
    "section": "campus",
    "category": "校园生活",
    "title_zh": "时间管理：在忙碌中亲近上帝",
    "title_en": "Time Management: Drawing Near to God When Busy",
    "content_zh": "青少年的生活真的很忙：学校课程、作业、考试复习、课外活动、社交聚会、家庭责任……日程表总是满满的。在这种忙碌中，与上帝的关系很容易被挤到最后面，甚至被完全忽略。但忙碌不应该成为远离上帝的借口，恰恰相反，越忙的时候越需要从上帝那里支取力量和智慧。\n\n首先，要明确优先次序。耶稣说「你们要先求祂的国和祂的义，这些东西都要加给你们了」。上帝应该排在第一位，但这不意味着每天必须花两个小时读经祷告才算合格。质量比数量更重要。每天即使只有十五分钟安安静静地与上帝独处——读几节经文、安静祷告、默想上帝的话——效果也比一周只做一次长时间的灵修好得多。关键是养成每天亲近上帝的习惯，而不是等到有大块空闲时间。\n\n其次，学会利用碎片时间。走路上学的时候可以听赞美诗或圣经朗读，等公交车或排队的时候可以默想一节经文，睡前花三分钟做感恩祷告回顾这一天上帝的恩典。吃饭前安静几秒钟感谢上帝的供应。这些小小的操练加在一起，能让你全天都保持与上帝的连接。\n\n第三，计划安息时间。即使再忙，也要刻意安排定期休息和敬拜的时间。上帝设立安息日不是为了限制我们的自由，而是因为祂知道我们需要休息。不停地忙碌最终只会导致身心疲惫和灵性枯竭。安息不是浪费时间，而是对上帝的信任：我相信即使我停下来休息，上帝仍然掌管一切。\n\n第四，在学习中也可以亲近上帝。做作业之前花几秒钟祷告求智慧，考试前求上帝赐你平安的心，学习自然科学时思想上帝创造的奇妙。上帝不只在教堂里，祂在你生活的每一个角落。\n\n第五，和其他基督徒同学一起学习、互相鼓励。可以组建学习小组，学习间歇分享代祷事项，互相提醒属灵操练。压力不需要一个人扛，同伴的支持是上帝给我们宝贵的礼物。\n\n记住，上帝不是要跟你的学业竞争时间。祂是赐给你时间的那一位，祂会帮助你智慧地使用每一天。「你们要休息，要知道我是上帝。」在忙碌中学会安静，在安静中遇见上帝。",
    "content_en": "Teenage life is genuinely busy: school classes, homework, exam prep, extracurriculars, social gatherings, family responsibilities... the schedule is always packed. Amidst this busyness, relationship with God easily gets pushed to last place or completely neglected. But busyness shouldn't be an excuse for distancing from God — on the contrary, busier times require drawing strength and wisdom from Him even more.\n\nFirst, clarify priorities. Jesus said 'Seek first his kingdom and his righteousness, and all these things will be given to you as well.' God should be first, but this doesn't mean spending two hours daily in Bible study and prayer to qualify. Quality matters more than quantity. Even just fifteen minutes of quiet time with God daily — reading a few verses, quiet prayer, meditating on God's word — is far better than one lengthy devotion per week. The key is building a daily habit of drawing near to God rather than waiting for large blocks of free time.\n\nSecond, learn to use fragments of time. Listen to worship music or Bible audio while walking to school, meditate on a verse while waiting for the bus or in line, spend three minutes before bed in thanksgiving prayer reviewing the day's grace. Pause a few seconds before meals to thank God for provision. These small practices combined keep you connected with God throughout the day.\n\nThird, plan rest time. Even at your busiest, intentionally schedule regular rest and worship. God established the Sabbath not to restrict our freedom but because He knows we need rest. Nonstop busyness ultimately only leads to physical, mental, and spiritual exhaustion. Rest isn't wasting time but trusting God: I believe that even when I stop to rest, God remains in control.\n\nFourth, draw near to God even in studies. Pray briefly for wisdom before homework, ask God for peace before exams, contemplate God's amazing creation when studying natural sciences. God isn't only in church — He's in every corner of your life.\n\nFifth, study with other Christian classmates and encourage each other. Form study groups, share prayer requests during breaks, remind each other about spiritual disciplines. Pressure doesn't need to be carried alone — companionship is God's precious gift to us.\n\nRemember, God isn't competing with your studies for time. He's the One who gave you time, and He'll help you use each day wisely. 'Be still, and know that I am God.' Learn stillness amidst busyness, and meet God in the stillness.",
    "bible_verses": [
      "Psalm 46:10",
      "Matthew 6:33",
      "Ecclesiastes 3:1",
      "Mark 6:31"
    ],
    "discussion_questions": [
      "忙碌时你如何保持与上帝的关系？How do you maintain relationship with God when busy?",
      "什么活动经常挤占你的灵修时间？What activities often crowd out your devotional time?",
      "如何在学习中经历上帝的同在？How do you experience God's presence while studying?"
    ],
    "tags": [
      "time-management",
      "devotion",
      "priorities"
    ]
  },
  {
    "id": "youth-058",
    "section": "campus",
    "category": "校园生活",
    "title_zh": "毕业方向：寻求上帝的引导",
    "title_en": "Graduation Direction: Seeking God's Guidance",
    "content_zh": "选专业、选学校、选职业方向是人生中的重大决定，会深刻影响未来很多年。面对这些选择时感到迷茫和压力是很正常的，但作为基督徒，你有一个特殊的优势：你可以寻求那位创造你、了解你、爱你的上帝的引导。\n\n首先，祷告求智慧，但同时也要积极行动。上帝通常不会在你坐着不动的时候突然给你一张完整的人生蓝图。祂更多的是在你一步一步走路的过程中引导你的方向，就像车灯照亮前方的路——不是一次照亮全部，而是随着你前进不断显明下一段。所以，不要等待一个超自然的声音从天上说话，而是在祷告中开始行动。\n\n其次，花时间了解自己。上帝给每个人不同的恩赐、兴趣、性格和热情。你做什么事情的时候最有活力？你关心什么样的问题？你的天赋在哪里？这些线索帮助你找到最符合上帝对你独特设计的道路。不要盲目跟随别人的期待或社会的热门趋势，上帝造你不是为了让你成为别人的复制品。\n\n第三，寻求智慧人的建议。「不先商议，所谋无效；谋士众多，所谋乃成。」跟你的父母谈谈他们的看法，他们对你的了解比你想象的深。请教经验丰富的老师和牧师，听听学长学姐的经历。不要关起门来自己做决定，智慧往往来自多方面的声音。\n\n第四，考虑你的选择如何服侍上帝和他人。不是只有当传道人或宣教士才是服侍上帝。一个诚实的商人、一个有爱心的医生、一个公正的律师、一个负责任的工程师，都可以在自己的岗位上荣耀上帝、祝福他人。问问自己：我怎样在这个领域用上帝给我的才能来造福社会、彰显基督的爱？\n\n第五，注意内心的平安。上帝的引导通常伴随着一种深层的平安感，即使前面的道路充满不确定和挑战。如果一个选择让你持续焦虑不安，值得停下来再好好祷告思考。\n\n第六，保持开放的心态。你的计划可能会改变，这完全没问题。上帝的道路高过我们的道路，祂的意念高过我们的意念。很多人最终从事的工作跟大学专业完全不同，上帝会使用你所有的经历来塑造你。不要害怕走弯路，因为在上帝手中，没有一段经历是浪费的。祂能化一切为美好，引导你走向祂为你预备的丰盛人生。",
    "content_en": "Choosing majors, schools, and career paths are major life decisions that deeply affect many years ahead. Feeling confused and pressured when facing these choices is perfectly normal, but as a Christian, you have a special advantage: you can seek guidance from the God who created you, knows you, and loves you.\n\nFirst, pray for wisdom while also taking active steps. God usually doesn't give you a complete life blueprint while you sit still. He more often guides your direction as you walk step by step — like headlights illuminating the road ahead, not revealing everything at once but progressively showing the next stretch as you advance. So don't wait for a supernatural voice from heaven; begin acting while praying.\n\nSecond, take time to understand yourself. God gave everyone different gifts, interests, personality, and passions. What energizes you most? What issues do you care about? Where are your natural strengths? These clues help you find the path that best fits God's unique design for you. Don't blindly follow others' expectations or society's trending fields — God made you not to be someone else's copy.\n\nThird, seek advice from wise people. 'Plans fail for lack of counsel, but with many advisers they succeed.' Talk with your parents about their perspective — they understand you more deeply than you realize. Consult experienced teachers and pastors, listen to older students' experiences. Don't make decisions behind closed doors; wisdom often comes from multiple voices.\n\nFourth, consider how your choice serves God and others. Being a pastor or missionary isn't the only way to serve God. An honest businessperson, a compassionate doctor, a just lawyer, a responsible engineer — all can glorify God and bless others in their positions. Ask yourself: how can I use God-given talents in this field to benefit society and demonstrate Christ's love?\n\nFifth, pay attention to inner peace. God's guidance usually comes with deep peace, even when the path ahead is uncertain and challenging. If a choice brings persistent anxiety and unease, it's worth pausing to pray and reflect further.\n\nSixth, maintain an open mindset. Your plans might change, and that's completely fine. God's ways are higher than our ways, His thoughts higher than our thoughts. Many people end up in careers completely different from their college major — God uses all your experiences to shape you. Don't fear detours, because in God's hands, no experience is wasted. He can turn everything to good, guiding you toward the abundant life He has prepared for you.",
    "bible_verses": [