[
  {
    "id": "q001",
    "category": "existence_of_god",
    "question_zh": "如果看不见上帝，怎么能相信祂存在？",
    "question_en": "How can you believe in a God you can't see?",
    "short_answer_zh": "我们相信很多看不见的事物——引力、爱、理性。上帝虽然不可见，但祂通过创造、良心和历史彰显自己。",
    "short_answer_en": "We believe in many things we can't see — gravity, love, reason. Though God is invisible, He reveals Himself through creation, conscience, and history.",
    "detailed_answer_zh": "这个问题假设只有可见的事物才是真实的，但这种假设本身就有问题。我们生活中最重要的事物——逻辑规律、道德标准、数学真理、爱——都是看不见的，但我们从不质疑它们的真实性。\n\n圣经告诉我们，上帝的永能和神性从所造之物就可以看见（罗马书1:20）。宇宙的精密设计、人类固有的道德直觉、历史中的启示，都指向一位超越的创造者。\n\n更重要的是，基督教的上帝不是一个抽象概念，而是在历史中行动的位格。祂在耶稣基督里变得可见，道成了肉身，住在我们中间。",
    "detailed_answer_en": "This question assumes that only visible things are real, but that assumption is itself problematic. The most important realities in our lives — laws of logic, moral standards, mathematical truths, love — are all invisible, yet we never question their reality.\n\nThe Bible tells us that God's eternal power and divine nature have been clearly perceived through what has been made (Romans 1:20). The fine-tuning of the universe, humanity's innate moral intuitions, and revelation in history all point to a transcendent Creator.\n\nMore importantly, the Christian God is not an abstract concept but a person who acts in history. He became visible in Jesus Christ — the Word became flesh and dwelt among us.",
    "bible_verses": ["Romans 1:20", "Psalm 19:1-2", "Hebrews 11:1", "John 1:14", "Colossians 1:15"],
    "related_readings": ["Mere Christianity Ch.1-2 (C.S. Lewis)", "Defending Your Faith Ch.3 (R.C. Sproul)", "The Reason for God Ch.8 (Tim Keller)"],
    "tags": ["apologetics", "atheism", "beginner"]
  },
  {
    "id": "q002",
    "category": "existence_of_god",
    "question_zh": "宇宙为什么存在？难道不可能是自然发生的吗？",
    "question_en": "Why does the universe exist? Couldn't it have just happened naturally?",
    "short_answer_zh": "宇宙有一个开始（大爆炸），而一切有开始的事物都有原因。这个终极原因必须是超越时间和空间的——这正是我们所说的上帝。",
    "short_answer_en": "The universe had a beginning (Big Bang), and everything that begins to exist has a cause. This ultimate cause must be beyond time and space — which is what we call God.",
    "detailed_answer_zh": "宇宙论论证（Kalam论证）可以这样表述：\n1. 凡是有开始的事物，都有一个原因。\n2. 宇宙有一个开始。\n3. 因此，宇宙有一个原因。\n\n现代科学（大爆炸理论、宇宙膨胀、热力学第二定律）都表明宇宙有一个起点。如果宇宙有起点，那么导致宇宙存在的原因必须是超越物质、时间和空间的。这个原因必须极其强大，并且具有意志（因为它选择了创造）。这些属性正是有神论者所说的上帝。\n\n说「宇宙是自然发生的」其实是说「无中生有」，这不是科学解释，而是回避问题。",
    "detailed_answer_en": "The Cosmological Argument (Kalam) can be stated:\n1. Everything that begins to exist has a cause.\n2. The universe began to exist.\n3. Therefore, the universe has a cause.\n\nModern science (Big Bang theory, cosmic expansion, second law of thermodynamics) all indicate the universe had a beginning. If so, the cause must be beyond matter, time, and space. This cause must be immensely powerful and possess will (since it chose to create). These attributes match what theists call God.\n\nSaying 'the universe just happened naturally' is essentially saying 'something came from nothing' — that's not a scientific explanation but an evasion.",
    "bible_verses": ["Genesis 1:1", "Hebrews 11:3", "Psalm 33:6", "Romans 1:20"],
    "related_readings": ["Kalam Cosmological Argument (William Lane Craig)", "Defending Your Faith Ch.5 (R.C. Sproul)"],
    "tags": ["apologetics", "cosmological", "intermediate"]
  },
  {
    "id": "q003",
    "category": "existence_of_god",
    "question_zh": "科学已经解释了一切，还需要上帝吗？",
    "question_en": "Science has explained everything. Do we still need God?",
    "short_answer_zh": "科学解释「怎样」，但不能回答「为什么」。科学告诉我们水的分子结构，但不能告诉我们为什么存在水、存在万物。",
    "short_answer_en": "Science explains 'how' but cannot answer 'why.' Science tells us the molecular structure of water, but not why water — or anything — exists at all.",
    "detailed_answer_zh": "这个问题混淆了两类不同的问题。科学研究自然界的运作规律（机制），但「万物为什么存在」「什么赋予生命意义」「道德的基础是什么」这些问题超出了科学的范畴。\n\n事实上，科学本身依赖于一些无法用科学证明的前提：自然界的规律性、人类理性的可靠性、数学与物质世界的对应。基督教世界观恰恰为这些前提提供了最好的解释——一位理性的上帝创造了有规律的宇宙和能认识这个宇宙的人类心智。\n\n许多最伟大的科学家——牛顿、法拉第、麦克斯韦、普朗克——都是虔诚的基督徒，他们不认为科学与信仰矛盾。",
    "detailed_answer_en": "This question confuses two types of inquiry. Science studies how the natural world operates (mechanisms), but questions like 'why does anything exist,' 'what gives life meaning,' and 'what is the foundation of morality' are beyond the scope of science.\n\nIn fact, science itself depends on presuppositions it cannot prove: the regularity of nature, the reliability of human reason, and the correspondence of mathematics to the physical world. The Christian worldview provides the best explanation for these presuppositions — a rational God created an orderly universe and human minds capable of understanding it.\n\nMany of the greatest scientists — Newton, Faraday, Maxwell, Planck — were devout Christians who saw no conflict between science and faith.",
    "bible_verses": ["Proverbs 25:2", "Psalm 111:2", "Colossians 1:17"],
    "related_readings": ["The Reason for God Ch.6 (Tim Keller)", "Science and Faith (John Lennox)"],
    "tags": ["science", "apologetics", "beginner"]
  },
  {
    "id": "q004",
    "category": "problem_of_evil",
    "question_zh": "如果上帝是全善全能的，为什么世界上有这么多苦难？",
    "question_en": "If God is all-good and all-powerful, why is there so much suffering?",
    "short_answer_zh": "苦难的存在不能证明上帝不存在；相反，我们对苦难的愤怒恰恰指向一个公义的上帝。上帝允许苦难有祂的目的，并且祂亲自进入苦难来救赎我们。",
    "short_answer_en": "The existence of suffering doesn't disprove God; rather, our outrage at suffering points to a just God. God permits suffering for His purposes, and He Himself entered into suffering to redeem us.",
    "detailed_answer_zh": "这可能是人们最常提出的反对信仰的理由。但仔细思考，这个论证其实预设了上帝的存在：\n\n如果没有上帝，就没有客观的善恶标准。如果没有善恶标准，你就不能说苦难是「恶的」。如果苦难只是自然现象而非「恶」，那就没有什么问题需要解决。正是因为我们直觉地知道苦难是「不应该」的，这恰恰暗示存在一个「应该」的标准——而这个标准指向上帝。\n\n圣经从不回避苦难的问题，但它提供了独特的回应：上帝不是远远地旁观我们的痛苦，而是在耶稣基督里亲自进入最深的苦难——十字架。上帝不只是解释苦难，祂进入了苦难。",
    "detailed_answer_en": "This may be the most common objection to faith. But upon reflection, this argument actually presupposes God's existence:\n\nWithout God, there is no objective standard of good and evil. Without such a standard, you cannot call suffering 'evil.' If suffering is merely a natural phenomenon rather than 'evil,' there's no problem to solve. The fact that we intuitively know suffering 'shouldn't be' implies a standard of how things 'should be' — and that standard points to God.\n\nThe Bible never avoids the problem of suffering, but offers a unique response: God is not watching our pain from afar. In Jesus Christ, He entered into the deepest suffering — the cross. God doesn't just explain suffering; He entered it.",
    "bible_verses": ["Romans 8:28", "2 Corinthians 4:17", "John 16:33", "Isaiah 53:3-5"],
    "related_readings": ["The Problem of Pain (C.S. Lewis)", "Walking with God through Pain and Suffering (Tim Keller)"],
    "tags": ["suffering", "apologetics", "beginner"]
  },
  {
    "id": "q005",
    "category": "problem_of_evil",
    "question_zh": "为什么上帝不阻止自然灾害和疾病？",
    "question_en": "Why doesn't God stop natural disasters and disease?",
    "short_answer_zh": "自然界的苦难是堕落世界的结果。上帝并非对苦难漠不关心，而是在护理中使用这些事成就更大的善，并应许将来彻底更新万有。",
    "short_answer_en": "Natural suffering is a consequence of a fallen world. God is not indifferent to suffering but in His providence uses these things for greater good, and promises to ultimately renew all things.",
    "detailed_answer_zh": "圣经教导我们，整个受造界都因人类的堕落而受到影响（罗马书8:20-22）。自然灾害和疾病是一个被罪扭曲的世界的一部分，而不是上帝原初创造的设计。\n\n我们需要谦卑地承认，我们有限的视角不可能完全理解无限上帝的目的。约伯的经历告诉我们，上帝并没有总是解释苦难的原因，但祂邀请我们信靠祂的品格。\n\n基督教的盼望不是「苦难不会发生」，而是「苦难不是最终的」。上帝应许祂将擦去一切的眼泪，不再有死亡、悲哀、哭号、疼痛（启示录21:4）。",
    "detailed_answer_en": "Scripture teaches that all creation has been affected by humanity's fall (Romans 8:20-22). Natural disasters and disease are part of a sin-distorted world, not God's original design.\n\nWe must humbly acknowledge that our finite perspective cannot fully grasp an infinite God's purposes. Job's experience teaches us that God doesn't always explain the reasons for suffering, but He invites us to trust His character.\n\nThe Christian hope is not that suffering won't happen, but that suffering is not final. God promises He will wipe away every tear, and there will be no more death, mourning, crying, or pain (Revelation 21:4).",
    "bible_verses": ["Romans 8:20-22", "Job 38:1-4", "Revelation 21:4", "Romans 8:18"],
    "related_readings": ["The Problem of Pain Ch.2 (C.S. Lewis)", "Trusting God (Jerry Bridges)"],
    "tags": ["suffering", "natural_evil", "intermediate"]
  },
  {
    "id": "q006",
    "category": "bible_reliability",
    "question_zh": "圣经不是人写的吗？怎么能说它是上帝的话？",
    "question_en": "The Bible was written by humans. How can you say it's God's Word?",
    "short_answer_zh": "圣经是上帝通过人类作者写成的。正如上帝使用人来完成祂的工作，祂也使用人来记录祂的启示，同时保守他们不出错。",
    "short_answer_en": "The Bible was written by God through human authors. Just as God uses humans to accomplish His work, He used humans to record His revelation while preserving them from error.",
    "detailed_answer_zh": "圣经的双重作者性（神圣与人类）是基督教的核心教义。正如耶稣基督是完全的神也是完全的人，圣经也是完全上帝的话，同时也是完全人类的作品。\n\n上帝并没有机械地口述每一个字，而是通过圣灵默示（God-breathed），使用每位作者的个性、文化背景和写作风格，同时保守他们所写的完全准确可靠。\n\n考古学不断证实圣经的历史准确性。死海古卷的发现证明旧约文本经过上千年的传抄保持了惊人的一致性。新约的手抄本数量远超任何古代文献，使我们有充分理由信任文本的可靠性。",
    "detailed_answer_en": "The dual authorship of Scripture (divine and human) is a core Christian doctrine. Just as Jesus Christ is fully God and fully man, Scripture is fully God's Word while also being fully human writing.\n\nGod did not mechanically dictate every word, but through inspiration (God-breathed), used each author's personality, cultural background, and writing style while ensuring what they wrote was completely accurate and reliable.\n\nArchaeology continually confirms the Bible's historical accuracy. The Dead Sea Scrolls demonstrate that Old Testament texts maintained remarkable consistency over thousands of years of copying. The number of New Testament manuscripts far exceeds any other ancient document, giving us strong reason to trust textual reliability.",
    "bible_verses": ["2 Timothy 3:16", "2 Peter 1:21", "Psalm 19:7-9", "Matthew 5:18"],
    "related_readings": ["Can We Trust the Gospels? (Peter Williams)", "The New Testament Documents (F.F. Bruce)"],
    "tags": ["bible", "reliability", "beginner"]
  },
  {
    "id": "q007",
    "category": "bible_reliability",
    "question_zh": "圣经中不是有很多矛盾吗？",
    "question_en": "Doesn't the Bible contain many contradictions?",
    "short_answer_zh": "所谓的「矛盾」大多是对文体、语境或翻译的误解。仔细研究后，这些问题都有合理的解释。",
    "short_answer_en": "Most alleged 'contradictions' stem from misunderstandings of genre, context, or translation. Upon careful study, these issues have reasonable explanations.",
    "detailed_answer_zh": "许多所谓的矛盾来自于以现代标准衡量古代文体。圣经包含多种文体——叙事、诗歌、预言、书信——每种文体有不同的表达方式。\n\n例如，四福音书对同一事件的记载有差异，但这恰恰证明了它们是独立的目击证词，而非串通编造。差异在细节上，核心事实完全一致。就像四个目击证人对一起事件的描述会有不同角度，但这增强而非削弱了证词的可信度。\n\n经过两千年的批评性研究，没有发现任何真正的矛盾足以推翻圣经的可信度。",
    "detailed_answer_en": "Many alleged contradictions arise from applying modern standards to ancient literary genres. The Bible contains multiple genres — narrative, poetry, prophecy, epistles — each with different modes of expression.\n\nFor example, the four Gospels' varying accounts of the same events actually prove they are independent eyewitness testimonies, not a coordinated fabrication. Differences are in details while core facts are completely consistent. Like four eyewitnesses describing the same event from different angles, this strengthens rather than weakens credibility.\n\nAfter two thousand years of critical study, no genuine contradiction has been found sufficient to undermine the Bible's trustworthiness.",
    "bible_verses": ["John 10:35", "Psalm 119:160", "Proverbs 30:5"],
    "related_readings": ["Encyclopedia of Bible Difficulties (Gleason Archer)", "Is God a Moral Monster? (Paul Copan)"],
    "tags": ["bible", "contradictions", "intermediate"]
  },
  {
    "id": "q008",
    "category": "science_and_faith",
    "question_zh": "进化论不是已经否定了创造论吗？",
    "question_en": "Doesn't evolution disprove creation?",
    "short_answer_zh": "进化论描述的是生物变化的机制，并不能否定上帝作为创造者。很多杰出科学家是基督徒，相信上帝通过自然过程来创造和维持生命。",
    "short_answer_en": "Evolution describes mechanisms of biological change but cannot disprove God as Creator. Many outstanding scientists are Christians who believe God creates and sustains life through natural processes.",
    "detailed_answer_zh": "首先，我们需要区分「微观进化」（物种内的变异和适应）和「宏观进化」（一个物种变成另一个完全不同的物种）。微观进化是公认的事实，但宏观进化仍有许多未解的科学问题。\n\n更重要的是，即使生物进化是事实，它也不能回答根本问题：为什么存在生命？为什么自然律存在？为什么宇宙的参数恰好允许生命存在？\n\n许多基督徒科学家持有不同观点——从年轻地球创造论到神导进化论——但他们都同意：无论上帝使用什么过程，祂是万物的最终创造者和维持者。科学与信仰不是非此即彼的选择。",
    "detailed_answer_en": "First, we must distinguish between microevolution (variation and adaptation within species) and macroevolution (one species becoming an entirely different one). Microevolution is established fact, but macroevolution still has many unresolved scientific questions.\n\nMore importantly, even if biological evolution is true, it cannot answer the fundamental questions: Why does life exist? Why do natural laws exist? Why are the universe's parameters precisely tuned to permit life?\n\nChristian scientists hold various views — from young earth creationism to theistic evolution — but all agree: whatever processes God used, He is the ultimate Creator and Sustainer. Science and faith are not an either/or choice.",
    "bible_verses": ["Genesis 1:1", "Psalm 104:24-30", "Colossians 1:16-17"],
    "related_readings": ["Science and Faith (John Lennox)", "The Language of God (Francis Collins)"],
    "tags": ["science", "evolution", "intermediate"]
  },
  {
    "id": "q009",
    "category": "science_and_faith",
    "question_zh": "信仰不就是一种迷信吗？理性的人不需要信仰。",
    "question_en": "Isn't faith just superstition? Rational people don't need faith.",
    "short_answer_zh": "基督教信仰不是盲目的迷信，而是基于证据的理性信靠。事实上，每个人都靠「信仰」生活——你信靠理性本身就是一种信仰。",
    "short_answer_en": "Christian faith is not blind superstition but rational trust based on evidence. In fact, everyone lives by faith — your trust in reason itself is a form of faith.",
    "detailed_answer_zh": "圣经中的「信仰」（pistis）不是「不顾证据相信」，而是「基于证据的信靠」。希伯来书11:1说信仰是「所望之事的实底，未见之事的确据」——这是一种有根据的确信。\n\n讽刺的是，声称「只相信理性」的人其实在做一个信仰声明——因为你不能用理性来证明「只有理性才是获取真理的唯一途径」，这是一个循环论证。理性主义本身依赖于无法用理性证明的前提。\n\n基督教信仰有丰富的理性基础：宇宙的起源、生命的设计、道德的客观性、耶稣的历史证据、教会的持续存在——这些都指向信仰的合理性。",
    "detailed_answer_en": "Biblical 'faith' (pistis) is not 'believing despite evidence' but 'trust based on evidence.' Hebrews 11:1 says faith is 'the substance of things hoped for, the evidence of things not seen' — it's a well-grounded conviction.\n\nIronically, claiming to 'only believe in reason' is itself a faith statement — you cannot use reason to prove 'reason is the only path to truth.' That's circular reasoning. Rationalism itself depends on presuppositions that cannot be rationally proven.\n\nChristian faith has rich rational foundations: the origin of the universe, the design of life, the objectivity of morality, the historical evidence for Jesus, the endurance of the Church — all point to the reasonableness of faith.",
    "bible_verses": ["Hebrews 11:1", "1 Peter 3:15", "Isaiah 1:18", "Acts 17:2"],
    "related_readings": ["Mere Christianity Book 3 (C.S. Lewis)", "Defending Your Faith Ch.1 (R.C. Sproul)"],
    "tags": ["faith", "reason", "beginner"]
  },
  {
    "id": "q010",
    "category": "uniqueness_of_jesus",
    "question_zh": "耶稣和其他宗教领袖有什么不同？",
    "question_en": "What makes Jesus different from other religious leaders?",
    "short_answer_zh": "耶稣不仅是道德教师，祂宣称自己是上帝。祂的复活从死里证明了这一宣称。没有其他宗教领袖做过类似的宣称并有证据支持。",
    "short_answer_en": "Jesus was not merely a moral teacher — He claimed to be God. His resurrection from the dead vindicated that claim. No other religious leader made such claims with supporting evidence.",
    "detailed_answer_zh": "C.S.路易斯著名的「三难推理」指出：耶稣宣称自己是上帝，那么祂要么是骗子（知道自己不是但故意欺骗）、要么是疯子（真以为自己是上帝但其实不是）、要么确实是主。\n\n耶稣的道德教导之高尚排除了祂是骗子的可能；祂的智慧和冷静排除了祂是疯子的可能。最有力的证据是复活：空坟墓、数百人见证复活的基督、门徒们为此殉道的事实。\n\n其他宗教领袖教导通往上帝的道路，但耶稣说「我就是道路、真理、生命」。其他人指向真理，耶稣说祂就是真理。这使祂截然不同。",
    "detailed_answer_en": "C.S. Lewis's famous 'trilemma' states: Jesus claimed to be God, so He was either a liar (knew He wasn't but deliberately deceived), a lunatic (genuinely believed He was God but wasn't), or truly Lord.\n\nThe moral sublimity of Jesus's teachings rules out liar; His wisdom and composure rule out lunatic. The most powerful evidence is the resurrection: the empty tomb, hundreds of witnesses to the risen Christ, and the disciples' willingness to die for this claim.\n\nOther religious leaders taught the way to God, but Jesus said 'I am the way, the truth, and the life.' Others pointed to truth; Jesus said He is truth. This makes Him categorically different.",
    "bible_verses": ["John 14:6", "John 10:30", "Matthew 28:6", "1 Corinthians 15:3-8"],
    "related_readings": ["Mere Christianity Book 2, Ch.3 (C.S. Lewis)", "The Case for Christ (Lee Strobel)"],
    "tags": ["jesus", "christology", "beginner"]
  },
  {
    "id": "q011",
    "category": "uniqueness_of_jesus",
    "question_zh": "耶稣真的从死里复活了吗？有什么证据？",
    "question_en": "Did Jesus really rise from the dead? What's the evidence?",
    "short_answer_zh": "历史证据极其有力：空坟墓、数百位目击证人、门徒的彻底转变、以及基督教在逼迫中的爆发式增长，都指向复活的真实性。",
    "short_answer_en": "The historical evidence is compelling: the empty tomb, hundreds of eyewitnesses, the radical transformation of the disciples, and the explosive growth of Christianity under persecution all point to the reality of the resurrection.",
    "detailed_answer_zh": "即使是怀疑派学者也承认几个基本历史事实：\n\n1. 耶稣在十字架上死了（罗马行刑非常彻底）\n2. 第三天坟墓是空的（否则反对者只需展示尸体即可终结基督教）\n3. 众多人声称见到了复活的基督（保罗列出超过500位目击者）\n4. 门徒的生命发生了彻底改变（从恐惧逃散到勇敢殉道）\n\n各种自然主义解释（偷尸体、昏迷、幻觉）都不能令人信服地解释所有这些事实。最好的解释就是：耶稣真的复活了。正如保罗所说，如果基督没有复活，我们的信仰就是枉然的（林前15:17）。但基督确实复活了。",
    "detailed_answer_en": "Even skeptical scholars acknowledge several basic historical facts:\n\n1. Jesus died on the cross (Roman execution was thorough)\n2. The tomb was empty on the third day (opponents only needed to produce the body to end Christianity)\n3. Many people claimed to see the risen Christ (Paul lists over 500 witnesses)\n4. The disciples' lives were radically transformed (from fearful fugitives to bold martyrs)\n\nVarious naturalistic explanations (stolen body, swoon theory, hallucinations) cannot convincingly account for all these facts together. The best explanation is simply: Jesus truly rose. As Paul said, if Christ has not been raised, our faith is in vain (1 Cor 15:17). But Christ has indeed been raised.",
    "bible_verses": ["1 Corinthians 15:3-8", "1 Corinthians 15:17", "Matthew 28:1-10", "Acts 1:3"],
    "related_readings": ["The Case for Christ Ch.5 (Lee Strobel)", "The Resurrection of the Son of God (N.T. Wright)"],
    "tags": ["resurrection", "evidence", "beginner"]
  },
  {
    "id": "q012",
    "category": "sin_and_salvation",
    "question_zh": "我是好人，为什么还需要耶稣？",
    "question_en": "I'm a good person. Why do I need Jesus?",
    "short_answer_zh": "问题不在于你和别人比较如何，而在于你和上帝的标准比较如何。上帝的标准是完美——没有人能靠自己达到。这就是为什么我们需要恩典。",
    "short_answer_en": "The question isn't how you compare to others, but how you compare to God's standard. God's standard is perfection — no one can achieve it on their own. That's why we need grace.",
    "detailed_answer_zh": "当人说「我是好人」时，通常是和别人比较。但圣经的标准不是「比多数人好」，而是上帝的完美圣洁。耶稣说，甚至心里恨人就等于杀人，心里动淫念就等于犯奸淫（太5:21-28）。按这个标准，没有人是「好人」。\n\n这不是要让人绝望，而是要让人认识到：我们需要的不是更努力，而是一位救主。好消息是，上帝不是要求我们先变好才接纳我们，而是在我们还是罪人的时候就为我们死了（罗5:8）。\n\n救恩不是我们赚来的工资，而是上帝白白赐给的礼物。我们只需要承认自己的需要，接受这份恩典。",
    "detailed_answer_en": "When people say 'I'm a good person,' they usually compare themselves to others. But the biblical standard isn't 'better than most' — it's God's perfect holiness. Jesus said even hating someone is equivalent to murder, and lustful thoughts are equivalent to adultery (Matt 5:21-28). By this standard, no one is 'good.'\n\nThis isn't meant to bring despair but recognition: we don't need to try harder — we need a Savior. The good news is that God doesn't require us to become good first; He died for us while we were still sinners (Rom 5:8).\n\nSalvation isn't wages we earn but a gift God gives freely. We need only acknowledge our need and receive this grace.",
    "bible_verses": ["Romans 3:23", "Romans 5:8", "Ephesians 2:8-9", "Isaiah 64:6", "Matthew 5:48"],
    "related_readings": ["The Reason for God Ch.10 (Tim Keller)", "The Holiness of God Ch.4 (R.C. Sproul)"],
    "tags": ["salvation", "sin", "beginner"]
  },
  {
    "id": "q013",
    "category": "sin_and_salvation",
    "question_zh": "什么是罪？我又没杀人放火。",
    "question_en": "What is sin? I've never killed anyone or committed a crime.",
    "short_answer_zh": "罪不仅是外在的行为，更是内在的态度——以自我为中心、脱离上帝而活。罪的本质是拒绝让上帝做上帝，自己做自己的主宰。",
    "short_answer_en": "Sin is not just external actions but an internal attitude — living self-centeredly, apart from God. The essence of sin is refusing to let God be God and making yourself your own lord.",
    "detailed_answer_zh": "威斯敏斯特小要理问答说：罪是不遵行或违反上帝律法的任何思想、言语或行为。罪不仅是你做了什么坏事，也包括你应该做而没有做的好事。\n\n但在更深的层面，罪是一种关系的破裂。上帝创造我们是为了与祂相交，但我们选择了自己做自己的神——自己决定什么是对错，自己赋予生命意义，自己掌控一切。这种自我中心就是罪的核心。\n\n这就是为什么「好人」也需要救恩——不是因为你犯了多少错，而是因为你的整个生命方向可能都偏离了被造的目的。就像一支箭，无论它多漂亮，如果没有射中靶心，就是偏离了。",
    "detailed_answer_en": "The Westminster Shorter Catechism states: sin is any want of conformity unto, or transgression of, the law of God. Sin includes not only bad things you've done but good things you should have done but didn't.\n\nAt a deeper level, sin is a broken relationship. God created us for fellowship with Him, but we chose to be our own gods — deciding right from wrong, assigning meaning to life, controlling everything ourselves. This self-centeredness is the core of sin.\n\nThis is why 'good people' also need salvation — not because of how many mistakes you've made, but because your entire life direction may be off course from its created purpose. Like an arrow — no matter how beautiful, if it misses the target, it's off the mark.",
    "bible_verses": ["Romans 3:23", "1 John 3:4", "James 4:17", "Isaiah 53:6", "Genesis 3:5"],
    "related_readings": ["The Holiness of God Ch.6 (R.C. Sproul)", "Mere Christianity Book 1 (C.S. Lewis)"],
    "tags": ["sin", "theology", "beginner"]
  },
  {
    "id": "q014",
    "category": "sin_and_salvation",
    "question_zh": "为什么上帝不能直接赦免罪，非要耶稣死在十字架上？",
    "question_en": "Why can't God just forgive sin directly? Why did Jesus have to die on the cross?",
    "short_answer_zh": "因为上帝既是慈爱的，也是公义的。公义要求罪必须被审判，慈爱要求罪人被拯救。十字架是上帝的公义和慈爱完美交汇的地方。",
    "short_answer_en": "Because God is both loving and just. Justice demands sin be judged; love demands sinners be saved. The cross is where God's justice and love perfectly meet.",
    "detailed_answer_zh": "如果一个法官因为他喜欢被告就直接放过他，我们不会说这个法官是好的——我们会说他腐败。同样，如果上帝无视罪，祂就不再是公义的。\n\n上帝面临的不是一个简单的选择。祂的本性要求罪必须被审判（公义），同时祂渴望拯救罪人（慈爱）。十字架是唯一同时满足两者的方式：耶稣——无罪的上帝之子——代替我们承受了公义的审判，使得上帝的慈爱可以合法地临到我们。\n\n这不是一个愤怒的父亲惩罚无辜的儿子。三位一体的上帝——父、子、圣灵——共同决定了这个救赎计划。耶稣甘心情愿地献上自己：「没有人夺我的命去，是我自己舍的」（约10:18）。",
    "detailed_answer_en": "If a judge let a defendant go free simply because he liked him, we wouldn't call that judge good — we'd call him corrupt. Similarly, if God overlooked sin, He would no longer be just.\n\nGod didn't face a simple choice. His nature demands sin be judged (justice) while He desires to save sinners (love). The cross is the only way to satisfy both: Jesus — the sinless Son of God — took upon Himself the judgment we deserved, so God's love could legitimately reach us.\n\nThis isn't an angry Father punishing an innocent Son. The Triune God — Father, Son, and Spirit — together ordained this plan of redemption. Jesus gave Himself willingly: 'No one takes my life from me; I lay it down of my own accord' (John 10:18).",
    "bible_verses": ["Romans 3:25-26", "John 10:18", "2 Corinthians 5:21", "1 Peter 3:18"],
    "related_readings": ["The Cross of Christ (John Stott)", "The Reason for God Ch.12 (Tim Keller)"],
    "tags": ["atonement", "cross", "intermediate"]
  },
  {
    "id": "q015",
    "category": "life_after_death",
    "question_zh": "人死后会怎样？天堂和地狱是真的吗？",
    "question_en": "What happens after death? Are heaven and hell real?",
    "short_answer_zh": "圣经教导人死后有审判——与上帝永远同在（天堂）或永远与祂隔绝（地狱）。这不是恐吓，而是对我们选择的终极尊重。",
    "short_answer_en": "The Bible teaches that after death comes judgment — eternal presence with God (heaven) or eternal separation from Him (hell). This isn't a threat but the ultimate respect for our choices.",
    "detailed_answer_zh": "天堂不只是「美好的地方」，而是与上帝完全同在——爱、喜乐、平安的完全实现。地狱不只是「可怕的地方」，而是与上帝完全隔绝——失去一切美善之源。\n\nC.S.路易斯说得好：「地狱的门是从里面锁上的。」上帝不是把人扔进地狱的暴君。相反，地狱是人一生拒绝上帝的最终结果。那些一辈子对上帝说「不要你」的人，上帝最终尊重了他们的选择。\n\n正因为永恒的后果如此严重，福音才如此紧迫。上帝不愿一人沉沦，乃愿人人都悔改（彼后3:9）。今天就是恩典的日子。",
    "detailed_answer_en": "Heaven is not merely a 'nice place' but the fullness of God's presence — the complete realization of love, joy, and peace. Hell is not merely a 'terrible place' but complete separation from God — losing the source of all good.\n\nC.S. Lewis said it well: 'The doors of hell are locked from the inside.' God is not a tyrant throwing people into hell. Rather, hell is the final result of a lifetime of rejecting God. For those who spent their whole lives saying 'I don't want You,' God ultimately respects their choice.\n\nBecause the eternal consequences are so serious, the gospel is so urgent. God is not willing that any should perish but that all should come to repentance (2 Peter 3:9). Today is the day of grace.",
    "bible_verses": ["Hebrews 9:27", "Revelation 21:3-4", "2 Peter 3:9", "John 3:16", "Matthew 25:46"],
    "related_readings": ["The Great Divorce (C.S. Lewis)", "The Reason for God Ch.5 (Tim Keller)"],
    "tags": ["afterlife", "heaven", "hell", "beginner"]
  },
  {
    "id": "q016",
    "category": "life_after_death",
    "question_zh": "一个慈爱的上帝怎么会把人送进地狱？",
    "question_en": "How could a loving God send people to hell?",
    "short_answer_zh": "上帝不是要把人送进地狱——祂差遣祂的儿子来拯救人脱离地狱。拒绝这份救恩是人自己的选择，上帝尊重这个选择。",
    "short_answer_en": "God doesn't want to send people to hell — He sent His Son to save people from it. Rejecting that salvation is a person's own choice, and God respects it.",
    "detailed_answer_zh": "这个问题假设上帝是主动把人推进地狱的，但圣经的图景完全不同。上帝竭尽所能来拯救人——祂差遣先知、赐下圣经、最终差遣自己的儿子为我们死。\n\n地狱不是上帝任意施加的惩罚，而是人拒绝上帝的自然结果。如果上帝是一切美善的源头——爱、喜乐、美、真理——那么与上帝永远隔绝就意味着失去这一切。这就是地狱。\n\n问题不是「一个慈爱的上帝怎么会允许地狱」，而是「一个公义的上帝怎么会允许有罪的人进天堂」。答案是：通过十字架。上帝的慈爱和公义在基督里完美地和解了。",
    "detailed_answer_en": "This question assumes God actively pushes people into hell, but the biblical picture is completely different. God does everything possible to save — He sent prophets, gave Scripture, and ultimately sent His own Son to die for us.\n\nHell is not an arbitrary punishment God imposes but the natural consequence of rejecting God. If God is the source of all good — love, joy, beauty, truth — then eternal separation from God means losing all of these. That is hell.\n\nThe real question isn't 'how could a loving God allow hell' but 'how could a just God allow sinful people into heaven.' The answer: through the cross. God's love and justice are perfectly reconciled in Christ.",
    "bible_verses": ["John 3:17", "2 Peter 3:9", "Matthew 23:37", "Romans 6:23"],
    "related_readings": ["The Problem of Pain Ch.8 (C.S. Lewis)", "The Reason for God Ch.5 (Tim Keller)"],
    "tags": ["hell", "love", "justice", "intermediate"]
  },
  {
    "id": "q017",
    "category": "moral_foundation",
    "question_zh": "没有上帝也可以做好人，道德不需要宗教。",
    "question_en": "You can be good without God. Morality doesn't need religion.",
    "short_answer_zh": "不信上帝的人当然可以行善。但问题不是「你能不能做好人」，而是「如果没有上帝，'好'是什么意思？」没有客观标准，道德就只是个人偏好。",
    "short_answer_en": "Non-believers can certainly do good. But the question isn't 'can you be good' but 'without God, what does good mean?' Without an objective standard, morality is just personal preference.",
    "detailed_answer_zh": "我们完全承认不信上帝的人也能行善——圣经说上帝的律法写在所有人心里（罗2:15）。问题不在于行为层面，而在于基础层面。\n\n如果没有上帝，道德就没有客观基础。你说杀人是错的，但为什么？如果道德只是进化的产物，那它不过是帮助物种生存的本能——没有什么真正的「对错」。如果道德只是社会约定，那不同社会有不同标准，没有谁比谁更「对」。\n\n只有一位超越人类、至善的上帝才能为客观道德提供基础。我们内心深处知道某些事情是绝对错误的（比如无辜儿童被虐待）——这种道德直觉是最有力的证据，指向一位道德的上帝。",
    "detailed_answer_en": "We fully acknowledge that non-believers can do good — the Bible says God's law is written on all hearts (Rom 2:15). The issue isn't behavioral but foundational.\n\nWithout God, morality has no objective basis. You say murder is wrong, but why? If morality is merely an evolutionary product, it's just a survival instinct — no real 'right or wrong.' If morality is just a social convention, different societies have different standards with none being more 'right.'\n\nOnly a transcendent, perfectly good God can ground objective morality. Deep down we know some things are absolutely wrong (like abusing innocent children) — this moral intuition is powerful evidence pointing to a moral God.",
    "bible_verses": ["Romans 2:14-15", "Genesis 1:27", "Psalm 14:1", "Micah 6:8"],
    "related_readings": ["Mere Christianity Book 1 (C.S. Lewis)", "The Reason for God Ch.9 (Tim Keller)"],
    "tags": ["morality", "ethics", "beginner"]
  },
  {
    "id": "q018",
    "category": "moral_foundation",
    "question_zh": "基督教不是压迫人的工具吗？历史上制造了多少罪恶？",
    "question_en": "Isn't Christianity a tool of oppression? Look at all the evil done in its name throughout history.",
    "short_answer_zh": "以基督之名做的恶事恰恰违背了基督的教导。不应该因为仿冒品而否定真品。同时，基督教也是废奴、教育、医疗、人权运动的最大推动力。",
    "short_answer_en": "Evil done in Christ's name directly contradicts Christ's teaching. We shouldn't reject the genuine because of counterfeits. Meanwhile, Christianity has been the greatest force behind abolition, education, healthcare, and human rights.",
    "detailed_answer_zh": "这是一个重要的问题，我们不应该回避。十字军东征、宗教裁判所、殖民主义中的暴行——这些都是以基督之名犯下的真实罪恶，基督徒应当为此深感痛心和忏悔。\n\n但两个关键区别需要注意：\n\n第一，这些行为直接违背了耶稣的教导。评判基督教应该根据基督本人，而不是那些违背祂教导的人。\n\n第二，历史记录远比通常描述的更复杂。基督教建立了第一批医院、大学、孤儿院。废奴运动由威伯力等基督徒领导。马丁·路德·金的民权运动源于基督教信仰。现代科学在基督教文明中诞生。没有任何世俗意识形态产生了如此多的积极贡献。",
    "detailed_answer_en": "This is an important question we shouldn't avoid. The Crusades, Inquisition, colonial atrocities — these are real evils committed in Christ's name, and Christians should grieve and repent deeply.\n\nBut two critical distinctions matter:\n\nFirst, these actions directly contradicted Jesus's teaching. Christianity should be judged by Christ Himself, not by those who violated His teaching.\n\nSecond, the historical record is far more complex than commonly portrayed. Christianity built the first hospitals, universities, and orphanages. The abolition movement was led by Christians like Wilberforce. Martin Luther King Jr.'s civil rights movement was rooted in Christian faith. Modern science was born in Christian civilization. No secular ideology has produced as many positive contributions.",
    "bible_verses": ["Matthew 7:21-23", "Matthew 5:44", "John 13:35", "Galatians 5:22-23"],
    "related_readings": ["The Reason for God Ch.4 (Tim Keller)", "How Christianity Changed the World (Alvin Schmidt)"],
    "tags": ["history", "church", "apologetics", "intermediate"]
  },
  {
    "id": "q019",
    "category": "uniqueness_of_jesus",
    "question_zh": "条条大路通罗马——所有宗教不是殊途同归吗？",
    "question_en": "All roads lead to Rome — don't all religions lead to the same place?",
    "short_answer_zh": "表面上听起来很宽容，但实际上各宗教对核心问题的回答截然不同。说它们都一样，反而是对每种宗教的不尊重。",
    "short_answer_en": "It sounds tolerant on the surface, but religions give radically different answers to core questions. Saying they're all the same actually disrespects each one.",
    "detailed_answer_zh": "各宗教对最根本的问题给出了互相矛盾的答案：\n\n- 上帝：基督教说一位位格的三一上帝；伊斯兰说独一的安拉；佛教说无神或非位格的终极实在；印度教说多神或泛神\n- 人的问题：基督教说是罪；佛教说是苦和无明；印度教说是无知（摩耶）\n- 解决方案：基督教说是恩典；伊斯兰说是顺服；佛教说是觉悟；印度教说是修行\n\n这些不可能都是对的。说它们「殊途同归」要么是不了解它们的实际教导，要么是在做一个更大的宗教宣称——「我知道所有宗教的终极真理」，而这本身就是一种宗教立场。\n\n真正的宽容不是说「你们都一样」，而是尊重差异，寻求真理。",
    "detailed_answer_en": "Religions give mutually contradictory answers to the most fundamental questions:\n\n- God: Christianity says one personal Triune God; Islam says one Allah; Buddhism says no god or an impersonal ultimate; Hinduism says many gods or pantheism\n- Human problem: Christianity says sin; Buddhism says suffering and ignorance; Hinduism says illusion (maya)\n- Solution: Christianity says grace; Islam says submission; Buddhism says enlightenment; Hinduism says practice\n\nThese cannot all be right. Saying they 'all lead to the same place' either shows ignorance of their actual teachings or makes an even bigger religious claim — 'I know the ultimate truth about all religions' — which is itself a religious position.\n\nTrue tolerance isn't saying 'you're all the same' but respecting differences while seeking truth.",
    "bible_verses": ["John 14:6", "Acts 4:12", "1 Timothy 2:5"],
    "related_readings": ["The Reason for God Ch.1 (Tim Keller)", "Jesus Among Other Gods (Ravi Zacharias)"],
    "tags": ["pluralism", "religions", "beginner"]
  },
  {
    "id": "q020",
    "category": "bible_reliability",
    "question_zh": "圣经不是经过多次翻译和修改吗？原文早就失传了吧？",
    "question_en": "Hasn't the Bible been translated and altered many times? The original must be long lost.",
    "short_answer_zh": "现代圣经是从最古老的希伯来文和希腊文手抄本直接翻译的，不是从翻译的翻译。我们有超过5800份希腊文新约手抄本，远超任何古代文献。",
    "short_answer_en": "Modern Bibles are translated directly from the oldest Hebrew and Greek manuscripts, not from translations of translations. We have over 5,800 Greek New Testament manuscripts, far exceeding any other ancient document.",
    "detailed_answer_zh": "这是一个常见的误解。现代圣经翻译是从最古老的原文手抄本直接翻译的，不是经过层层翻译。圣经学者可以直接接触数千份古代手抄本。\n\n新约的文本证据无与伦比：\n- 超过5800份希腊文手抄本\n- 超过10000份拉丁文手抄本\n- 最早的手抄本片段距原作不到100年\n\n相比之下，我们对荷马、柏拉图等古典作品的信心基于远少得多的手抄本和更大的时间间隔，但没有人质疑它们的文本可靠性。\n\n1947年发现的死海古卷包含了几乎完整的以赛亚书，比之前最早的手抄本早1000年，但内容几乎完全一致。这证明了圣经传抄的惊人准确性。",
    "detailed_answer_en": "This is a common misconception. Modern Bible translations work directly from the oldest original-language manuscripts, not through layers of translation. Biblical scholars have direct access to thousands of ancient manuscripts.\n\nThe textual evidence for the New Testament is unparalleled:\n- Over 5,800 Greek manuscripts\n- Over 10,000 Latin manuscripts\n- The earliest manuscript fragments date within 100 years of the originals\n\nBy comparison, our confidence in Homer, Plato, and other classical works rests on far fewer manuscripts with much larger time gaps, yet no one questions their textual reliability.\n\nThe Dead Sea Scrolls discovered in 1947 contained a nearly complete book of Isaiah, 1,000 years older than the previous oldest manuscript, yet virtually identical in content. This demonstrates the remarkable accuracy of biblical transmission.",
    "bible_verses": ["Isaiah 40:8", "Matthew 24:35", "1 Peter 1:25"],
    "related_readings": ["Can We Trust the Gospels? (Peter Williams)", "The New Testament Documents: Are They Reliable? (F.F. Bruce)"],
    "tags": ["bible", "manuscripts", "textual_criticism", "intermediate"]
  }
]
