[
  {
    "id": "q001",
    "category": "existence_of_god",
    "question_zh": "如果看不见上帝，怎么能相信祂存在？",
    "question_en": "How can you believe in a God you can't see?",
    "short_answer_zh": "我们相信很多看不见的事物——引力、爱、理性。上帝虽然不可见，但祂通过创造、良心和历史彰显自己。",
    "short_answer_en": "We believe in many things we can't see — gravity, love, reason. Though God is invisible, He reveals Himself through creation, conscience, and history.",
    "detailed_answer_zh": "这个问题假设只有可见的事物才是真实的，但这种假设本身就有问题。我们生活中最重要的事物——逻辑规律、道德标准、数学真理、爱——都是看不见的，但我们从不质疑它们的真实性。\n\n圣经告诉我们，上帝的永能和神性从所造之物就可以看见（罗马书1:20）。宇宙的精密设计、人类固有的道德直觉、历史中的启示，都指向一位超越的创造者。\n\n更重要的是，基督教的上帝不是一个抽象概念，而是在历史中行动的位格。祂在耶稣基督里变得可见，道成了肉身，住在我们中间。",
    "detailed_answer_en": "This question assumes that only visible things are real, but that assumption is itself problematic. The most important realities in our lives — laws of logic, moral standards, mathematical truths, love — are all invisible, yet we never question their reality.\n\nThe Bible tells us that God's eternal power and divine nature have been clearly perceived through what has been made (Romans 1:20). The fine-tuning of the universe, humanity's innate moral intuitions, and revelation in history all point to a transcendent Creator.\n\nMore importantly, the Christian God is not an abstract concept but a person who acts in history. He became visible in Jesus Christ — the Word became flesh and dwelt among us.",
    "bible_verses": ["Romans 1:20", "Psalm 19:1-2", "Hebrews 11:1", "John 1:14", "Colossians 1:15"],
    "related_readings": ["Mere Christianity Ch.1-2 (C.S. Lewis)", "Defending Your Faith Ch.3 (R.C. Sproul)", "The Reason for God Ch.8 (Tim Keller)"],
    "tags": ["apologetics", "atheism", "beginner"]
  },
  {
    "id": "q002",
    "category": "existence_of_god",
    "question_zh": "宇宙为什么存在？难道不可能是自然发生的吗？",
    "question_en": "Why does the universe exist? Couldn't it have just happened naturally?",
    "short_answer_zh": "宇宙有一个开始（大爆炸），而一切有开始的事物都有原因。这个终极原因必须是超越时间和空间的——这正是我们所说的上帝。",
    "short_answer_en": "The universe had a beginning (Big Bang), and everything that begins to exist has a cause. This ultimate cause must be beyond time and space — which is what we call God.",
    "detailed_answer_zh": "宇宙论论证（Kalam论证）可以这样表述：\n1. 凡是有开始的事物，都有一个原因。\n2. 宇宙有一个开始。\n3. 因此，宇宙有一个原因。\n\n现代科学（大爆炸理论、宇宙膨胀、热力学第二定律）都表明宇宙有一个起点。如果宇宙有起点，那么导致宇宙存在的原因必须是超越物质、时间和空间的。这个原因必须极其强大，并且具有意志（因为它选择了创造）。这些属性正是有神论者所说的上帝。\n\n说「宇宙是自然发生的」其实是说「无中生有」，这不是科学解释，而是回避问题。",
    "detailed_answer_en": "The Cosmological Argument (Kalam) can be stated:\n1. Everything that begins to exist has a cause.\n2. The universe began to exist.\n3. Therefore, the universe has a cause.\n\nModern science (Big Bang theory, cosmic expansion, second law of thermodynamics) all indicate the universe had a beginning. If so, the cause must be beyond matter, time, and space. This cause must be immensely powerful and possess will (since it chose to create). These attributes match what theists call God.\n\nSaying 'the universe just happened naturally' is essentially saying 'something came from nothing' — that's not a scientific explanation but an evasion.",
    "bible_verses": ["Genesis 1:1", "Hebrews 11:3", "Psalm 33:6", "Romans 1:20"],
    "related_readings": ["Kalam Cosmological Argument (William Lane Craig)", "Defending Your Faith Ch.5 (R.C. Sproul)"],
    "tags": ["apologetics", "cosmological", "intermediate"]
  },
  {
    "id": "q003",
    "category": "existence_of_god",
    "question_zh": "科学已经解释了一切，还需要上帝吗？",
    "question_en": "Science has explained everything. Do we still need God?",
    "short_answer_zh": "科学解释「怎样」，但不能回答「为什么」。科学告诉我们水的分子结构，但不能告诉我们为什么存在水、存在万物。",
    "short_answer_en": "Science explains 'how' but cannot answer 'why.' Science tells us the molecular structure of water, but not why water — or anything — exists at all.",
    "detailed_answer_zh": "这个问题混淆了两类不同的问题。科学研究自然界的运作规律（机制），但「万物为什么存在」「什么赋予生命意义」「道德的基础是什么」这些问题超出了科学的范畴。\n\n事实上，科学本身依赖于一些无法用科学证明的前提：自然界的规律性、人类理性的可靠性、数学与物质世界的对应。基督教世界观恰恰为这些前提提供了最好的解释——一位理性的上帝创造了有规律的宇宙和能认识这个宇宙的人类心智。\n\n许多最伟大的科学家——牛顿、法拉第、麦克斯韦、普朗克——都是虔诚的基督徒，他们不认为科学与信仰矛盾。",
    "detailed_answer_en": "This question confuses two types of inquiry. Science studies how the natural world operates (mechanisms), but questions like 'why does anything exist,' 'what gives life meaning,' and 'what is the foundation of morality' are beyond the scope of science.\n\nIn fact, science itself depends on presuppositions it cannot prove: the regularity of nature, the reliability of human reason, and the correspondence of mathematics to the physical world. The Christian worldview provides the best explanation for these presuppositions — a rational God created an orderly universe and human minds capable of understanding it.\n\nMany of the greatest scientists — Newton, Faraday, Maxwell, Planck — were devout Christians who saw no conflict between science and faith.",
    "bible_verses": ["Proverbs 25:2", "Psalm 111:2", "Colossians 1:17"],
    "related_readings": ["The Reason for God Ch.6 (Tim Keller)", "Science and Faith (John Lennox)"],
    "tags": ["science", "apologetics", "beginner"]
  },
  {
    "id": "q004",
    "category": "problem_of_evil",
    "question_zh": "如果上帝是全善全能的，为什么世界上有这么多苦难？",
    "question_en": "If God is all-good and all-powerful, why is there so much suffering?",
    "short_answer_zh": "苦难的存在不能证明上帝不存在；相反，我们对苦难的愤怒恰恰指向一个公义的上帝。上帝允许苦难有祂的目的，并且祂亲自进入苦难来救赎我们。",
    "short_answer_en": "The existence of suffering doesn't disprove God; rather, our outrage at suffering points to a just God. God permits suffering for His purposes, and He Himself entered into suffering to redeem us.",
    "detailed_answer_zh": "这可能是人们最常提出的反对信仰的理由。但仔细思考，这个论证其实预设了上帝的存在：\n\n如果没有上帝，就没有客观的善恶标准。如果没有善恶标准，你就不能说苦难是「恶的」。如果苦难只是自然现象而非「恶」，那就没有什么问题需要解决。正是因为我们直觉地知道苦难是「不应该」的，这恰恰暗示存在一个「应该」的标准——而这个标准指向上帝。\n\n圣经从不回避苦难的问题，但它提供了独特的回应：上帝不是远远地旁观我们的痛苦，而是在耶稣基督里亲自进入最深的苦难——十字架。上帝不只是解释苦难，祂进入了苦难。",
    "detailed_answer_en": "This may be the most common objection to faith. But upon reflection, this argument actually presupposes God's existence:\n\nWithout God, there is no objective standard of good and evil. Without such a standard, you cannot call suffering 'evil.' If suffering is merely a natural phenomenon rather than 'evil,' there's no problem to solve. The fact that we intuitively know suffering 'shouldn't be' implies a standard of how things 'should be' — and that standard points to God.\n\nThe Bible never avoids the problem of suffering, but offers a unique response: God is not watching our pain from afar. In Jesus Christ, He entered into the deepest suffering — the cross. God doesn't just explain suffering; He entered it.",
    "bible_verses": ["Romans 8:28", "2 Corinthians 4:17", "John 16:33", "Isaiah 53:3-5"],
    "related_readings": ["The Problem of Pain (C.S. Lewis)", "Walking with God through Pain and Suffering (Tim Keller)"],
    "tags": ["suffering", "apologetics", "beginner"]
  },
  {
    "id": "q005",
    "category": "problem_of_evil",
    "question_zh": "为什么上帝不阻止自然灾害和疾病？",
    "question_en": "Why doesn't God stop natural disasters and disease?",
    "short_answer_zh": "自然界的苦难是堕落世界的结果。上帝并非对苦难漠不关心，而是在护理中使用这些事成就更大的善，并应许将来彻底更新万有。",
    "short_answer_en": "Natural suffering is a consequence of a fallen world. God is not indifferent to suffering but in His providence uses these things for greater good, and promises to ultimately renew all things.",
    "detailed_answer_zh": "圣经教导我们，整个受造界都因人类的堕落而受到影响（罗马书8:20-22）。自然灾害和疾病是一个被罪扭曲的世界的一部分，而不是上帝原初创造的设计。\n\n我们需要谦卑地承认，我们有限的视角不可能完全理解无限上帝的目的。约伯的经历告诉我们，上帝并没有总是解释苦难的原因，但祂邀请我们信靠祂的品格。\n\n基督教的盼望不是「苦难不会发生」，而是「苦难不是最终的」。上帝应许祂将擦去一切的眼泪，不再有死亡、悲哀、哭号、疼痛（启示录21:4）。",
    "detailed_answer_en": "Scripture teaches that all creation has been affected by humanity's fall (Romans 8:20-22). Natural disasters and disease are part of a sin-distorted world, not God's original design.\n\nWe must humbly acknowledge that our finite perspective cannot fully grasp an infinite God's purposes. Job's experience teaches us that God doesn't always explain the reasons for suffering, but He invites us to trust His character.\n\nThe Christian hope is not that suffering won't happen, but that suffering is not final. God promises He will wipe away every tear, and there will be no more death, mourning, crying, or pain (Revelation 21:4).",
    "bible_verses": ["Romans 8:20-22", "Job 38:1-4", "Revelation 21:4", "Romans 8:18"],
    "related_readings": ["The Problem of Pain Ch.2 (C.S. Lewis)", "Trusting God (Jerry Bridges)"],
    "tags": ["suffering", "natural_evil", "intermediate"]
  },
  {
    "id": "q006",
    "category": "bible_reliability",
    "question_zh": "圣经不是人写的吗？怎么能说它是上帝的话？",
    "question_en": "The Bible was written by humans. How can you say it's God's Word?",
    "short_answer_zh": "圣经是上帝通过人类作者写成的。正如上帝使用人来完成祂的工作，祂也使用人来记录祂的启示，同时保守他们不出错。",
    "short_answer_en": "The Bible was written by God through human authors. Just as God uses humans to accomplish His work, He used humans to record His revelation while preserving them from error.",
    "detailed_answer_zh": "圣经的双重作者性（神圣与人类）是基督教的核心教义。正如耶稣基督是完全的神也是完全的人，圣经也是完全上帝的话，同时也是完全人类的作品。\n\n上帝并没有机械地口述每一个字，而是通过圣灵默示（God-breathed），使用每位作者的个性、文化背景和写作风格，同时保守他们所写的完全准确可靠。\n\n考古学不断证实圣经的历史准确性。死海古卷的发现证明旧约文本经过上千年的传抄保持了惊人的一致性。新约的手抄本数量远超任何古代文献，使我们有充分理由信任文本的可靠性。",
    "detailed_answer_en": "The dual authorship of Scripture (divine and human) is a core Christian doctrine. Just as Jesus Christ is fully God and fully man, Scripture is fully God's Word while also being fully human writing.\n\nGod did not mechanically dictate every word, but through inspiration (God-breathed), used each author's personality, cultural background, and writing style while ensuring what they wrote was completely accurate and reliable.\n\nArchaeology continually confirms the Bible's historical accuracy. The Dead Sea Scrolls demonstrate that Old Testament texts maintained remarkable consistency over thousands of years of copying. The number of New Testament manuscripts far exceeds any other ancient document, giving us strong reason to trust textual reliability.",
    "bible_verses": ["2 Timothy 3:16", "2 Peter 1:21", "Psalm 19:7-9", "Matthew 5:18"],
    "related_readings": ["Can We Trust the Gospels? (Peter Williams)", "The New Testament Documents (F.F. Bruce)"],
    "tags": ["bible", "reliability", "beginner"]
  },
  {
    "id": "q007",
    "category": "bible_reliability",
    "question_zh": "圣经中不是有很多矛盾吗？",
    "question_en": "Doesn't the Bible contain many contradictions?",
    "short_answer_zh": "所谓的「矛盾」大多是对文体、语境或翻译的误解。仔细研究后，这些问题都有合理的解释。",
    "short_answer_en": "Most alleged 'contradictions' stem from misunderstandings of genre, context, or translation. Upon careful study, these issues have reasonable explanations.",
    "detailed_answer_zh": "许多所谓的矛盾来自于以现代标准衡量古代文体。圣经包含多种文体——叙事、诗歌、预言、书信——每种文体有不同的表达方式。\n\n例如，四福音书对同一事件的记载有差异，但这恰恰证明了它们是独立的目击证词，而非串通编造。差异在细节上，核心事实完全一致。就像四个目击证人对一起事件的描述会有不同角度，但这增强而非削弱了证词的可信度。\n\n经过两千年的批评性研究，没有发现任何真正的矛盾足以推翻圣经的可信度。",
    "detailed_answer_en": "Many alleged contradictions arise from applying modern standards to ancient literary genres. The Bible contains multiple genres — narrative, poetry, prophecy, epistles — each with different modes of expression.\n\nFor example, the four Gospels' varying accounts of the same events actually prove they are independent eyewitness testimonies, not a coordinated fabrication. Differences are in details while core facts are completely consistent. Like four eyewitnesses describing the same event from different angles, this strengthens rather than weakens credibility.\n\nAfter two thousand years of critical study, no genuine contradiction has been found sufficient to undermine the Bible's trustworthiness.",
    "bible_verses": ["John 10:35", "Psalm 119:160", "Proverbs 30:5"],
    "related_readings": ["Encyclopedia of Bible Difficulties (Gleason Archer)", "Is God a Moral Monster? (Paul Copan)"],
    "tags": ["bible", "contradictions", "intermediate"]
  },
  {
    "id": "q008",
    "category": "science_and_faith",
    "question_zh": "进化论不是已经否定了创造论吗？",
    "question_en": "Doesn't evolution disprove creation?",
    "short_answer_zh": "进化论描述的是生物变化的机制，并不能否定上帝作为创造者。很多杰出科学家是基督徒，相信上帝通过自然过程来创造和维持生命。",
    "short_answer_en": "Evolution describes mechanisms of biological change but cannot disprove God as Creator. Many outstanding scientists are Christians who believe God creates and sustains life through natural processes.",
    "detailed_answer_zh": "首先，我们需要区分「微观进化」（物种内的变异和适应）和「宏观进化」（一个物种变成另一个完全不同的物种）。微观进化是公认的事实，但宏观进化仍有许多未解的科学问题。\n\n更重要的是，即使生物进化是事实，它也不能回答根本问题：为什么存在生命？为什么自然律存在？为什么宇宙的参数恰好允许生命存在？\n\n许多基督徒科学家持有不同观点——从年轻地球创造论到神导进化论——但他们都同意：无论上帝使用什么过程，祂是万物的最终创造者和维持者。科学与信仰不是非此即彼的选择。",
    "detailed_answer_en": "First, we must distinguish between microevolution (variation and adaptation within species) and macroevolution (one species becoming an entirely different one). Microevolution is established fact, but macroevolution still has many unresolved scientific questions.\n\nMore importantly, even if biological evolution is true, it cannot answer the fundamental questions: Why does life exist? Why do natural laws exist? Why are the universe's parameters precisely tuned to permit life?\n\nChristian scientists hold various views — from young earth creationism to theistic evolution — but all agree: whatever processes God used, He is the ultimate Creator and Sustainer. Science and faith are not an either/or choice.",
    "bible_verses": ["Genesis 1:1", "Psalm 104:24-30", "Colossians 1:16-17"],
    "related_readings": ["Science and Faith (John Lennox)", "The Language of God (Francis Collins)"],
    "tags": ["science", "evolution", "intermediate"]
  },
  {
    "id": "q009",
    "category": "science_and_faith",
    "question_zh": "信仰不就是一种迷信吗？理性的人不需要信仰。",
    "question_en": "Isn't faith just superstition? Rational people don't need faith.",
    "short_answer_zh": "基督教信仰不是盲目的迷信，而是基于证据的理性信靠。事实上，每个人都靠「信仰」生活——你信靠理性本身就是一种信仰。",
    "short_answer_en": "Christian faith is not blind superstition but rational trust based on evidence. In fact, everyone lives by faith — your trust in reason itself is a form of faith.",
    "detailed_answer_zh": "圣经中的「信仰」（pistis）不是「不顾证据相信」，而是「基于证据的信靠」。希伯来书11:1说信仰是「所望之事的实底，未见之事的确据」——这是一种有根据的确信。\n\n讽刺的是，声称「只相信理性」的人其实在做一个信仰声明——因为你不能用理性来证明「只有理性才是获取真理的唯一途径」，这是一个循环论证。理性主义本身依赖于无法用理性证明的前提。\n\n基督教信仰有丰富的理性基础：宇宙的起源、生命的设计、道德的客观性、耶稣的历史证据、教会的持续存在——这些都指向信仰的合理性。",
    "detailed_answer_en": "Biblical 'faith' (pistis) is not 'believing despite evidence' but 'trust based on evidence.' Hebrews 11:1 says faith is 'the substance of things hoped for, the evidence of things not seen' — it's a well-grounded conviction.\n\nIronically, claiming to 'only believe in reason' is itself a faith statement — you cannot use reason to prove 'reason is the only path to truth.' That's circular reasoning. Rationalism itself depends on presuppositions that cannot be rationally proven.\n\nChristian faith has rich rational foundations: the origin of the universe, the design of life, the objectivity of morality, the historical evidence for Jesus, the endurance of the Church — all point to the reasonableness of faith.",
    "bible_verses": ["Hebrews 11:1", "1 Peter 3:15", "Isaiah 1:18", "Acts 17:2"],
    "related_readings": ["Mere Christianity Book 3 (C.S. Lewis)", "Defending Your Faith Ch.1 (R.C. Sproul)"],
    "tags": ["faith", "reason", "beginner"]
  },
  {
    "id": "q010",
    "category": "uniqueness_of_jesus",
    "question_zh": "耶稣和其他宗教领袖有什么不同？",
    "question_en": "What makes Jesus different from other religious leaders?",
    "short_answer_zh": "耶稣不仅是道德教师，祂宣称自己是上帝。祂的复活从死里证明了这一宣称。没有其他宗教领袖做过类似的宣称并有证据支持。",
    "short_answer_en": "Jesus was not merely a moral teacher — He claimed to be God. His resurrection from the dead vindicated that claim. No other religious leader made such claims with supporting evidence.",
    "detailed_answer_zh": "C.S.路易斯著名的「三难推理」指出：耶稣宣称自己是上帝，那么祂要么是骗子（知道自己不是但故意欺骗）、要么是疯子（真以为自己是上帝但其实不是）、要么确实是主。\n\n耶稣的道德教导之高尚排除了祂是骗子的可能；祂的智慧和冷静排除了祂是疯子的可能。最有力的证据是复活：空坟墓、数百人见证复活的基督、门徒们为此殉道的事实。\n\n其他宗教领袖教导通往上帝的道路，但耶稣说「我就是道路、真理、生命」。其他人指向真理，耶稣说祂就是真理。这使祂截然不同。",
    "detailed_answer_en": "C.S. Lewis's famous 'trilemma' states: Jesus claimed to be God, so He was either a liar (knew He wasn't but deliberately deceived), a lunatic (genuinely believed He was God but wasn't), or truly Lord.\n\nThe moral sublimity of Jesus's teachings rules out liar; His wisdom and composure rule out lunatic. The most powerful evidence is the resurrection: the empty tomb, hundreds of witnesses to the risen Christ, and the disciples' willingness to die for this claim.\n\nOther religious leaders taught the way to God, but Jesus said 'I am the way, the truth, and the life.' Others pointed to truth; Jesus said He is truth. This makes Him categorically different.",
    "bible_verses": ["John 14:6", "John 10:30", "Matthew 28:6", "1 Corinthians 15:3-8"],
    "related_readings": ["Mere Christianity Book 2, Ch.3 (C.S. Lewis)", "The Case for Christ (Lee Strobel)"],
    "tags": ["jesus", "christology", "beginner"]
  },
  {
    "id": "q011",
    "category": "uniqueness_of_jesus",
    "question_zh": "耶稣真的从死里复活了吗？有什么证据？",
    "question_en": "Did Jesus really rise from the dead? What's the evidence?",
    "short_answer_zh": "历史证据极其有力：空坟墓、数百位目击证人、门徒的彻底转变、以及基督教在逼迫中的爆发式增长，都指向复活的真实性。",
    "short_answer_en": "The historical evidence is compelling: the empty tomb, hundreds of eyewitnesses, the radical transformation of the disciples, and the explosive growth of Christianity under persecution all point to the reality of the resurrection.",
    "detailed_answer_zh": "即使是怀疑派学者也承认几个基本历史事实：\n\n1. 耶稣在十字架上死了（罗马行刑非常彻底）\n2. 第三天坟墓是空的（否则反对者只需展示尸体即可终结基督教）\n3. 众多人声称见到了复活的基督（保罗列出超过500位目击者）\n4. 门徒的生命发生了彻底改变（从恐惧逃散到勇敢殉道）\n\n各种自然主义解释（偷尸体、昏迷、幻觉）都不能令人信服地解释所有这些事实。最好的解释就是：耶稣真的复活了。正如保罗所说，如果基督没有复活，我们的信仰就是枉然的（林前15:17）。但基督确实复活了。",
    "detailed_answer_en": "Even skeptical scholars acknowledge several basic historical facts:\n\n1. Jesus died on the cross (Roman execution was thorough)\n2. The tomb was empty on the third day (opponents only needed to produce the body to end Christianity)\n3. Many people claimed to see the risen Christ (Paul lists over 500 witnesses)\n4. The disciples' lives were radically transformed (from fearful fugitives to bold martyrs)\n\nVarious naturalistic explanations (stolen body, swoon theory, hallucinations) cannot convincingly account for all these facts together. The best explanation is simply: Jesus truly rose. As Paul said, if Christ has not been raised, our faith is in vain (1 Cor 15:17). But Christ has indeed been raised.",
    "bible_verses": ["1 Corinthians 15:3-8", "1 Corinthians 15:17", "Matthew 28:1-10", "Acts 1:3"],
    "related_readings": ["The Case for Christ Ch.5 (Lee Strobel)", "The Resurrection of the Son of God (N.T. Wright)"],
    "tags": ["resurrection", "evidence", "beginner"]
  },
  {
    "id": "q012",
    "category": "sin_and_salvation",
    "question_zh": "我是好人，为什么还需要耶稣？",
    "question_en": "I'm a good person. Why do I need Jesus?",
    "short_answer_zh": "问题不在于你和别人比较如何，而在于你和上帝的标准比较如何。上帝的标准是完美——没有人能靠自己达到。这就是为什么我们需要恩典。",
    "short_answer_en": "The question isn't how you compare to others, but how you compare to God's standard. God's standard is perfection — no one can achieve it on their own. That's why we need grace.",
    "detailed_answer_zh": "当人说「我是好人」时，通常是和别人比较。但圣经的标准不是「比多数人好」，而是上帝的完美圣洁。耶稣说，甚至心里恨人就等于杀人，心里动淫念就等于犯奸淫（太5:21-28）。按这个标准，没有人是「好人」。\n\n这不是要让人绝望，而是要让人认识到：我们需要的不是更努力，而是一位救主。好消息是，上帝不是要求我们先变好才接纳我们，而是在我们还是罪人的时候就为我们死了（罗5:8）。\n\n救恩不是我们赚来的工资，而是上帝白白赐给的礼物。我们只需要承认自己的需要，接受这份恩典。",
    "detailed_answer_en": "When people say 'I'm a good person,' they usually compare themselves to others. But the biblical standard isn't 'better than most' — it's God's perfect holiness. Jesus said even hating someone is equivalent to murder, and lustful thoughts are equivalent to adultery (Matt 5:21-28). By this standard, no one is 'good.'\n\nThis isn't meant to bring despair but recognition: we don't need to try harder — we need a Savior. The good news is that God doesn't require us to become good first; He died for us while we were still sinners (Rom 5:8).\n\nSalvation isn't wages we earn but a gift God gives freely. We need only acknowledge our need and receive this grace.",
    "bible_verses": ["Romans 3:23", "Romans 5:8", "Ephesians 2:8-9", "Isaiah 64:6", "Matthew 5:48"],
    "related_readings": ["The Reason for God Ch.10 (Tim Keller)", "The Holiness of God Ch.4 (R.C. Sproul)"],
    "tags": ["salvation", "sin", "beginner"]
  },
  {
    "id": "q013",
    "category": "sin_and_salvation",
    "question_zh": "什么是罪？我又没杀人放火。",
    "question_en": "What is sin? I've never killed anyone or committed a crime.",
    "short_answer_zh": "罪不仅是外在的行为，更是内在的态度——以自我为中心、脱离上帝而活。罪的本质是拒绝让上帝做上帝，自己做自己的主宰。",
    "short_answer_en": "Sin is not just external actions but an internal attitude — living self-centeredly, apart from God. The essence of sin is refusing to let God be God and making yourself your own lord.",
    "detailed_answer_zh": "威斯敏斯特小要理问答说：罪是不遵行或违反上帝律法的任何思想、言语或行为。罪不仅是你做了什么坏事，也包括你应该做而没有做的好事。\n\n但在更深的层面，罪是一种关系的破裂。上帝创造我们是为了与祂相交，但我们选择了自己做自己的神——自己决定什么是对错，自己赋予生命意义，自己掌控一切。这种自我中心就是罪的核心。\n\n这就是为什么「好人」也需要救恩——不是因为你犯了多少错，而是因为你的整个生命方向可能都偏离了被造的目的。就像一支箭，无论它多漂亮，如果没有射中靶心，就是偏离了。",
    "detailed_answer_en": "The Westminster Shorter Catechism states: sin is any want of conformity unto, or transgression of, the law of God. Sin includes not only bad things you've done but good things you should have done but didn't.\n\nAt a deeper level, sin is a broken relationship. God created us for fellowship with Him, but we chose to be our own gods — deciding right from wrong, assigning meaning to life, controlling everything ourselves. This self-centeredness is the core of sin.\n\nThis is why 'good people' also need salvation — not because of how many mistakes you've made, but because your entire life direction may be off course from its created purpose. Like an arrow — no matter how beautiful, if it misses the target, it's off the mark.",
    "bible_verses": ["Romans 3:23", "1 John 3:4", "James 4:17", "Isaiah 53:6", "Genesis 3:5"],
    "related_readings": ["The Holiness of God Ch.6 (R.C. Sproul)", "Mere Christianity Book 1 (C.S. Lewis)"],
    "tags": ["sin", "theology", "beginner"]
  },
  {
    "id": "q014",
    "category": "sin_and_salvation",
    "question_zh": "为什么上帝不能直接赦免罪，非要耶稣死在十字架上？",
    "question_en": "Why can't God just forgive sin directly? Why did Jesus have to die on the cross?",
    "short_answer_zh": "因为上帝既是慈爱的，也是公义的。公义要求罪必须被审判，慈爱要求罪人被拯救。十字架是上帝的公义和慈爱完美交汇的地方。",
    "short_answer_en": "Because God is both loving and just. Justice demands sin be judged; love demands sinners be saved. The cross is where God's justice and love perfectly meet.",
    "detailed_answer_zh": "如果一个法官因为他喜欢被告就直接放过他，我们不会说这个法官是好的——我们会说他腐败。同样，如果上帝无视罪，祂就不再是公义的。\n\n上帝面临的不是一个简单的选择。祂的本性要求罪必须被审判（公义），同时祂渴望拯救罪人（慈爱）。十字架是唯一同时满足两者的方式：耶稣——无罪的上帝之子——代替我们承受了公义的审判，使得上帝的慈爱可以合法地临到我们。\n\n这不是一个愤怒的父亲惩罚无辜的儿子。三位一体的上帝——父、子、圣灵——共同决定了这个救赎计划。耶稣甘心情愿地献上自己：「没有人夺我的命去，是我自己舍的」（约10:18）。",
    "detailed_answer_en": "If a judge let a defendant go free simply because he liked him, we wouldn't call that judge good — we'd call him corrupt. Similarly, if God overlooked sin, He would no longer be just.\n\nGod didn't face a simple choice. His nature demands sin be judged (justice) while He desires to save sinners (love). The cross is the only way to satisfy both: Jesus — the sinless Son of God — took upon Himself the judgment we deserved, so God's love could legitimately reach us.\n\nThis isn't an angry Father punishing an innocent Son. The Triune God — Father, Son, and Spirit — together ordained this plan of redemption. Jesus gave Himself willingly: 'No one takes my life from me; I lay it down of my own accord' (John 10:18).",
    "bible_verses": ["Romans 3:25-26", "John 10:18", "2 Corinthians 5:21", "1 Peter 3:18"],
    "related_readings": ["The Cross of Christ (John Stott)", "The Reason for God Ch.12 (Tim Keller)"],
    "tags": ["atonement", "cross", "intermediate"]
  },
  {
    "id": "q015",
    "category": "life_after_death",
    "question_zh": "人死后会怎样？天堂和地狱是真的吗？",
    "question_en": "What happens after death? Are heaven and hell real?",
    "short_answer_zh": "圣经教导人死后有审判——与上帝永远同在（天堂）或永远与祂隔绝（地狱）。这不是恐吓，而是对我们选择的终极尊重。",
    "short_answer_en": "The Bible teaches that after death comes judgment — eternal presence with God (heaven) or eternal separation from Him (hell). This isn't a threat but the ultimate respect for our choices.",
    "detailed_answer_zh": "天堂不只是「美好的地方」，而是与上帝完全同在——爱、喜乐、平安的完全实现。地狱不只是「可怕的地方」，而是与上帝完全隔绝——失去一切美善之源。\n\nC.S.路易斯说得好：「地狱的门是从里面锁上的。」上帝不是把人扔进地狱的暴君。相反，地狱是人一生拒绝上帝的最终结果。那些一辈子对上帝说「不要你」的人，上帝最终尊重了他们的选择。\n\n正因为永恒的后果如此严重，福音才如此紧迫。上帝不愿一人沉沦，乃愿人人都悔改（彼后3:9）。今天就是恩典的日子。",
    "detailed_answer_en": "Heaven is not merely a 'nice place' but the fullness of God's presence — the complete realization of love, joy, and peace. Hell is not merely a 'terrible place' but complete separation from God — losing the source of all good.\n\nC.S. Lewis said it well: 'The doors of hell are locked from the inside.' God is not a tyrant throwing people into hell. Rather, hell is the final result of a lifetime of rejecting God. For those who spent their whole lives saying 'I don't want You,' God ultimately respects their choice.\n\nBecause the eternal consequences are so serious, the gospel is so urgent. God is not willing that any should perish but that all should come to repentance (2 Peter 3:9). Today is the day of grace.",
    "bible_verses": ["Hebrews 9:27", "Revelation 21:3-4", "2 Peter 3:9", "John 3:16", "Matthew 25:46"],
    "related_readings": ["The Great Divorce (C.S. Lewis)", "The Reason for God Ch.5 (Tim Keller)"],
    "tags": ["afterlife", "heaven", "hell", "beginner"]
  },
  {
    "id": "q016",
    "category": "life_after_death",
    "question_zh": "一个慈爱的上帝怎么会把人送进地狱？",
    "question_en": "How could a loving God send people to hell?",
    "short_answer_zh": "上帝不是要把人送进地狱——祂差遣祂的儿子来拯救人脱离地狱。拒绝这份救恩是人自己的选择，上帝尊重这个选择。",
    "short_answer_en": "God doesn't want to send people to hell — He sent His Son to save people from it. Rejecting that salvation is a person's own choice, and God respects it.",
    "detailed_answer_zh": "这个问题假设上帝是主动把人推进地狱的，但圣经的图景完全不同。上帝竭尽所能来拯救人——祂差遣先知、赐下圣经、最终差遣自己的儿子为我们死。\n\n地狱不是上帝任意施加的惩罚，而是人拒绝上帝的自然结果。如果上帝是一切美善的源头——爱、喜乐、美、真理——那么与上帝永远隔绝就意味着失去这一切。这就是地狱。\n\n问题不是「一个慈爱的上帝怎么会允许地狱」，而是「一个公义的上帝怎么会允许有罪的人进天堂」。答案是：通过十字架。上帝的慈爱和公义在基督里完美地和解了。",
    "detailed_answer_en": "This question assumes God actively pushes people into hell, but the biblical picture is completely different. God does everything possible to save — He sent prophets, gave Scripture, and ultimately sent His own Son to die for us.\n\nHell is not an arbitrary punishment God imposes but the natural consequence of rejecting God. If God is the source of all good — love, joy, beauty, truth — then eternal separation from God means losing all of these. That is hell.\n\nThe real question isn't 'how could a loving God allow hell' but 'how could a just God allow sinful people into heaven.' The answer: through the cross. God's love and justice are perfectly reconciled in Christ.",
    "bible_verses": ["John 3:17", "2 Peter 3:9", "Matthew 23:37", "Romans 6:23"],
    "related_readings": ["The Problem of Pain Ch.8 (C.S. Lewis)", "The Reason for God Ch.5 (Tim Keller)"],
    "tags": ["hell", "love", "justice", "intermediate"]
  },
  {
    "id": "q017",
    "category": "moral_foundation",
    "question_zh": "没有上帝也可以做好人，道德不需要宗教。",
    "question_en": "You can be good without God. Morality doesn't need religion.",
    "short_answer_zh": "不信上帝的人当然可以行善。但问题不是「你能不能做好人」，而是「如果没有上帝，'好'是什么意思？」没有客观标准，道德就只是个人偏好。",
    "short_answer_en": "Non-believers can certainly do good. But the question isn't 'can you be good' but 'without God, what does good mean?' Without an objective standard, morality is just personal preference.",
    "detailed_answer_zh": "我们完全承认不信上帝的人也能行善——圣经说上帝的律法写在所有人心里（罗2:15）。问题不在于行为层面，而在于基础层面。\n\n如果没有上帝，道德就没有客观基础。你说杀人是错的，但为什么？如果道德只是进化的产物，那它不过是帮助物种生存的本能——没有什么真正的「对错」。如果道德只是社会约定，那不同社会有不同标准，没有谁比谁更「对」。\n\n只有一位超越人类、至善的上帝才能为客观道德提供基础。我们内心深处知道某些事情是绝对错误的（比如无辜儿童被虐待）——这种道德直觉是最有力的证据，指向一位道德的上帝。",
    "detailed_answer_en": "We fully acknowledge that non-believers can do good — the Bible says God's law is written on all hearts (Rom 2:15). The issue isn't behavioral but foundational.\n\nWithout God, morality has no objective basis. You say murder is wrong, but why? If morality is merely an evolutionary product, it's just a survival instinct — no real 'right or wrong.' If morality is just a social convention, different societies have different standards with none being more 'right.'\n\nOnly a transcendent, perfectly good God can ground objective morality. Deep down we know some things are absolutely wrong (like abusing innocent children) — this moral intuition is powerful evidence pointing to a moral God.",
    "bible_verses": ["Romans 2:14-15", "Genesis 1:27", "Psalm 14:1", "Micah 6:8"],
    "related_readings": ["Mere Christianity Book 1 (C.S. Lewis)", "The Reason for God Ch.9 (Tim Keller)"],
    "tags": ["morality", "ethics", "beginner"]
  },
  {
    "id": "q018",
    "category": "moral_foundation",
    "question_zh": "基督教不是压迫人的工具吗？历史上制造了多少罪恶？",
    "question_en": "Isn't Christianity a tool of oppression? Look at all the evil done in its name throughout history.",
    "short_answer_zh": "以基督之名做的恶事恰恰违背了基督的教导。不应该因为仿冒品而否定真品。同时，基督教也是废奴、教育、医疗、人权运动的最大推动力。",
    "short_answer_en": "Evil done in Christ's name directly contradicts Christ's teaching. We shouldn't reject the genuine because of counterfeits. Meanwhile, Christianity has been the greatest force behind abolition, education, healthcare, and human rights.",
    "detailed_answer_zh": "这是一个重要的问题，我们不应该回避。十字军东征、宗教裁判所、殖民主义中的暴行——这些都是以基督之名犯下的真实罪恶，基督徒应当为此深感痛心和忏悔。\n\n但两个关键区别需要注意：\n\n第一，这些行为直接违背了耶稣的教导。评判基督教应该根据基督本人，而不是那些违背祂教导的人。\n\n第二，历史记录远比通常描述的更复杂。基督教建立了第一批医院、大学、孤儿院。废奴运动由威伯力等基督徒领导。马丁·路德·金的民权运动源于基督教信仰。现代科学在基督教文明中诞生。没有任何世俗意识形态产生了如此多的积极贡献。",
    "detailed_answer_en": "This is an important question we shouldn't avoid. The Crusades, Inquisition, colonial atrocities — these are real evils committed in Christ's name, and Christians should grieve and repent deeply.\n\nBut two critical distinctions matter:\n\nFirst, these actions directly contradicted Jesus's teaching. Christianity should be judged by Christ Himself, not by those who violated His teaching.\n\nSecond, the historical record is far more complex than commonly portrayed. Christianity built the first hospitals, universities, and orphanages. The abolition movement was led by Christians like Wilberforce. Martin Luther King Jr.'s civil rights movement was rooted in Christian faith. Modern science was born in Christian civilization. No secular ideology has produced as many positive contributions.",
    "bible_verses": ["Matthew 7:21-23", "Matthew 5:44", "John 13:35", "Galatians 5:22-23"],
    "related_readings": ["The Reason for God Ch.4 (Tim Keller)", "How Christianity Changed the World (Alvin Schmidt)"],
    "tags": ["history", "church", "apologetics", "intermediate"]
  },
  {
    "id": "q019",
    "category": "uniqueness_of_jesus",
    "question_zh": "条条大路通罗马——所有宗教不是殊途同归吗？",
    "question_en": "All roads lead to Rome — don't all religions lead to the same place?",
    "short_answer_zh": "表面上听起来很宽容，但实际上各宗教对核心问题的回答截然不同。说它们都一样，反而是对每种宗教的不尊重。",
    "short_answer_en": "It sounds tolerant on the surface, but religions give radically different answers to core questions. Saying they're all the same actually disrespects each one.",
    "detailed_answer_zh": "各宗教对最根本的问题给出了互相矛盾的答案：\n\n- 上帝：基督教说一位位格的三一上帝；伊斯兰说独一的安拉；佛教说无神或非位格的终极实在；印度教说多神或泛神\n- 人的问题：基督教说是罪；佛教说是苦和无明；印度教说是无知（摩耶）\n- 解决方案：基督教说是恩典；伊斯兰说是顺服；佛教说是觉悟；印度教说是修行\n\n这些不可能都是对的。说它们「殊途同归」要么是不了解它们的实际教导，要么是在做一个更大的宗教宣称——「我知道所有宗教的终极真理」，而这本身就是一种宗教立场。\n\n真正的宽容不是说「你们都一样」，而是尊重差异，寻求真理。",
    "detailed_answer_en": "Religions give mutually contradictory answers to the most fundamental questions:\n\n- God: Christianity says one personal Triune God; Islam says one Allah; Buddhism says no god or an impersonal ultimate; Hinduism says many gods or pantheism\n- Human problem: Christianity says sin; Buddhism says suffering and ignorance; Hinduism says illusion (maya)\n- Solution: Christianity says grace; Islam says submission; Buddhism says enlightenment; Hinduism says practice\n\nThese cannot all be right. Saying they 'all lead to the same place' either shows ignorance of their actual teachings or makes an even bigger religious claim — 'I know the ultimate truth about all religions' — which is itself a religious position.\n\nTrue tolerance isn't saying 'you're all the same' but respecting differences while seeking truth.",
    "bible_verses": ["John 14:6", "Acts 4:12", "1 Timothy 2:5"],
    "related_readings": ["The Reason for God Ch.1 (Tim Keller)", "Jesus Among Other Gods (Ravi Zacharias)"],
    "tags": ["pluralism", "religions", "beginner"]
  },
  {
    "id": "q020",
    "category": "bible_reliability",
    "question_zh": "圣经不是经过多次翻译和修改吗？原文早就失传了吧？",
    "question_en": "Hasn't the Bible been translated and altered many times? The original must be long lost.",
    "short_answer_zh": "现代圣经是从最古老的希伯来文和希腊文手抄本直接翻译的，不是从翻译的翻译。我们有超过5800份希腊文新约手抄本，远超任何古代文献。",
    "short_answer_en": "Modern Bibles are translated directly from the oldest Hebrew and Greek manuscripts, not from translations of translations. We have over 5,800 Greek New Testament manuscripts, far exceeding any other ancient document.",
    "detailed_answer_zh": "这是一个常见的误解。现代圣经翻译是从最古老的原文手抄本直接翻译的，不是经过层层翻译。圣经学者可以直接接触数千份古代手抄本。\n\n新约的文本证据无与伦比：\n- 超过5800份希腊文手抄本\n- 超过10000份拉丁文手抄本\n- 最早的手抄本片段距原作不到100年\n\n相比之下，我们对荷马、柏拉图等古典作品的信心基于远少得多的手抄本和更大的时间间隔，但没有人质疑它们的文本可靠性。\n\n1947年发现的死海古卷包含了几乎完整的以赛亚书，比之前最早的手抄本早1000年，但内容几乎完全一致。这证明了圣经传抄的惊人准确性。",
    "detailed_answer_en": "This is a common misconception. Modern Bible translations work directly from the oldest original-language manuscripts, not through layers of translation. Biblical scholars have direct access to thousands of ancient manuscripts.\n\nThe textual evidence for the New Testament is unparalleled:\n- Over 5,800 Greek manuscripts\n- Over 10,000 Latin manuscripts\n- The earliest manuscript fragments date within 100 years of the originals\n\nBy comparison, our confidence in Homer, Plato, and other classical works rests on far fewer manuscripts with much larger time gaps, yet no one questions their textual reliability.\n\nThe Dead Sea Scrolls discovered in 1947 contained a nearly complete book of Isaiah, 1,000 years older than the previous oldest manuscript, yet virtually identical in content. This demonstrates the remarkable accuracy of biblical transmission.",
    "bible_verses": ["Isaiah 40:8", "Matthew 24:35", "1 Peter 1:25"],
    "related_readings": ["Can We Trust the Gospels? (Peter Williams)", "The New Testament Documents: Are They Reliable? (F.F. Bruce)"],
    "tags": ["bible", "manuscripts", "textual_criticism", "intermediate"]
  },
  {
    "id": "q021",
    "category": "trinity",
    "question_zh": "什么是三位一体？一个上帝怎么同时是三个位格？",
    "question_en": "What is the Trinity? How can one God be three persons?",
    "short_answer_zh": "三位一体是说上帝在本质上是一位，但在位格上是三位——圣父、圣子、圣灵。三个位格同等永恒、同等尊荣，共享同一个神圣本质。",
    "short_answer_en": "The Trinity means God is one in essence but three in persons — Father, Son, and Holy Spirit. The three persons are co-eternal, co-equal, and share one divine nature.",
    "detailed_answer_zh": "三位一体是基督教最核心也最独特的教义。它不是说有三个上帝（三神论），也不是说一个上帝扮演三种角色（形态论），而是说一个上帝永恒地存在为三个彼此不同但完全合一的位格。\n\n圣经没有直接使用「三位一体」这个词，但处处彰显这个真理：圣父差遣圣子（约3:16），圣子顺服圣父（约6:38），圣灵被圣父和圣子差遣（约14:26, 15:26）。在耶稣受洗时，三个位格同时显现（太3:16-17）。大使命中耶稣命令奉「父、子、圣灵的名」施洗——注意是单数的「名」，表明三位共享一个神圣本质。\n\n三位一体告诉我们，上帝在创造世界之前就在自身内部拥有完美的爱和团契关系。上帝不需要创造我们来满足祂对关系的需要——祂创造我们是出于丰盛的爱的溢出。",
    "detailed_answer_en": "The Trinity is Christianity's most central and distinctive doctrine. It does not mean three gods (tritheism), nor one God playing three roles (modalism), but one God eternally existing as three distinct yet fully united persons.\n\nThe Bible doesn't use the word 'Trinity' directly, but reveals this truth throughout: the Father sends the Son (John 3:16), the Son submits to the Father (John 6:38), the Spirit is sent by the Father and the Son (John 14:26, 15:26). At Jesus's baptism, all three persons appear simultaneously (Matt 3:16-17). In the Great Commission, Jesus commands baptism in the 'name' (singular) of Father, Son, and Holy Spirit — the singular 'name' indicates the three share one divine essence.\n\nThe Trinity tells us that before creating the world, God already possessed perfect love and fellowship within Himself. God didn't need to create us to fulfill a need for relationship — He created us out of the overflow of His abundant love.",
    "bible_verses": ["Matthew 28:19", "Matthew 3:16-17", "2 Corinthians 13:14", "John 1:1-3", "Genesis 1:26"],
    "related_readings": ["Mere Christianity Book 4, Ch.2 (C.S. Lewis)", "The Forgotten Trinity (James White)", "Systematic Theology Ch.14 (Wayne Grudem)"],
    "tags": ["trinity", "theology", "intermediate"]
  },
  {
    "id": "q022",
    "category": "trinity",
    "question_zh": "三位一体的三个位格之间是什么关系？",
    "question_en": "What is the relationship between the three persons of the Trinity?",
    "short_answer_zh": "圣父、圣子、圣灵在永恒中彼此相爱、彼此荣耀。圣父计划救恩，圣子成就救恩，圣灵施行救恩——三个位格在完美合一中各有不同的角色。",
    "short_answer_en": "Father, Son, and Spirit eternally love and glorify one another. The Father plans salvation, the Son accomplishes it, the Spirit applies it — three persons with distinct roles in perfect unity.",
    "detailed_answer_zh": "三位一体内部的关系是神学家所说的「内在三一」（ontological Trinity）。圣父从永恒生了圣子，圣灵从圣父和圣子而出——这不是时间上的先后，而是永恒关系的描述。三个位格在本质、权能、荣耀上完全平等。\n\n在救赎的工作中，我们看到「经世三一」（economic Trinity）：圣父计划和差遣，圣子道成肉身、受死、复活，圣灵使人重生、内住、成圣。这种分工不意味着不平等，正如一个家庭中不同的角色不意味着不同的价值。\n\n最令人惊叹的是，三位一体的上帝邀请我们进入祂们之间的爱的关系。耶稣在约翰福音17章的祷告中求天父，「使他们合而为一，正如我们合而为一」。救恩的目标不仅是免去刑罚，更是被接纳进入三位一体永恒的爱中。",
    "detailed_answer_en": "The inner-Trinitarian relationship is what theologians call the 'ontological Trinity.' The Father eternally begets the Son, and the Spirit proceeds from the Father and the Son — not a temporal sequence but a description of eternal relationships. The three persons are fully equal in essence, power, and glory.\n\nIn the work of redemption, we see the 'economic Trinity': the Father plans and sends, the Son becomes incarnate, dies, and rises, the Spirit regenerates, indwells, and sanctifies. This division of labor doesn't imply inequality, just as different roles in a family don't imply different worth.\n\nMost amazingly, the Triune God invites us into their loving relationship. In Jesus's prayer in John 17, He asks the Father 'that they may be one, just as we are one.' Salvation's goal is not merely escape from punishment but being welcomed into the eternal love of the Trinity.",
    "bible_verses": ["John 17:21-23", "John 15:26", "John 16:13-15", "1 Corinthians 8:6", "Ephesians 1:3-14"],
    "related_readings": ["Delighting in the Trinity (Michael Reeves)", "The Deep Things of God (Fred Sanders)"],
    "tags": ["trinity", "theology", "intermediate"]
  },
  {
    "id": "q023",
    "category": "trinity",
    "question_zh": "耶稣是上帝吗？圣经真的这样教导吗？",
    "question_en": "Is Jesus God? Does the Bible really teach this?",
    "short_answer_zh": "是的。圣经从多个角度确认耶稣的神性：祂自称与父同等，接受敬拜，行使只有上帝才有的权柄，并且被称为上帝。",
    "short_answer_en": "Yes. The Bible affirms Jesus's deity from multiple angles: He claimed equality with the Father, received worship, exercised authority belonging only to God, and was called God.",
    "detailed_answer_zh": "耶稣的神性是基督教信仰的根基。约翰福音开篇宣告：「太初有道，道与上帝同在，道就是上帝」（约1:1）。耶稣自称「我就是」（约8:58），这是旧约中上帝的自称（出3:14），在场的犹太人立刻明白祂在宣称自己是上帝，要拿石头打祂。\n\n耶稣赦免罪（可2:5-7），这是只有上帝才能做的事。祂接受敬拜（太14:33, 28:9），如果祂不是上帝，这就是亵渎。祂宣称有审判全人类的权柄（约5:22-27）。多马在复活后向祂说：「我的主！我的上帝！」（约20:28），耶稣没有纠正他。\n\n保罗、彼得、希伯来书的作者也都明确教导耶稣是上帝（腓2:6, 彼后1:1, 来1:8）。尼西亚信经正式确认了这个从使徒时代就有的信仰：耶稣基督是「真上帝出于真上帝」。",
    "detailed_answer_en": "Jesus's deity is the foundation of Christian faith. John's Gospel opens declaring: 'In the beginning was the Word, and the Word was with God, and the Word was God' (John 1:1). Jesus called Himself 'I AM' (John 8:58), God's self-designation in the Old Testament (Exodus 3:14) — the Jews present immediately understood He was claiming to be God and picked up stones.\n\nJesus forgave sins (Mark 2:5-7), something only God can do. He accepted worship (Matt 14:33, 28:9) — if He weren't God, this would be blasphemy. He claimed authority to judge all humanity (John 5:22-27). Thomas said to the risen Jesus, 'My Lord and my God!' (John 20:28), and Jesus didn't correct him.\n\nPaul, Peter, and the author of Hebrews all explicitly teach Jesus is God (Phil 2:6, 2 Pet 1:1, Heb 1:8). The Nicene Creed formally affirmed what was believed from apostolic times: Jesus Christ is 'true God from true God.'",
    "bible_verses": ["John 1:1", "John 8:58", "John 20:28", "Philippians 2:5-7", "Hebrews 1:8", "Colossians 2:9"],
    "related_readings": ["Mere Christianity Book 2, Ch.3 (C.S. Lewis)", "The Case for Christ Ch.6-8 (Lee Strobel)", "Putting Jesus in His Place (Bowman & Komoszewski)"],
    "tags": ["jesus", "deity", "christology", "beginner"]
  },
  {
    "id": "q024",
    "category": "trinity",
    "question_zh": "如果耶稣是上帝，祂在十字架上死的时候，上帝也死了吗？",
    "question_en": "If Jesus is God, did God die when Jesus died on the cross?",
    "short_answer_zh": "耶稣的死是按人性而言的死。上帝的神性本质不会死亡，但圣子真实地经历了人性的死亡，这赋予十字架无限的价值。",
    "short_answer_en": "Jesus's death was a death according to His human nature. The divine nature cannot die, but the Son truly experienced human death, giving the cross infinite value.",
    "detailed_answer_zh": "这个问题触及基督论中最深奥的奥秘——二性一位格（hypostatic union）。耶稣基督是一个位格拥有两个完整的本性：完全的神性和完全的人性。这两个本性在一个位格中联合，但不混淆、不改变、不分割、不分离。\n\n在十字架上，死的是耶稣基督这个位格，按照祂的人性而死。神性本质是不灭的、永恒的，不会经历死亡。然而，因为是神性的位格（圣子）在受苦和死亡，十字架的牺牲就具有无限的价值和功效——足以赎买全人类的罪。\n\n这也意味着在那三天里，三位一体并没有「缺了一位」。圣子的神性从未与圣父和圣灵分离。但圣子确实在人性中经历了真实的死亡和埋葬，然后在第三天以复活的荣耀身体从死里复活。",
    "detailed_answer_en": "This touches the deepest mystery in Christology — the hypostatic union. Jesus Christ is one person possessing two complete natures: full deity and full humanity. These two natures are united in one person without confusion, change, division, or separation.\n\nOn the cross, it was the person of Jesus Christ who died according to His human nature. The divine nature is immortal and eternal and cannot experience death. Yet because it was a divine person (the Son) who suffered and died, the sacrifice of the cross has infinite value and efficacy — sufficient to atone for all humanity's sin.\n\nThis also means the Trinity was not 'missing a member' during those three days. The Son's divine nature was never separated from the Father and Spirit. But the Son truly experienced real death and burial in His humanity, then rose on the third day in a glorified resurrection body.",
    "bible_verses": ["Acts 20:28", "1 Timothy 3:16", "Romans 1:3-4", "Philippians 2:7-8", "1 Peter 3:18"],
    "related_readings": ["The Person of Christ (Donald Macleod)", "Systematic Theology Ch.26 (Wayne Grudem)"],
    "tags": ["trinity", "christology", "cross", "advanced"]
  },
  {
    "id": "q025",
    "category": "predestination",
    "question_zh": "什么是预定论？上帝预定了谁得救谁灭亡吗？",
    "question_en": "What is predestination? Did God predetermine who would be saved and who would perish?",
    "short_answer_zh": "圣经教导上帝在创世之前就拣选了一些人得救。这不是出于人的功德，而是出于上帝主权的恩典。预定论彰显的是上帝恩典的伟大，而非祂的残忍。",
    "short_answer_en": "The Bible teaches that God chose certain people for salvation before creation. This is not based on human merit but on God's sovereign grace. Predestination reveals the greatness of God's grace, not cruelty.",
    "detailed_answer_zh": "预定论是圣经明确教导的真理。以弗所书1:4-5说：「就如上帝从创立世界以前，在基督里拣选了我们……又因爱我们，就按着自己意旨所喜悦的，预定我们借着耶稣基督得儿子的名分。」罗马书9:11-13也清楚地说，拣选不在乎人的行为，而在乎上帝的旨意。\n\n许多人觉得这不公平，但我们需要记住：所有人都犯了罪，没有人配得救恩。如果上帝按公平对待每一个人，所有人都会灭亡。真正的问题不是「为什么上帝不拯救所有人」，而是「为什么上帝竟然拯救了任何人」。预定论教导我们，救恩完全是恩典——从头到尾都是上帝的工作。\n\n同时，圣经也教导人有真实的责任。人得救是因为上帝的拣选，人灭亡是因为自己的罪。这两个真理在我们有限的理解中似乎矛盾，但在上帝无限的智慧中是和谐的。",
    "detailed_answer_en": "Predestination is clearly taught in Scripture. Ephesians 1:4-5 says: 'He chose us in Christ before the foundation of the world...having predestined us for adoption as sons through Jesus Christ, according to the purpose of His will.' Romans 9:11-13 also makes clear that election depends not on works but on God's purpose.\n\nMany feel this is unfair, but we must remember: all have sinned, and no one deserves salvation. If God treated everyone fairly, all would perish. The real question isn't 'why doesn't God save everyone' but 'why does God save anyone at all.' Predestination teaches that salvation is entirely grace — God's work from beginning to end.\n\nAt the same time, Scripture also teaches genuine human responsibility. People are saved because of God's election; people perish because of their own sin. These two truths may seem contradictory to our finite minds, but they are harmonious in God's infinite wisdom.",
    "bible_verses": ["Ephesians 1:4-5", "Romans 9:11-16", "Romans 8:29-30", "John 6:44", "Acts 13:48"],
    "related_readings": ["Chosen by God (R.C. Sproul)", "The Doctrines of Grace (James Boice)", "Systematic Theology Ch.32 (Wayne Grudem)"],
    "tags": ["predestination", "election", "reformed", "advanced"]
  },
  {
    "id": "q026",
    "category": "predestination",
    "question_zh": "如果上帝已经预定了，人还有自由意志吗？传福音还有意义吗？",
    "question_en": "If God has already predestined everything, do humans have free will? Is evangelism still meaningful?",
    "short_answer_zh": "上帝的主权和人的责任在圣经中并行不悖。上帝不仅预定了目的（谁得救），也预定了方法（通过传福音和信心）。传福音正是上帝拯救选民的途径。",
    "short_answer_en": "God's sovereignty and human responsibility run parallel in Scripture. God predestines not only the end (who is saved) but also the means (through evangelism and faith). Evangelism is precisely God's means of saving His elect.",
    "detailed_answer_zh": "这是对预定论最常见的质疑，但它基于一个错误的假设：如果上帝掌管一切，人就没有真实的选择。圣经不是这样教导的。圣经既教导上帝的绝对主权（弗1:11），也教导人的真实责任（徒2:38）。\n\n使徒保罗比任何人都更确信预定论（罗马书8-9章），但他也是历史上最热心的传道人。他在罗马书10:14问：「没有传道的，怎能听见呢？」上帝预定的不仅是哪些人得救，还包括他们如何得救——就是通过听福音而信。\n\n实际上，预定论给传福音提供了最大的动力和信心。我们知道上帝的道不会徒然返回（赛55:11），知道我们的努力不会白费。我们传福音不是在做一件可能无效的事，而是在参与上帝必定成就的计划。",
    "detailed_answer_en": "This is the most common objection to predestination, but it rests on a false assumption: if God controls everything, humans have no real choice. Scripture doesn't teach this. It teaches both God's absolute sovereignty (Eph 1:11) and genuine human responsibility (Acts 2:38).\n\nThe apostle Paul was more convinced of predestination than anyone (Romans 8-9), yet he was history's most zealous evangelist. He asks in Romans 10:14, 'How can they hear without someone preaching?' God predestines not only who will be saved but how — through hearing the gospel and believing.\n\nIn fact, predestination provides the greatest motivation and confidence for evangelism. We know God's word will not return void (Isa 55:11), and our labor is not in vain. We're not doing something that might fail but participating in God's certain plan.",
    "bible_verses": ["Romans 10:14-17", "Isaiah 55:11", "Acts 18:9-10", "2 Timothy 2:10", "Ephesians 1:11"],
    "related_readings": ["Evangelism and the Sovereignty of God (J.I. Packer)", "Chosen by God Ch.8 (R.C. Sproul)"],
    "tags": ["predestination", "evangelism", "free_will", "advanced"]
  },
  {
    "id": "q027",
    "category": "predestination",
    "question_zh": "加尔文主义的「五要点」（TULIP）是什么意思？",
    "question_en": "What do the 'Five Points of Calvinism' (TULIP) mean?",
    "short_answer_zh": "TULIP概括了改革宗对救恩的理解：全然败坏、无条件拣选、有限救赎、不可抗拒的恩典、圣徒永蒙保守。核心信息是：救恩从始至终都是上帝的工作。",
    "short_answer_en": "TULIP summarizes the Reformed understanding of salvation: Total Depravity, Unconditional Election, Limited Atonement, Irresistible Grace, Perseverance of the Saints. The core message: salvation is God's work from start to finish.",
    "detailed_answer_zh": "TULIP源于1618年多特会议对阿民念主义的回应：\n\n全然败坏（Total Depravity）：不是说人坏到不能再坏，而是说罪影响了人的每一个方面——理智、情感、意志——以至于人不能也不愿意主动寻求上帝。\n\n无条件拣选（Unconditional Election）：上帝拣选人不是因为预见他们会信，而是出于祂主权的恩典和美意。\n\n有限救赎（Limited Atonement）：更好的说法是「特定救赎」——基督的死不仅使救恩成为可能，而是实际地确保了被拣选之人的救恩。\n\n不可抗拒的恩典（Irresistible Grace）：上帝有效地呼召被拣选的人，圣灵改变他们的心，使他们甘心乐意地来到基督面前。\n\n圣徒永蒙保守（Perseverance of the Saints）：真正得救的人不会最终失落。上帝保守他们到底。\n\n这五点不是五个独立的教义，而是一个完整的救恩叙事：因为人完全堕落，所以需要上帝主动拣选；因为是上帝拣选，所以基督为他们有效地死了；因为基督的死是有效的，所以圣灵必然吸引他们；因为是上帝的工作，所以他们必蒙保守。",
    "detailed_answer_en": "TULIP originated from the 1618 Synod of Dort in response to Arminianism:\n\nTotal Depravity: Not that people are as bad as possible, but that sin affects every aspect — mind, emotions, will — so that people cannot and will not seek God on their own.\n\nUnconditional Election: God chooses people not because He foresees their faith, but out of His sovereign grace and good pleasure.\n\nLimited Atonement: Better termed 'definite atonement' — Christ's death didn't merely make salvation possible but actually secured salvation for the elect.\n\nIrresistible Grace: God effectually calls the elect; the Spirit changes their hearts so they come to Christ willingly and gladly.\n\nPerseverance of the Saints: Those truly saved will not ultimately fall away. God preserves them to the end.\n\nThese five points aren't independent doctrines but one coherent salvation narrative: because people are totally depraved, God must initiate election; because God elects, Christ dies effectively for them; because Christ's death is effective, the Spirit inevitably draws them; because it's God's work, they are surely preserved.",
    "bible_verses": ["Romans 3:10-12", "Ephesians 1:4-5", "John 10:11", "John 6:37", "Philippians 1:6"],
    "related_readings": ["The Five Points of Calvinism (David Steele & Curtis Thomas)", "What is Reformed Theology? (R.C. Sproul)"],
    "tags": ["calvinism", "reformed", "tulip", "advanced"]
  },
  {
    "id": "q028",
    "category": "authority_of_scripture",
    "question_zh": "圣经的权威性是什么意思？为什么基督徒把圣经看得那么重要？",
    "question_en": "What does the authority of Scripture mean? Why do Christians value the Bible so highly?",
    "short_answer_zh": "圣经的权威性是指它作为上帝的话语，是信仰和生活的最高准则。圣经不仅包含上帝的话，它本身就是上帝的话。",
    "short_answer_en": "The authority of Scripture means that as God's Word, it is the supreme standard for faith and life. The Bible doesn't merely contain God's words — it is God's Word.",
    "detailed_answer_zh": "改革宗神学强调「唯独圣经」（Sola Scriptura）——圣经是信仰和实践的最终权威。这不是说其他来源（传统、理性、经验）没有价值，而是说当它们与圣经冲突时，圣经拥有最终的裁决权。\n\n圣经的权威性建立在它的来源上：它是上帝所默示的（提后3:16）。因为上帝不会说谎（多1:2），祂的话就是完全可信、完全充足的。威斯敏斯特信条教导，圣经是「信仰与生活的唯一准则」。\n\n这也意味着圣经不需要外部的认证来获得权威。正如光不需要证明自己的存在，圣经因着它是上帝的话，就自带权威。圣灵在信徒心中做见证，使他们确信圣经的神圣来源。这被称为圣灵的内在见证（testimonium internum Spiritus Sancti）。",
    "detailed_answer_en": "Reformed theology emphasizes 'Sola Scriptura' — Scripture is the ultimate authority for faith and practice. This doesn't mean other sources (tradition, reason, experience) have no value, but that when they conflict with Scripture, the Bible has final say.\n\nScripture's authority rests on its source: it is God-breathed (2 Tim 3:16). Because God cannot lie (Titus 1:2), His Word is entirely trustworthy and sufficient. The Westminster Confession teaches that Scripture is 'the only rule of faith and practice.'\n\nThis also means Scripture needs no external validation to possess authority. Just as light needs no proof of its existence, Scripture carries inherent authority because it is God's Word. The Holy Spirit testifies in believers' hearts, confirming Scripture's divine origin. This is called the internal testimony of the Holy Spirit (testimonium internum Spiritus Sancti).",
    "bible_verses": ["2 Timothy 3:16-17", "Titus 1:2", "Psalm 119:105", "2 Peter 1:20-21", "John 10:35"],
    "related_readings": ["God's Word (R.C. Sproul)", "The Doctrine of the Word of God (John Frame)", "Systematic Theology Ch.4-8 (Wayne Grudem)"],
    "tags": ["scripture", "authority", "sola_scriptura", "intermediate"]
  },
  {
    "id": "q029",
    "category": "authority_of_scripture",
    "question_zh": "圣经是无误的吗？如果有科学或历史上的「错误」怎么办？",
    "question_en": "Is the Bible inerrant? What about apparent scientific or historical 'errors'?",
    "short_answer_zh": "圣经无误是说圣经在其原稿中、按照作者的原意和文体来理解时，所教导的一切都是真实的、没有错误的。",
    "short_answer_en": "Biblical inerrancy means that in its original manuscripts, understood according to the authors' intent and literary genre, everything Scripture teaches is true and without error.",
    "detailed_answer_zh": "圣经无误论（inerrancy）是改革宗传统的核心信念，它并不意味着用现代科学教科书的标准来衡量圣经。圣经无误论的正确理解是：圣经在其原稿中所肯定、所教导的一切，按照每卷书的文体和作者意图来理解，都是完全真实的。\n\n例如，圣经说「太阳升起」不是科学错误——这是使用日常语言的现象性描述，就像我们今天仍然说「日出」。诗篇说「树木拍掌」不是植物学错误——这是诗歌的拟人修辞。判断一段经文的含义，首先要理解它的文体。\n\n对于真正困难的经文——比如看似矛盾的数字记载——我们应当承认可能是传抄过程中的细微变化，或者是我们对古代文化和表达方式的了解不足。但整体而言，考古学和历史研究不断印证圣经的可靠性，这给了我们充分理由信任那些我们尚未完全理解的部分。",
    "detailed_answer_en": "Biblical inerrancy is a core Reformed conviction, but it doesn't mean measuring the Bible by modern science textbook standards. Properly understood, inerrancy means: everything Scripture affirms and teaches in its original manuscripts, understood according to each book's genre and authorial intent, is completely true.\n\nFor example, the Bible saying 'the sun rises' is not a scientific error — it's phenomenological language, just as we still say 'sunrise' today. Psalms saying 'trees clap their hands' is not a botanical error — it's poetic personification. Determining a passage's meaning requires first understanding its genre.\n\nFor genuinely difficult texts — like seemingly contradictory numerical accounts — we should acknowledge possible minor variations in transmission or our insufficient knowledge of ancient culture and expression. But overall, archaeology and historical research continually confirm biblical reliability, giving us ample reason to trust parts we don't yet fully understand.",
    "bible_verses": ["Psalm 12:6", "Proverbs 30:5", "John 17:17", "Numbers 23:19", "Psalm 119:160"],
    "related_readings": ["Chicago Statement on Biblical Inerrancy (ICBI)", "Scripture Alone (R.C. Sproul)", "The Inerrancy of Scripture (various authors)"],
    "tags": ["inerrancy", "scripture", "authority", "advanced"]
  },
  {
    "id": "q030",
    "category": "authority_of_scripture",
    "question_zh": "为什么有66卷书被收入圣经正典？是教会决定的吗？",
    "question_en": "Why are there 66 books in the biblical canon? Did the church decide this?",
    "short_answer_zh": "教会不是赋予这些书权威，而是认出了它们已有的权威。正典的形成是圣灵引导的过程，教会只是确认了哪些书具有使徒权威和上帝默示的特征。",
    "short_answer_en": "The church didn't give these books authority but recognized authority they already possessed. Canon formation was a Spirit-guided process; the church simply confirmed which books bore the marks of apostolic authority and divine inspiration.",
    "detailed_answer_zh": "一个常见的误解是教会在某次会议上「选定」了哪些书入选圣经。实际上，这些书从写成之日起就被早期教会视为上帝的话语。正典的形成不是发明，而是确认。\n\n早期教会使用几个标准来辨别正典：使徒性（是否由使徒或使徒的同伴写成？）、正统性（是否与已知的使徒教导一致？）、普世性（是否被各地教会广泛接受？）、默示性（是否具有上帝话语的能力和特征？）。\n\n到主后200年左右，新约27卷书中的大部分已经被教会普遍接受。后来的会议（如主后397年迦太基会议）不过是正式确认了教会已经在实践中认可的清单。上帝通过圣灵引导祂的教会认出了祂的话语，正如耶稣所说：「我的羊听我的声音」（约10:27）。",
    "detailed_answer_en": "A common misconception is that the church 'selected' which books to include at some council. In reality, these books were recognized as God's Word from the moment they were written. Canon formation was not invention but recognition.\n\nThe early church used several criteria to identify canonical books: apostolicity (written by an apostle or apostolic companion?), orthodoxy (consistent with known apostolic teaching?), catholicity (widely accepted across churches?), and inspiration (does it bear the power and characteristics of God's Word?).\n\nBy around AD 200, most of the 27 New Testament books were universally accepted. Later councils (like Carthage in AD 397) merely formally confirmed what the church had already recognized in practice. God guided His church through the Holy Spirit to recognize His Word, just as Jesus said: 'My sheep hear my voice' (John 10:27).",
    "bible_verses": ["John 10:27", "2 Peter 3:15-16", "1 Thessalonians 2:13", "Revelation 22:18-19"],
    "related_readings": ["The Canon of Scripture (F.F. Bruce)", "Question of Canon (Michael Kruger)"],
    "tags": ["canon", "scripture", "church_history", "intermediate"]
  },
  {
    "id": "q031",
    "category": "church",
    "question_zh": "为什么要去教会？我自己在家读圣经不行吗？",
    "question_en": "Why go to church? Can't I just read the Bible at home?",
    "short_answer_zh": "基督教从本质上是群体性的信仰。上帝不只是拯救个人，而是在建造一个身体——教会。独自信仰就像一块脱离身体的肢体，无法健康成长。",
    "short_answer_en": "Christianity is inherently communal. God doesn't just save individuals — He's building a body, the church. Solitary faith is like a limb detached from the body; it cannot grow healthily.",
    "detailed_answer_zh": "希伯来书10:25明确说：「不可停止聚会，好像那些停止惯了的人。」这不是一条随意的规定，而是反映了一个深刻的神学真理：基督徒不是一群碰巧信同一件事的个体，而是基督的身体，每个人都是不可或缺的肢体。\n\n保罗在哥林多前书12章生动地说明：眼睛不能对手说「我不需要你」。我们需要彼此的恩赐、勉励、督责和关爱。基督徒灵命的成长需要在群体中操练信心、学习谦卑、练习爱人、接受教导。\n\n此外，教会是基督设立的圣礼——洗礼和圣餐——的施行场所。这些是上帝恩典的可见标记，是在群体中才能领受的。独自信仰不是不可能，但那是残缺的、危险的信仰。一根燃烧的炭火离开炭堆，很快就会熄灭。",
    "detailed_answer_en": "Hebrews 10:25 explicitly says: 'Do not forsake the assembling of yourselves together, as is the manner of some.' This isn't an arbitrary rule but reflects a profound theological truth: Christians aren't individuals who happen to believe the same thing — they are Christ's body, each an indispensable member.\n\nPaul vividly illustrates in 1 Corinthians 12: the eye cannot say to the hand, 'I don't need you.' We need each other's gifts, encouragement, accountability, and care. Spiritual growth requires practicing faith, learning humility, exercising love, and receiving teaching in community.\n\nFurthermore, the church is where Christ-instituted sacraments — baptism and the Lord's Supper — are administered. These are visible signs of God's grace, received within community. Solitary faith isn't impossible, but it's incomplete and dangerous. A burning coal separated from the fire quickly goes cold.",
    "bible_verses": ["Hebrews 10:24-25", "1 Corinthians 12:12-27", "Ephesians 4:11-16", "Acts 2:42-47"],
    "related_readings": ["Life Together (Dietrich Bonhoeffer)", "The Trellis and the Vine (Colin Marshall)"],
    "tags": ["church", "community", "beginner"]
  },
  {
    "id": "q032",
    "category": "church",
    "question_zh": "为什么基督教有这么多宗派？哪个才是对的？",
    "question_en": "Why are there so many Christian denominations? Which one is right?",
    "short_answer_zh": "宗派的存在反映了人类的有限和罪性，但核心信仰上大多数正统教会是一致的。重要的是分辨核心教义和次要问题之间的区别。",
    "short_answer_en": "Denominations reflect human finitude and sinfulness, but most orthodox churches agree on core beliefs. The key is distinguishing between essential doctrines and secondary matters.",
    "detailed_answer_zh": "宗派的数量确实令人困惑，但我们需要做一个重要的区分。在核心教义上——三位一体、基督的神人二性、因信称义、圣经的权威、基督的复活——所有正统基督教宗派都是一致的。这些由使徒信经、尼西亚信经等古代信条所表达的真理，是「大公信仰」的基础。\n\n宗派的分歧主要在次要问题上：教会治理的方式（长老制、主教制、会众制）、洗礼的模式（浸水礼还是点水礼）、对末世的理解（千禧年前派还是后派）等。这些问题重要，但不涉及救恩的根基。\n\n奥古斯丁曾说：「在核心事务上合一，在非核心事务上自由，在一切事务上有爱。」宗派的存在并不否定基督教的真理，正如医学界不同流派的存在不否定医学本身。关键是找到一个忠于圣经、传讲福音的教会，在那里扎根成长。",
    "detailed_answer_en": "The number of denominations can be confusing, but an important distinction is needed. On core doctrines — the Trinity, Christ's two natures, justification by faith, biblical authority, Christ's resurrection — all orthodox Christian denominations agree. These truths, expressed in the Apostles' and Nicene Creeds, form the foundation of the 'catholic faith.'\n\nDenominational differences are mainly on secondary issues: church governance (presbyterian, episcopal, congregational), baptism mode (immersion or sprinkling), eschatology (premillennial or postmillennial), etc. These matter, but don't affect salvation's foundation.\n\nAugustine said: 'In essentials, unity; in non-essentials, liberty; in all things, charity.' Denominations don't negate Christian truth, just as different medical specialties don't negate medicine itself. The key is finding a church faithful to Scripture and the gospel, and putting down roots there.",
    "bible_verses": ["Ephesians 4:3-6", "1 Corinthians 1:10-13", "John 17:21", "Philippians 1:27"],
    "related_readings": ["Mere Christianity, Preface (C.S. Lewis)", "What is the Church? (R.C. Sproul)"],
    "tags": ["church", "denominations", "unity", "intermediate"]
  },
  {
    "id": "q033",
    "category": "church",
    "question_zh": "教会中也有虚伪和丑闻，这说明什么？",
    "question_en": "There is hypocrisy and scandal in the church. What does this say?",
    "short_answer_zh": "教会不是完美之人的俱乐部，而是需要恩典之人的医院。教会中有虚伪，恰恰证实了圣经关于罪的教导——即使信徒也在持续的成圣过程中。",
    "short_answer_en": "The church is not a club for perfect people but a hospital for those who need grace. Hypocrisy in the church actually confirms Scripture's teaching about sin — even believers are in an ongoing process of sanctification.",
    "detailed_answer_zh": "教会中的虚伪和丑闻确实令人痛心，我们绝不应该为之辩护或轻描淡写。耶稣本人对假冒伪善者的谴责比对任何其他类型的罪人都更严厉（太23章）。\n\n但我们需要认识到，教会从来就不是「完美之人的聚集」，而是「蒙恩罪人的团契」。医院里有病人不说明医学是假的——恰恰说明医院在做它该做的事。教会里有挣扎中的罪人，正说明了福音的必要性。\n\n同时，不要因为少数高调的丑闻就忽视了无数忠心牧师和信徒默默的服侍。全世界最大的慈善网络、救灾机构、教育系统很多都是由教会运作的。我们应该既对教会的软弱诚实，也对教会的美好公正。",
    "detailed_answer_en": "Hypocrisy and scandal in the church are genuinely grievous, and we should never excuse or minimize them. Jesus Himself was harsher toward hypocrites than toward any other type of sinner (Matthew 23).\n\nBut we must recognize the church was never meant to be a 'gathering of the perfect' but a 'fellowship of redeemed sinners.' Having sick people in a hospital doesn't prove medicine is fake — it shows the hospital is doing what it should. Having struggling sinners in the church demonstrates the necessity of the gospel.\n\nAt the same time, don't let a few high-profile scandals overshadow the countless faithful pastors and believers serving quietly. Many of the world's largest charitable networks, disaster relief organizations, and education systems are run by churches. We should be honest about the church's weaknesses and fair about its goodness.",
    "bible_verses": ["Matthew 23:27-28", "Matthew 9:12-13", "1 John 1:8-10", "Galatians 6:1-2"],
    "related_readings": ["The Reason for God Ch.4 (Tim Keller)", "Life Together (Dietrich Bonhoeffer)"],
    "tags": ["church", "hypocrisy", "apologetics", "beginner"]
  },
  {
    "id": "q034",
    "category": "sacraments",
    "question_zh": "什么是洗礼？洗礼是得救的条件吗？",
    "question_en": "What is baptism? Is baptism required for salvation?",
    "short_answer_zh": "洗礼是基督设立的圣礼，是信仰的外在标记和恩典之约的印记。洗礼不是得救的条件，但它是每个信徒应当顺服的命令。",
    "short_answer_en": "Baptism is a sacrament instituted by Christ, an outward sign of faith and seal of the covenant of grace. Baptism is not required for salvation, but it is a command every believer should obey.",
    "detailed_answer_zh": "耶稣在升天前命令门徒「奉父、子、圣灵的名给他们施洗」（太28:19）。洗礼是一个可见的记号，象征着与基督联合——与祂同死、同埋葬、同复活（罗6:3-4）。它也是进入有形教会的门。\n\n改革宗传统认为洗礼是恩典之约的记号和印记，类似于旧约中的割礼（西2:11-12）。因此，改革宗教会不仅为信徒施洗，也为信徒的孩子施洗，因为上帝的约包含信徒和他们的后裔。\n\n洗礼本身不能拯救人——十字架上的强盗没有受洗却得到耶稣的应许（路23:43）。但作为基督的命令，洗礼是信心的表达和顺服的行动，每个信徒都应当领受。洗礼的功效不在于水，而在于圣灵通过这个圣礼所做的工作。",
    "detailed_answer_en": "Before ascending, Jesus commanded His disciples to 'baptize them in the name of the Father and of the Son and of the Holy Spirit' (Matt 28:19). Baptism is a visible sign symbolizing union with Christ — dying, being buried, and rising with Him (Rom 6:3-4). It is also the entrance into the visible church.\n\nThe Reformed tradition views baptism as a sign and seal of the covenant of grace, analogous to circumcision in the Old Testament (Col 2:11-12). Therefore, Reformed churches baptize not only believers but also believers' children, since God's covenant includes believers and their offspring.\n\nBaptism itself doesn't save — the thief on the cross wasn't baptized yet received Jesus's promise (Luke 23:43). But as Christ's command, baptism is an expression of faith and act of obedience that every believer should receive. Baptism's efficacy lies not in the water but in the Spirit's work through this sacrament.",
    "bible_verses": ["Matthew 28:19", "Romans 6:3-4", "Colossians 2:11-12", "Acts 2:38-39", "1 Peter 3:21"],
    "related_readings": ["Systematic Theology Ch.49 (Wayne Grudem)", "The Westminster Confession Ch.28"],
    "tags": ["sacraments", "baptism", "theology", "intermediate"]
  },
  {
    "id": "q035",
    "category": "sacraments",
    "question_zh": "什么是圣餐（主的晚餐）？它有什么意义？",
    "question_en": "What is the Lord's Supper (Communion)? What is its significance?",
    "short_answer_zh": "圣餐是基督设立的圣礼，用饼和杯纪念祂的身体和血。它不仅是纪念，更是信徒在信心中真实地领受基督恩典的途径。",
    "short_answer_en": "The Lord's Supper is a sacrament Christ instituted, using bread and cup to remember His body and blood. It is not merely a memorial but a means through which believers truly receive Christ's grace by faith.",
    "detailed_answer_zh": "耶稣在被卖的那一夜设立了圣餐：「你们应当如此行，为的是纪念我」（路22:19）。改革宗对圣餐的理解介于天主教的变质说（饼酒实质变成基督的身体和血）和纯粹的纪念说之间。\n\n加尔文教导说，虽然饼和杯没有实质性的改变，但信徒在领受圣餐时，通过圣灵的工作，在信心中真实地与基督联合，领受祂的恩典和属灵的滋养。基督的临在是真实的，但方式是属灵的，而非物质的。\n\n圣餐有多重意义：纪念基督的死（回顾），领受当前的恩典（现在），预尝将来天上筵席的喜乐（前瞻）。它也是教会合一的表达——我们「同领一个饼」（林前10:17），表明我们在基督里是一个身体。因此，圣餐应当在教会的聚会中、在牧师的主持下领受。",
    "detailed_answer_en": "Jesus instituted the Lord's Supper on the night He was betrayed: 'Do this in remembrance of me' (Luke 22:19). The Reformed understanding falls between Catholic transubstantiation (bread and wine become Christ's body and blood) and pure memorialism.\n\nCalvin taught that while the bread and cup don't change substance, believers receiving communion truly unite with Christ through the Spirit's work, receiving His grace and spiritual nourishment by faith. Christ's presence is real but spiritual, not physical.\n\nThe Lord's Supper has multiple dimensions: remembering Christ's death (looking back), receiving present grace (looking around), and anticipating the future heavenly feast (looking forward). It also expresses church unity — we 'share one bread' (1 Cor 10:17), signifying we are one body in Christ. Therefore, communion should be received in the church gathering, administered by ordained ministers.",
    "bible_verses": ["Luke 22:19-20", "1 Corinthians 11:23-26", "1 Corinthians 10:16-17", "John 6:53-58"],
    "related_readings": ["The Westminster Confession Ch.29", "Given for You (Keith Mathison)"],
    "tags": ["sacraments", "communion", "theology", "intermediate"]
  },
  {
    "id": "q036",
    "category": "eschatology",
    "question_zh": "基督会再来吗？末日会是什么样子？",
    "question_en": "Will Christ return? What will the end times look like?",
    "short_answer_zh": "是的，基督必定会亲自、可见地再来，审判活人死人，完全更新万有。这是基督教信仰的基本盼望。",
    "short_answer_en": "Yes, Christ will return personally and visibly to judge the living and the dead and to fully renew all things. This is the fundamental hope of Christian faith.",
    "detailed_answer_zh": "使徒信经宣告基督「将来必从那里降临，审判活人、死人」。耶稣自己应许说：「你们必看见人子坐在那权能者的右边，驾着天上的云降临」（可14:62）。基督的再来不是可选的教义，而是基督教信仰的核心盼望。\n\n关于末世的具体时间表——千禧年、大灾难、被提的次序——改革宗内部有不同理解（前千禧年、后千禧年、无千禧年）。但所有正统基督徒都同意以下核心真理：基督会亲自再来；死人会复活；所有人会接受审判；上帝会创造新天新地。\n\n末世论的重点不是满足好奇心或制作时间表，而是激励我们忠心地生活。正因为基督要来，我们才要警醒等候（太24:42），忠心事奉（太25:14-30），并在盼望中忍耐（罗8:18-25）。",
    "detailed_answer_en": "The Apostles' Creed declares Christ 'will come again to judge the living and the dead.' Jesus Himself promised: 'You will see the Son of Man seated at the right hand of Power, and coming with the clouds of heaven' (Mark 14:62). Christ's return is not an optional doctrine but the core hope of Christian faith.\n\nRegarding specific end-times timelines — the millennium, great tribulation, order of the rapture — Reformed Christians hold different views (premillennialism, postmillennialism, amillennialism). But all orthodox Christians agree on core truths: Christ will return personally; the dead will be raised; all will face judgment; God will create a new heaven and new earth.\n\nEschatology's focus isn't satisfying curiosity or creating timelines but motivating faithful living. Because Christ is coming, we should watch and wait (Matt 24:42), serve faithfully (Matt 25:14-30), and endure in hope (Rom 8:18-25).",
    "bible_verses": ["Mark 14:62", "Acts 1:11", "Matthew 24:42", "Revelation 21:1-5", "1 Thessalonians 4:16-17"],
    "related_readings": ["The Bible and the Future (Anthony Hoekema)", "Systematic Theology Ch.54-57 (Wayne Grudem)"],
    "tags": ["eschatology", "second_coming", "intermediate"]
  },
  {
    "id": "q037",
    "category": "eschatology",
    "question_zh": "什么是新天新地？基督徒的永恒盼望是什么？",
    "question_en": "What is the new heaven and new earth? What is the Christian's eternal hope?",
    "short_answer_zh": "基督徒的永恒盼望不是飘在云端弹竖琴，而是在更新的物质世界中与上帝面对面同住，在完美的身体中享受永恒的喜乐和有意义的工作。",
    "short_answer_en": "The Christian's eternal hope isn't floating on clouds playing harps, but dwelling face-to-face with God in a renewed physical world, enjoying eternal joy and meaningful work in perfected bodies.",
    "detailed_answer_zh": "许多人以为基督教的盼望是「灵魂上天堂」——脱离物质世界、永远飘浮在灵界。但圣经的教导远比这丰富。启示录21章描绘的不是我们「上去」到天上，而是「新耶路撒冷从天而降」——上帝来到我们中间，与人同住。\n\n基督徒的最终盼望是身体的复活（林前15章）和万物的更新（罗8:21）。上帝不会废弃祂的创造，而是更新它。新天新地是这个物质世界的荣耀升级版——没有罪、没有死亡、没有痛苦，但仍然是真实的、物质的、美好的。\n\n在那里，我们将有复活的荣耀身体，能吃能喝（路22:18），能彼此辨认。我们将有有意义的工作——治理受造界的使命将在完美中实现。最重要的是，我们将面对面见到上帝（启22:4），这是人类受造目的的终极实现。",
    "detailed_answer_en": "Many assume the Christian hope is 'souls going to heaven' — leaving the material world to float eternally in a spiritual realm. But Scripture's teaching is far richer. Revelation 21 depicts not us 'going up' to heaven but the 'New Jerusalem coming down' — God coming to dwell among us.\n\nThe Christian's ultimate hope is bodily resurrection (1 Cor 15) and the renewal of all things (Rom 8:21). God will not discard His creation but renew it. The new heaven and new earth are the glorified upgrade of this physical world — no sin, no death, no suffering, yet still real, material, and beautiful.\n\nThere we'll have glorified resurrection bodies, able to eat and drink (Luke 22:18) and recognize one another. We'll have meaningful work — the mandate to steward creation will be fulfilled perfectly. Most importantly, we'll see God face to face (Rev 22:4) — the ultimate fulfillment of humanity's created purpose.",
    "bible_verses": ["Revelation 21:1-5", "Revelation 22:3-5", "Romans 8:19-23", "1 Corinthians 15:42-49", "Isaiah 65:17-25"],
    "related_readings": ["Surprised by Hope (N.T. Wright)", "Heaven (Randy Alcorn)"],
    "tags": ["eschatology", "new_creation", "hope", "beginner"]
  },
  {
    "id": "q038",
    "category": "eschatology",
    "question_zh": "基督徒应该如何看待启示录的预言？",
    "question_en": "How should Christians approach the prophecies in Revelation?",
    "short_answer_zh": "启示录是用高度象征性的「启示文学」体裁写成的。它的主要信息不是预测未来事件的时间表，而是宣告基督最终的胜利和上帝子民的坚忍盼望。",
    "short_answer_en": "Revelation is written in the highly symbolic genre of 'apocalyptic literature.' Its main message isn't a timeline of future events but the declaration of Christ's ultimate victory and the persevering hope of God's people.",
    "detailed_answer_zh": "启示录是圣经中最常被误读的书卷之一。它属于「启示文学」（apocalyptic literature），这种文体在当时的犹太世界非常普遍，使用大量象征、异象和数字来传达属灵真理。\n\n对启示录主要有四种解读方式：过去主义（preterism，认为大部分预言已在公元70年应验）、历史主义（historicism，认为预言涵盖整个教会历史）、未来主义（futurism，认为大部分预言指向末来）、理想主义（idealism，认为预言描绘属灵原则的永恒真理）。改革宗学者在这些观点中都有代表。\n\n无论采取哪种解读，启示录的核心信息是清楚的：基督已经得胜（启5章），邪恶终将被审判（启18-20章），上帝将与祂的子民永远同住（启21-22章）。在逼迫和试炼中，这个信息给了信徒最深的安慰和盼望。",
    "detailed_answer_en": "Revelation is one of the Bible's most misread books. It belongs to 'apocalyptic literature,' a genre common in the Jewish world, using extensive symbolism, visions, and numbers to convey spiritual truths.\n\nThere are four main interpretive approaches: preterism (most prophecies fulfilled around AD 70), historicism (prophecies span church history), futurism (most prophecies point to the future), and idealism (prophecies depict eternal spiritual principles). Reformed scholars have representatives in each view.\n\nRegardless of approach, Revelation's core message is clear: Christ has conquered (Rev 5), evil will be judged (Rev 18-20), and God will dwell with His people forever (Rev 21-22). In persecution and trial, this message provides believers with the deepest comfort and hope.",
    "bible_verses": ["Revelation 1:1-3", "Revelation 5:5-6", "Revelation 21:3-4", "Revelation 22:20"],
    "related_readings": ["More Than Conquerors (William Hendriksen)", "The Triumph of the Lamb (Dennis Johnson)"],
    "tags": ["eschatology", "revelation", "hermeneutics", "advanced"]
  },
  {
    "id": "q039",
    "category": "prayer",
    "question_zh": "如果上帝已经知道一切，祷告有什么用？",
    "question_en": "If God already knows everything, what's the point of prayer?",
    "short_answer_zh": "祷告不是通知上帝祂不知道的事，而是与上帝建立关系的方式。上帝预定了结果，也预定了祷告作为实现结果的途径。",
    "short_answer_en": "Prayer isn't informing God of things He doesn't know, but a way to build relationship with Him. God ordains outcomes and also ordains prayer as a means to accomplish those outcomes.",
    "detailed_answer_zh": "这个问题背后有一个错误假设：如果上帝已经知道一切，那么祷告就是多余的。但圣经教导的是，上帝不仅预定了结果，也预定了达成结果的途径——而祷告正是这些途径之一。雅各书说：「你们得不着，是因为你们不求」（雅4:2）。\n\n更重要的是，祷告的核心不是改变上帝的心意，而是改变我们自己。当我们在祷告中来到上帝面前，我们承认自己的有限和依赖，我们的心被上帝的旨意塑造，我们与上帝的关系得到深化。祷告是上帝赐给我们的恩典途径。\n\n想想一个父亲和孩子的关系。父亲当然知道孩子需要什么，但孩子向父亲表达需要、与父亲交流，这本身就是关系的核心。上帝希望我们把一切忧虑卸给祂（彼前5:7），不是因为祂需要信息，而是因为祂渴望与我们亲近。",
    "detailed_answer_en": "This question rests on a false assumption: if God already knows everything, prayer is redundant. But Scripture teaches that God ordains not only outcomes but also the means to achieve them — and prayer is one of those means. James says: 'You do not have because you do not ask' (James 4:2).\n\nMore importantly, prayer's core purpose isn't changing God's mind but changing us. When we come before God in prayer, we acknowledge our finitude and dependence, our hearts are shaped by God's will, and our relationship with Him deepens. Prayer is a means of grace God gives us.\n\nConsider a father-child relationship. The father knows what the child needs, but the child expressing needs and communicating with the father is the heart of the relationship. God wants us to cast all our cares on Him (1 Peter 5:7), not because He needs information but because He desires closeness with us.",
    "bible_verses": ["James 4:2", "1 Peter 5:7", "Philippians 4:6-7", "Matthew 6:8-13", "1 Thessalonians 5:17"],
    "related_readings": ["Prayer (Tim Keller)", "A Call to Spiritual Reformation (D.A. Carson)"],
    "tags": ["prayer", "sovereignty", "beginner"]
  },
  {
    "id": "q040",
    "category": "prayer",
    "question_zh": "上帝为什么不回应我的祷告？",
    "question_en": "Why doesn't God answer my prayers?",
    "short_answer_zh": "上帝总是回应祷告，但不总是按照我们期望的方式。祂的回应可能是「是」「不」或「等候」——每一种回应都出于祂完美的智慧和爱。",
    "short_answer_en": "God always responds to prayer, but not always in the way we expect. His answer may be 'yes,' 'no,' or 'wait' — each from His perfect wisdom and love.",
    "detailed_answer_zh": "首先，上帝确实回应了每一个祷告——只是不一定是我们期望的回应方式。一个好父亲不会答应孩子的每一个要求，因为有些要求对孩子并不好。上帝有时候说「不」或「还没到时候」，正是因为祂知道什么对我们真正有益。\n\n其次，圣经也提到了几个可能妨碍祷告的因素：未悔改的罪（赛59:2）、错误的动机（雅4:3）、对他人的不饶恕（可11:25）、不信（雅1:6-7）。这些不是说上帝记仇或斤斤计较，而是说罪会阻碍我们与上帝的沟通。\n\n最终，我们必须学习信靠上帝的智慧超过我们自己的理解。保罗三次求上帝除去他身上的「刺」，但上帝说：「我的恩典够你用的」（林后12:9）。有时候我们后来才明白，上帝没有给我们想要的，是因为祂给了我们更好的。",
    "detailed_answer_en": "First, God does respond to every prayer — just not always as we expect. A good father doesn't grant every request because some aren't good for the child. God sometimes says 'no' or 'not yet' precisely because He knows what's truly beneficial.\n\nSecond, Scripture mentions factors that may hinder prayer: unrepented sin (Isa 59:2), wrong motives (James 4:3), unforgiveness toward others (Mark 11:25), and unbelief (James 1:6-7). This doesn't mean God holds grudges but that sin disrupts our communication with Him.\n\nUltimately, we must learn to trust God's wisdom above our own understanding. Paul asked three times for God to remove his 'thorn,' but God said: 'My grace is sufficient for you' (2 Cor 12:9). Sometimes we later realize God didn't give us what we wanted because He gave us something better.",
    "bible_verses": ["2 Corinthians 12:7-9", "Isaiah 59:2", "James 4:3", "Psalm 37:4", "Romans 8:26-28"],
    "related_readings": ["Prayer (Tim Keller)", "When God Doesn't Make Sense (James Dobson)"],
    "tags": ["prayer", "suffering", "trust", "beginner"]
  },
  {
    "id": "q041",
    "category": "two_natures_of_christ",
    "question_zh": "耶稣如何既是完全的上帝又是完全的人？",
    "question_en": "How can Jesus be fully God and fully man at the same time?",
    "short_answer_zh": "耶稣基督是一个位格拥有两个完整的本性——完全的神性和完全的人性。这两个本性在一个位格中联合，不混淆、不改变、不分割、不分离。",
    "short_answer_en": "Jesus Christ is one person with two complete natures — full deity and full humanity. These two natures are united in one person without confusion, change, division, or separation.",
    "detailed_answer_zh": "公元451年的迦克墩会议确立了基督论的正统定义：耶稣基督是真上帝也是真人，两个本性在一个位格中联合。这被称为「二性一位格」（hypostatic union）。\n\n这意味着耶稣不是半神半人，也不是人变成了神，更不是神假装成人。祂同时且完全地拥有神性和人性。作为上帝，祂是无所不知、无所不能的；作为人，祂会饥饿、疲倦、悲伤。福音书中我们看到祂平静风浪（神性的权能），也看到祂在十字架上哭喊（人性的痛苦）。\n\n为什么这很重要？因为只有完全的上帝才有能力拯救我们，只有完全的人才能代替我们。救赎需要一位中保——既能代表上帝向人说话，又能代表人向上帝说话。耶稣独一无二的神人位格使祂成为完美的中保。正如提摩太前书2:5所说：「在上帝和人中间，只有一位中保，乃是降世为人的基督耶稣。」",
    "detailed_answer_en": "The Council of Chalcedon in AD 451 established the orthodox definition of Christology: Jesus Christ is truly God and truly man, two natures united in one person. This is called the 'hypostatic union.'\n\nThis means Jesus is not half-God half-man, nor a man who became God, nor God pretending to be human. He simultaneously and fully possesses both divine and human natures. As God, He is omniscient and omnipotent; as man, He experienced hunger, fatigue, and sorrow. In the Gospels we see Him calming storms (divine power) and crying out on the cross (human suffering).\n\nWhy does this matter? Only fully God has the power to save us; only fully human can substitute for us. Redemption requires a mediator who can represent God to humanity and humanity to God. Jesus's unique divine-human personhood makes Him the perfect mediator. As 1 Timothy 2:5 says: 'There is one mediator between God and men, the man Christ Jesus.'",
    "bible_verses": ["1 Timothy 2:5", "John 1:14", "Hebrews 2:17", "Hebrews 4:15", "Colossians 2:9"],
    "related_readings": ["The Person of Christ (Donald Macleod)", "Systematic Theology Ch.26 (Wayne Grudem)"],
    "tags": ["christology", "incarnation", "intermediate"]
  },
  {
    "id": "q042",
    "category": "two_natures_of_christ",
    "question_zh": "耶稣在地上时是否全知？祂说不知道末日的时间是什么意思？",
    "question_en": "Was Jesus omniscient on earth? What does it mean that He said He didn't know the time of the end?",
    "short_answer_zh": "耶稣在道成肉身期间自愿限制了祂神性某些属性的使用。祂的人性确实有有限的知识，但这并不否认祂的神性是全知的。",
    "short_answer_en": "During the incarnation, Jesus voluntarily limited the exercise of certain divine attributes. His human nature had genuine limits of knowledge, but this doesn't deny that His divine nature is omniscient.",
    "detailed_answer_zh": "马可福音13:32记载耶稣说：「但那日子，那时辰，没有人知道，连天上的使者也不知道，子也不知道，惟有父知道。」这段经文确实令人困惑，但它可以从道成肉身的角度来理解。\n\n腓立比书2:6-7说，基督「本有上帝的形像」，却「虚己」取了奴仆的形像。这种「虚己」（kenosis）不是说祂放弃了神性属性，而是说祂自愿不使用某些神性特权。按照祂的人性，耶稣像所有人一样经历成长和学习（路2:52）。按照祂的神性，祂仍然是全知的上帝。\n\n改革宗神学强调「属性相通」（communicatio idiomatum）的教义：因为两个本性联合在一个位格中，所以可以将一个本性的属性归于整个位格。因此我们可以说「上帝为我们死了」（按人性而死）和「这个人创造了世界」（按神性而创造）。耶稣说「子也不知道」是就祂的人性说的，并不否认祂的神性是无所不知的。",
    "detailed_answer_en": "Mark 13:32 records Jesus saying: 'But concerning that day or that hour, no one knows, not even the angels in heaven, nor the Son, but only the Father.' This is puzzling, but it can be understood through the lens of the incarnation.\n\nPhilippians 2:6-7 says Christ, 'though he was in the form of God,' 'emptied himself' taking the form of a servant. This 'emptying' (kenosis) doesn't mean He abandoned divine attributes but voluntarily chose not to exercise certain divine prerogatives. According to His human nature, Jesus grew and learned like all humans (Luke 2:52). According to His divine nature, He remained the omniscient God.\n\nReformed theology emphasizes the doctrine of the communicatio idiomatum (communication of attributes): because two natures are united in one person, attributes of one nature can be predicated of the whole person. So we can say 'God died for us' (dying according to human nature) and 'this man created the world' (creating according to divine nature). Jesus saying 'nor the Son' speaks according to His human nature and doesn't deny that His divine nature is omniscient.",
    "bible_verses": ["Mark 13:32", "Philippians 2:6-8", "Luke 2:52", "John 2:24-25", "Colossians 2:3"],
    "related_readings": ["The Person of Christ (Donald Macleod)", "Jesus the Son of God (D.A. Carson)"],
    "tags": ["christology", "kenosis", "advanced"]
  },
  {
    "id": "q043",
    "category": "two_natures_of_christ",
    "question_zh": "道成肉身是什么意思？为什么上帝必须成为人？",
    "question_en": "What does the incarnation mean? Why did God have to become human?",
    "short_answer_zh": "道成肉身是指永恒的圣子取了人性，成为人耶稣基督。上帝成为人是为了在人性中代替我们遵行律法、承受刑罚，并使我们与上帝和好。",
    "short_answer_en": "The incarnation means the eternal Son took on human nature, becoming the man Jesus Christ. God became human to obey the law and bear the penalty in our place, reconciling us to God.",
    "detailed_answer_zh": "约翰福音1:14宣告：「道成了肉身，住在我们中间。」这是宇宙历史中最惊天动地的事件——永恒、无限的上帝进入了有限的人类存在。创造万物的那一位，成为了被造物中的一员。\n\n为什么上帝必须成为人？首先，罪的工价是死（罗6:23），而天使或动物的死不能替代人类。只有一个人的死才能为人类赎罪。但普通人自己也是罪人，无法替别人赎罪。因此需要一个无罪的完美人——而这只有上帝亲自成为人才能实现。\n\n其次，道成肉身使上帝能够真正与我们的苦难认同。希伯来书4:15说，我们的大祭司「并非不能体恤我们的软弱，祂也曾凡事受过试探，与我们一样，只是祂没有犯罪。」上帝不是在远处命令我们受苦，而是亲自经历了人类的一切苦难。这使我们在苦难中可以确信：上帝理解我们。",
    "detailed_answer_en": "John 1:14 declares: 'The Word became flesh and dwelt among us.' This is the most staggering event in cosmic history — the eternal, infinite God entered finite human existence. The One who created all things became one of His creatures.\n\nWhy did God have to become human? First, the wages of sin is death (Rom 6:23), and the death of angels or animals cannot substitute for humans. Only a human death can atone for human sin. But ordinary humans are themselves sinners, unable to atone for others. Therefore a sinless, perfect human was needed — and only God becoming human could achieve this.\n\nSecond, the incarnation enables God to truly identify with our suffering. Hebrews 4:15 says our High Priest 'is not unable to sympathize with our weaknesses, but was tempted in every way as we are, yet without sin.' God didn't command us to suffer from a distance but personally experienced every human suffering. This assures us in our trials: God understands.",
    "bible_verses": ["John 1:14", "Romans 6:23", "Hebrews 4:15", "Hebrews 2:14-17", "Galatians 4:4-5"],
    "related_readings": ["Knowing Christ (Mark Jones)", "The Person of Christ (Donald Macleod)"],
    "tags": ["christology", "incarnation", "beginner"]
  },
  {
    "id": "q044",
    "category": "holy_spirit",
    "question_zh": "圣灵是谁？祂只是一种力量还是一个位格？",
    "question_en": "Who is the Holy Spirit? Is He just a force or a person?",
    "short_answer_zh": "圣灵不是一种非人格的力量，而是三位一体中的第三位格——与圣父、圣子同等的上帝。祂有意志、情感和理智，祂说话、引导、可以被忧伤。",
    "short_answer_en": "The Holy Spirit is not an impersonal force but the third person of the Trinity — God co-equal with Father and Son. He has will, emotions, and intellect; He speaks, guides, and can be grieved.",
    "detailed_answer_zh": "许多人把圣灵想象成一种模糊的属灵能量，但圣经清楚地教导圣灵是一个位格。祂有位格的三个特征：理智（林前2:10-11，祂参透万事）、情感（弗4:30，祂会忧伤）、意志（林前12:11，祂随己意分配恩赐）。祂用言语说话（徒13:2），祂引导（罗8:14），祂代求（罗8:26）。这些都不是一种力量能做的。\n\n圣灵不仅是一个位格，而且是完全的上帝。使徒行传5:3-4中，彼得说欺哄圣灵就是欺哄上帝。圣灵参与了创造（创1:2），参与了基督的道成肉身（路1:35），参与了基督的复活（罗8:11）。三位一体的每一项大工，圣灵都有参与。\n\n对基督徒而言，圣灵是使我们重生的那一位（约3:5-8），是住在我们里面的那一位（林前6:19），是使我们成圣、赐给我们恩赐、引导我们明白真理的那一位。没有圣灵的工作，没有人能认识基督、相信福音。",
    "detailed_answer_en": "Many imagine the Holy Spirit as a vague spiritual energy, but Scripture clearly teaches He is a person. He possesses the three marks of personhood: intellect (1 Cor 2:10-11, He searches all things), emotion (Eph 4:30, He can be grieved), and will (1 Cor 12:11, He distributes gifts as He wills). He speaks (Acts 13:2), guides (Rom 8:14), and intercedes (Rom 8:26). No mere force can do these things.\n\nThe Holy Spirit is not only a person but fully God. In Acts 5:3-4, Peter says lying to the Holy Spirit is lying to God. The Spirit participated in creation (Gen 1:2), Christ's incarnation (Luke 1:35), and Christ's resurrection (Rom 8:11). Every great work of the Trinity involves the Spirit.\n\nFor Christians, the Holy Spirit is the one who regenerates us (John 3:5-8), dwells within us (1 Cor 6:19), sanctifies us, gives us gifts, and guides us into truth. Without the Spirit's work, no one can know Christ or believe the gospel.",
    "bible_verses": ["Acts 5:3-4", "1 Corinthians 2:10-11", "Ephesians 4:30", "1 Corinthians 12:11", "Romans 8:26-27"],
    "related_readings": ["The Holy Spirit (Sinclair Ferguson)", "Systematic Theology Ch.30 (Wayne Grudem)"],
    "tags": ["holy_spirit", "trinity", "beginner"]
  },
  {
    "id": "q045",
    "category": "holy_spirit",
    "question_zh": "圣灵在基督徒生命中做什么工作？",
    "question_en": "What does the Holy Spirit do in a Christian's life?",
    "short_answer_zh": "圣灵使人重生、赐人信心、内住在信徒里面、使人成圣、赐下属灵恩赐、引导信徒明白真理、为信徒代求，并作为我们将来得基业的凭据。",
    "short_answer_en": "The Holy Spirit regenerates, gives faith, indwells believers, sanctifies, gives spiritual gifts, guides into truth, intercedes for believers, and serves as the guarantee of our future inheritance.",
    "detailed_answer_zh": "圣灵在基督徒生命中的工作可以从几个方面理解：\n\n首先是重生和归信。人靠自己无法相信福音（林前2:14），是圣灵使死在罪中的人活过来（弗2:1-5），赐给他们新心（结36:26-27），使他们能够悔改和相信。\n\n其次是成圣。重生是一次性的，但成圣是一生的过程。圣灵在信徒里面持续工作，使他们越来越像基督（林后3:18），结出圣灵的果子——仁爱、喜乐、和平、忍耐、恩慈、良善、信实、温柔、节制（加5:22-23）。\n\n第三是恩赐和事奉。圣灵按照自己的旨意赐给每位信徒不同的属灵恩赐（林前12:4-11），目的是建造基督的身体——教会。没有任何恩赐是不重要的，也没有任何信徒是没有恩赐的。\n\n最后，圣灵是我们得基业的凭据（弗1:13-14），就像定金一样，保证上帝会完成祂在我们身上开始的善工。",
    "detailed_answer_en": "The Holy Spirit's work in a Christian's life can be understood in several aspects:\n\nFirst, regeneration and conversion. People cannot believe the gospel on their own (1 Cor 2:14); it is the Spirit who makes those dead in sin alive (Eph 2:1-5), gives them a new heart (Ezek 36:26-27), and enables repentance and faith.\n\nSecond, sanctification. Regeneration is a one-time event, but sanctification is a lifelong process. The Spirit works continually within believers, making them increasingly Christlike (2 Cor 3:18), producing the fruit of the Spirit — love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control (Gal 5:22-23).\n\nThird, gifts and ministry. The Spirit gives each believer different spiritual gifts according to His will (1 Cor 12:4-11), for building up Christ's body — the church. No gift is unimportant, and no believer is without gifts.\n\nFinally, the Spirit is the guarantee of our inheritance (Eph 1:13-14), like a down payment, assuring us that God will complete the good work He began in us.",
    "bible_verses": ["Ezekiel 36:26-27", "Galatians 5:22-23", "1 Corinthians 12:4-11", "Ephesians 1:13-14", "2 Corinthians 3:18"],
    "related_readings": ["The Holy Spirit (Sinclair Ferguson)", "Keep in Step with the Spirit (J.I. Packer)"],
    "tags": ["holy_spirit", "sanctification", "spiritual_gifts", "beginner"]
  },
  {
    "id": "q046",
    "category": "holy_spirit",
    "question_zh": "什么是圣灵的洗？所有基督徒都有圣灵吗？",
    "question_en": "What is the baptism of the Holy Spirit? Do all Christians have the Holy Spirit?",
    "short_answer_zh": "圣灵的洗发生在每个人归信的那一刻，不是之后的第二次经历。所有真正的基督徒都有圣灵内住——「人若没有基督的灵，就不是属基督的」。",
    "short_answer_en": "The baptism of the Holy Spirit occurs at the moment of conversion, not as a second experience afterward. All true Christians have the indwelling Spirit — 'anyone who does not have the Spirit of Christ does not belong to Him.'",
    "detailed_answer_zh": "一些基督教传统教导圣灵的洗是得救之后的第二次经历，通常伴随着说方言等现象。但从改革宗的角度来看，圣经教导圣灵的洗是归信时发生的一次性事件。\n\n哥林多前书12:13说：「我们不拘是犹太人，是希腊人，是为奴的，是自主的，都从一位圣灵受洗，成了一个身体。」这里保罗说的是所有基督徒——每个信徒在归信时都领受了圣灵的洗。罗马书8:9更加明确：「人若没有基督的灵，就不是属基督的。」\n\n使徒行传中五旬节和其他特殊的圣灵浇灌事件是救赎历史中独特的过渡时期现象，标志着新约时代的开启和福音向不同群体的扩展（犹太人、撒玛利亚人、外邦人）。这些不应该被视为每个基督徒都需要重复的模式。基督徒不需要追求「第二次祝福」，而应该追求被圣灵充满（弗5:18）——这是持续不断的、日常的顺服和依靠。",
    "detailed_answer_en": "Some Christian traditions teach that Spirit baptism is a second experience after salvation, usually accompanied by speaking in tongues. But from a Reformed perspective, Scripture teaches Spirit baptism is a one-time event at conversion.\n\n1 Corinthians 12:13 says: 'For in one Spirit we were all baptized into one body — Jews or Greeks, slaves or free.' Here Paul speaks of all Christians — every believer received Spirit baptism at conversion. Romans 8:9 is even clearer: 'Anyone who does not have the Spirit of Christ does not belong to Him.'\n\nThe Pentecost event and other special Spirit outpourings in Acts were unique transitional phenomena in redemptive history, marking the inauguration of the new covenant era and the gospel's expansion to different groups (Jews, Samaritans, Gentiles). These should not be seen as a pattern every Christian must repeat. Christians need not seek a 'second blessing' but should pursue being filled with the Spirit (Eph 5:18) — a continuous, daily submission and dependence.",
    "bible_verses": ["1 Corinthians 12:13", "Romans 8:9", "Ephesians 5:18", "Acts 2:1-4", "Titus 3:5-6"],
    "related_readings": ["Baptism and Fullness (John Stott)", "Keep in Step with the Spirit (J.I. Packer)"],
    "tags": ["holy_spirit", "charismatic", "intermediate"]
  },
  {
    "id": "q047",
    "category": "faith_and_works",
    "question_zh": "基督徒是因信称义，那好行为还重要吗？",
    "question_en": "Christians are justified by faith. Are good works still important?",
    "short_answer_zh": "我们因信称义，不因行为；但真正的信心必然会产生好行为。好行为不是称义的原因，而是称义的果实。正如雅各所说，没有行为的信心是死的。",
    "short_answer_en": "We are justified by faith, not works; but genuine faith inevitably produces good works. Good works are not the cause of justification but its fruit. As James says, faith without works is dead.",
    "detailed_answer_zh": "改革宗神学在这个问题上的立场可以用一句话概括：我们唯独因信称义，但那使我们称义的信心从来不是孤单的。\n\n保罗在罗马书和加拉太书中反复强调，没有人能靠遵行律法在上帝面前称义（罗3:20，加2:16）。称义是法庭用语——上帝宣告罪人为义，不是因为他们自己的义，而是因为基督的义被归算给他们。这完全是恩典的工作，通过信心领受。\n\n但雅各书2:26说「身体没有灵魂是死的，信心没有行为也是死的。」这与保罗矛盾吗？不。保罗讨论的是称义的根据（唯独信心），雅各讨论的是信心的证据（必然有行为）。一棵苹果树不是因为结了苹果才成为苹果树，但如果一棵树从不结苹果，你就有理由怀疑它是否真是苹果树。同样，好行为不使我们得救，但没有好行为的「信仰」让人怀疑它是否是真正的信心。",
    "detailed_answer_en": "The Reformed position on this issue can be summarized in one sentence: we are justified by faith alone, but the faith that justifies is never alone.\n\nPaul repeatedly emphasizes in Romans and Galatians that no one can be justified by works of the law (Rom 3:20, Gal 2:16). Justification is a legal term — God declares sinners righteous, not based on their own righteousness but because Christ's righteousness is imputed to them. This is entirely a work of grace, received through faith.\n\nBut James 2:26 says 'faith apart from works is dead.' Does this contradict Paul? No. Paul discusses the basis of justification (faith alone); James discusses the evidence of faith (works inevitably follow). An apple tree doesn't become an apple tree by producing apples, but if a tree never bears apples, you rightly question whether it's truly an apple tree. Similarly, good works don't save us, but 'faith' without good works raises the question of whether it's genuine faith at all.",
    "bible_verses": ["Romans 3:28", "James 2:26", "Ephesians 2:8-10", "Galatians 2:16", "Titus 3:8"],
    "related_readings": ["Faith Alone (R.C. Sproul)", "The Whole Christ (Sinclair Ferguson)"],
    "tags": ["justification", "faith", "works", "intermediate"]
  },
  {
    "id": "q048",
    "category": "faith_and_works",
    "question_zh": "什么是因信称义？为什么这是基督教最重要的教义之一？",
    "question_en": "What is justification by faith? Why is it one of Christianity's most important doctrines?",
    "short_answer_zh": "因信称义是指上帝凭恩典、通过信心、因着基督的义，宣告罪人在祂面前为义。马丁·路德称这是「教会站立或倒下的教义」。",
    "short_answer_en": "Justification by faith means God, by grace, through faith, because of Christ's righteousness, declares sinners righteous before Him. Martin Luther called this 'the article by which the church stands or falls.'",
    "detailed_answer_zh": "因信称义的教义涉及一个「奇妙的交换」（admirabile commercium）：基督在十字架上承担了我们的罪，祂完美的义被归算给我们。我们不是因为自己变好了才被上帝接纳，而是因为基督的义被算在我们账上。\n\n这个教义之所以至关重要，是因为它回答了人类最根本的问题：有罪的人怎么能站在圣洁的上帝面前？如果答案是「靠你自己的努力」，那么没有人能有确据——因为你永远不知道自己是否做得「够好」。但如果答案是「靠基督为你做的」，那么救恩的确据就建立在基督完成的工作上——而那是不会改变的。\n\n这也是宗教改革的核心发现。马丁·路德在研读罗马书1:17时恍然大悟：「义人必因信得生」——上帝的义不是要来定罪我们的审判标准，而是上帝白白赐给我们的礼物。这一发现改变了路德的生命，也改变了教会历史。",
    "detailed_answer_en": "The doctrine of justification by faith involves a 'wonderful exchange' (admirabile commercium): Christ bore our sins on the cross, and His perfect righteousness is imputed to us. We're not accepted by God because we've improved but because Christ's righteousness is credited to our account.\n\nThis doctrine is crucial because it answers humanity's most fundamental question: how can sinful people stand before a holy God? If the answer is 'by your own effort,' no one can have assurance — you never know if you've done 'enough.' But if the answer is 'by what Christ has done for you,' assurance rests on Christ's finished work — and that never changes.\n\nThis was also the core discovery of the Reformation. Martin Luther, studying Romans 1:17, had his breakthrough: 'The righteous shall live by faith' — God's righteousness is not a standard of judgment to condemn us but a gift freely given to us. This discovery changed Luther's life and changed church history.",
    "bible_verses": ["Romans 1:17", "Romans 3:21-26", "2 Corinthians 5:21", "Philippians 3:9", "Romans 4:5"],
    "related_readings": ["The Doctrine of Justification (James Buchanan)", "Faith Alone (R.C. Sproul)", "Getting the Gospel Right (R.C. Sproul)"],
    "tags": ["justification", "reformation", "gospel", "intermediate"]
  },
  {
    "id": "q049",
    "category": "faith_and_works",
    "question_zh": "如果救恩不靠行为，基督徒是否可以随意犯罪？",
    "question_en": "If salvation isn't based on works, can Christians sin freely?",
    "short_answer_zh": "绝对不行。保罗在罗马书6:1-2中斩钉截铁地说：「断乎不可！」恩典不是犯罪的许可证，而是胜过罪的能力。真正经历恩典的人会恨恶罪。",
    "short_answer_en": "Absolutely not. Paul emphatically says in Romans 6:1-2: 'By no means!' Grace is not a license to sin but the power to overcome sin. Those who truly experience grace will hate sin.",
    "detailed_answer_zh": "这个问题保罗在两千年前就预见到了。罗马书6:1-2问：「我们可以仍在罪中、叫恩典显多吗？断乎不可！我们在罪上死了的人岂可仍在罪中活着呢？」\n\n这里的逻辑是：真正得救的人已经与基督同死同复活（罗6:3-4）。我们的旧人已经和祂同钉十字架（罗6:6）。这不只是法律地位的改变，而是生命本质的改变。一个被圣灵重生的人有了新的心、新的渴望、新的方向。他不再以犯罪为乐，而是为罪痛心。\n\n当然，基督徒仍然会犯罪——成圣是一个过程，不是瞬间完成的。但基督徒犯罪的方向变了：从前是心甘情愿地犯罪，现在是在挣扎中犯罪；从前犯罪后没有痛苦，现在犯罪后深感痛悔。如果一个人宣称自己得救了却丝毫不为罪忧伤，也没有悔改的迹象，那他需要认真审视自己的信仰是否真实。",
    "detailed_answer_en": "Paul anticipated this question two thousand years ago. Romans 6:1-2 asks: 'Are we to continue in sin that grace may abound? By no means! How can we who died to sin still live in it?'\n\nThe logic is: the truly saved have died and risen with Christ (Rom 6:3-4). Our old self was crucified with Him (Rom 6:6). This isn't merely a change in legal status but a change in the nature of our lives. A person regenerated by the Spirit has a new heart, new desires, new direction. They no longer delight in sin but grieve over it.\n\nOf course, Christians still sin — sanctification is a process, not instantaneous. But the direction changes: before, they sinned willingly; now, they sin with struggle. Before, sin brought no grief; now, it brings deep repentance. If someone claims salvation yet shows no grief over sin and no evidence of repentance, they need to seriously examine whether their faith is genuine.",
    "bible_verses": ["Romans 6:1-6", "Romans 6:14", "1 John 3:9", "1 John 1:8-10", "Titus 2:11-12"],
    "related_readings": ["The Hole in Our Holiness (Kevin DeYoung)", "The Mortification of Sin (John Owen)"],
    "tags": ["sanctification", "antinomianism", "grace", "intermediate"]
  },
  {
    "id": "q050",
    "category": "original_sin",
    "question_zh": "什么是原罪？为什么亚当的罪与我有关？",
    "question_en": "What is original sin? Why does Adam's sin affect me?",
    "short_answer_zh": "原罪是指亚当作为全人类的代表犯罪后，他的罪和败坏传递给了所有后代。我们不仅继承了犯罪的倾向，也在亚当里被算为有罪。",
    "short_answer_en": "Original sin means that after Adam sinned as humanity's representative, his guilt and corruption were transmitted to all his descendants. We inherit not only a tendency to sin but are counted guilty in Adam.",
    "detailed_answer_zh": "罗马书5:12说：「罪是从一人入了世界，死又是从罪来的；于是死就临到众人，因为众人都犯了罪。」亚当不是以个人身份犯罪，而是作为全人类的「盟约代表」（federal head）犯罪。正如一国的总统所签的条约约束全国人民，亚当的选择影响了他所有的后代。\n\n原罪包含两个层面：归算的罪咎（亚当的罪被算在我们头上）和遗传的败坏（我们从出生就有犯罪的倾向）。这就是为什么我们不需要教小孩子说谎和自私——这些是与生俱来的。大卫说：「我是在罪孽里生的，在我母亲怀胎的时候就有了罪」（诗51:5）。\n\n这看似不公平，但它实际上是福音的基础。因为罪是通过代表传递的，救恩也可以通过代表获得。亚当是第一个代表，带来了罪和死；基督是第二个亚当、末后的亚当（林前15:45），带来了义和生命。「因一人的悖逆，众人成为罪人；照样，因一人的顺从，众人也成为义了」（罗5:19）。",
    "detailed_answer_en": "Romans 5:12 says: 'Sin came into the world through one man, and death through sin, and so death spread to all men because all sinned.' Adam didn't sin as a private individual but as humanity's 'federal head' (covenant representative). Just as a president's treaty binds the entire nation, Adam's choice affected all his descendants.\n\nOriginal sin has two dimensions: imputed guilt (Adam's sin is charged to us) and inherited corruption (we're born with a disposition toward sin). This is why we don't need to teach children to lie or be selfish — it comes naturally. David said: 'I was brought forth in iniquity, and in sin did my mother conceive me' (Psalm 51:5).\n\nThis may seem unfair, but it's actually the foundation of the gospel. Because sin was transmitted through a representative, salvation can also be received through a representative. Adam was the first representative, bringing sin and death; Christ is the second Adam, the last Adam (1 Cor 15:45), bringing righteousness and life. 'As by the one man's disobedience the many were made sinners, so by the one man's obedience the many will be made righteous' (Rom 5:19).",
    "bible_verses": ["Romans 5:12", "Romans 5:19", "Psalm 51:5", "1 Corinthians 15:21-22", "1 Corinthians 15:45"],
    "related_readings": ["Original Sin (Jonathan Edwards)", "Systematic Theology Ch.24 (Wayne Grudem)", "Not the Way It's Supposed to Be (Cornelius Plantinga)"],
    "tags": ["original_sin", "adam", "theology", "intermediate"]
  },
  {
    "id": "q051",
    "category": "original_sin",
    "question_zh": "人性是本善还是本恶？基督教怎么看？",
    "question_en": "Is human nature fundamentally good or evil? What is the Christian view?",
    "short_answer_zh": "人是按上帝的形像被造的（本质上有尊严和价值），但因堕落已经全然败坏（罪影响了人的每个方面）。人既有上帝形像的荣光，又有罪的深刻扭曲。",
    "short_answer_en": "Humans were made in God's image (inherent dignity and worth) but through the fall became totally depraved (sin affects every aspect). Humans carry both the glory of God's image and the deep distortion of sin.",
    "detailed_answer_zh": "基督教对人性的看法既不是天真的乐观（人性本善），也不是绝望的悲观（人毫无价值）。它同时持有两个看似矛盾的真理。\n\n一方面，人是按上帝的形像造的（创1:27）。这赋予每个人不可剥夺的尊严和价值——无论种族、性别、能力或社会地位。人类能创造美、追求真理、建立爱的关系，这些都反映了上帝的形像。即使在堕落之后，这个形像虽然被损坏，但没有被完全抹去。\n\n另一方面，堕落的影响是全面的。改革宗神学所说的「全然败坏」（total depravity）不是说人坏到不能再坏，而是说罪渗透了人的每一个方面——理智（被蒙蔽）、情感（被扭曲）、意志（被捆绑）、身体（会朽坏）。因此，人类文明能创造壮丽的艺术，也能制造奥斯维辛。人心「比万物都诡诈，坏到极处」（耶17:9），但同时仍带有创造主的印记。",
    "detailed_answer_en": "The Christian view of human nature is neither naive optimism (humans are fundamentally good) nor despairing pessimism (humans have no value). It holds two seemingly contradictory truths simultaneously.\n\nOn one hand, humans are made in God's image (Gen 1:27). This gives every person inalienable dignity and worth — regardless of race, gender, ability, or social status. Humanity's ability to create beauty, pursue truth, and build loving relationships reflects God's image. Even after the fall, this image is damaged but not erased.\n\nOn the other hand, the fall's effects are comprehensive. What Reformed theology calls 'total depravity' doesn't mean people are as bad as possible, but that sin pervades every aspect — intellect (darkened), emotions (disordered), will (enslaved), body (decaying). Thus human civilization can produce magnificent art and also produce Auschwitz. The human heart is 'deceitful above all things and desperately sick' (Jer 17:9), yet still bears the Creator's stamp.",
    "bible_verses": ["Genesis 1:27", "Jeremiah 17:9", "Romans 3:10-18", "Genesis 9:6", "Ephesians 2:1-3"],
    "related_readings": ["The Holiness of God Ch.4-5 (R.C. Sproul)", "Mere Christianity Book 1 (C.S. Lewis)"],
    "tags": ["original_sin", "anthropology", "image_of_god", "beginner"]
  },
  {
    "id": "q052",
    "category": "original_sin",
    "question_zh": "婴儿也有罪吗？没有听过福音的人怎么办？",
    "question_en": "Are infants sinful too? What about people who never heard the gospel?",
    "short_answer_zh": "圣经教导所有人在亚当里都有原罪。对于婴儿和未闻福音者，我们信靠上帝的公义和慈爱——祂的审判必定是公正的，祂的恩典可以超越常规途径。",
    "short_answer_en": "Scripture teaches all people have original sin in Adam. Regarding infants and the unreached, we trust God's justice and mercy — His judgment is always right, and His grace can work beyond ordinary means.",
    "detailed_answer_zh": "这是神学中最令人揪心的问题之一，我们需要以谦卑和敬畏来回应。\n\n关于婴儿：圣经确实教导原罪影响所有人（诗51:5, 罗5:12）。但许多改革宗神学家（包括加尔文本人）相信，上帝的拣选恩典可以在没有个人信心表达的情况下运作。威斯敏斯特信条（10.3）说：「被选的婴儿在幼年夭折的，由基督通过圣灵重生得救，圣灵何时何处以何种方式运作，都随祂的美意。」\n\n关于未闻福音的人：罗马书1:20教导所有人通过创造都有关于上帝的知识，因此没有人是完全无知的。罗马书2:14-15说上帝的律法写在人心里。同时，我们相信上帝的审判是完全公义的——亚伯拉罕的话永远成立：「审判全地的主岂不行公义吗？」（创18:25）。\n\n这些问题最终提醒我们两件事：我们不是审判者（上帝是），以及传福音的紧迫性——正因为我们不确定上帝会如何对待未闻福音的人，我们更应该竭力将福音传到地极。",
    "detailed_answer_en": "This is among theology's most heart-wrenching questions, requiring humility and reverence.\n\nRegarding infants: Scripture does teach original sin affects all (Psalm 51:5, Rom 5:12). But many Reformed theologians (including Calvin himself) believe God's electing grace can operate without a personal expression of faith. The Westminster Confession (10.3) states: 'Elect infants, dying in infancy, are regenerated and saved by Christ through the Spirit, who works when and where and how He pleases.'\n\nRegarding the unreached: Romans 1:20 teaches all people have knowledge of God through creation, so no one is entirely ignorant. Romans 2:14-15 says God's law is written on human hearts. We trust God's judgment is perfectly just — Abraham's words always stand: 'Shall not the Judge of all the earth do what is just?' (Gen 18:25).\n\nThese questions ultimately remind us of two things: we are not the judge (God is), and the urgency of evangelism — precisely because we're uncertain how God deals with the unreached, we should strive all the more to bring the gospel to the ends of the earth.",
    "bible_verses": ["Romans 5:12", "Psalm 51:5", "Genesis 18:25", "Romans 1:20", "Romans 2:14-15"],
    "related_readings": ["Systematic Theology Ch.24 (Wayne Grudem)", "The Westminster Confession Ch.10"],
    "tags": ["original_sin", "infants", "unreached", "advanced"]
  },
  {
    "id": "q053",
    "category": "heaven_and_hell",
    "question_zh": "天堂是什么样的？我们在天堂会做什么？",
    "question_en": "What is heaven like? What will we do there?",
    "short_answer_zh": "天堂不是坐在云端弹竖琴的无聊永恒，而是在上帝的同在中享受完美的喜乐、有意义的工作和丰富的关系——是我们今生最美好时刻的无限放大。",
    "short_answer_en": "Heaven isn't a boring eternity sitting on clouds playing harps, but perfect joy, meaningful work, and rich relationships in God's presence — an infinite amplification of life's best moments.",
    "detailed_answer_zh": "许多人对天堂的想象来自卡通片而不是圣经。圣经描绘的永恒家乡远比我们想象的丰富和真实。\n\n首先，天堂的核心是与上帝面对面（启22:4）。这是人类受造的终极目的——神学家称之为「荣福直观」（beatific vision）。在今生，我们只能模糊地认识上帝，但在那里，我们将完全地、直接地认识祂。光是这一点，就足以产生永恒的喜乐和满足。\n\n其次，我们将有复活的荣耀身体（林前15:42-44），生活在更新的物质世界中。创世记中上帝交给人类的使命——治理受造界（创1:28）——将在完美中实现。这意味着工作、创造、探索、学习——所有这些在没有罪、没有疲倦、没有挫折的情况下进行。\n\n第三，我们将与所有信徒享受完美的团契。不再有误解、伤害、孤独。「那时我就全知道了」（林前13:12）。天堂不是一切的终结，而是一切美好事物真正的开始。C.S.路易斯在《纳尼亚传奇》的结尾写道：「这只是故事的开始。」",
    "detailed_answer_en": "Many people's image of heaven comes from cartoons, not Scripture. The Bible portrays our eternal home as far richer and more real than we imagine.\n\nFirst, heaven's core is seeing God face to face (Rev 22:4). This is humanity's ultimate created purpose — what theologians call the 'beatific vision.' In this life we know God dimly, but there we'll know Him fully and directly. This alone is enough to produce eternal joy and satisfaction.\n\nSecond, we'll have glorified resurrection bodies (1 Cor 15:42-44), living in a renewed physical world. The mandate God gave humanity in Genesis — to steward creation (Gen 1:28) — will be fulfilled perfectly. This means work, creativity, exploration, learning — all without sin, fatigue, or frustration.\n\nThird, we'll enjoy perfect fellowship with all believers. No more misunderstanding, hurt, or loneliness. 'Then I shall know fully' (1 Cor 13:12). Heaven is not the end of everything but the true beginning of everything good. C.S. Lewis wrote at the end of Narnia: 'This is only the beginning of the story.'",
    "bible_verses": ["Revelation 22:3-5", "1 Corinthians 15:42-44", "1 Corinthians 13:12", "Revelation 21:3-4", "Genesis 1:28"],
    "related_readings": ["Heaven (Randy Alcorn)", "Surprised by Hope (N.T. Wright)"],
    "tags": ["heaven", "eternal_life", "hope", "beginner"]
  },
  {
    "id": "q054",
    "category": "heaven_and_hell",
    "question_zh": "地狱真的是永恒的吗？上帝不会最终拯救所有人吗？",
    "question_en": "Is hell really eternal? Won't God eventually save everyone?",
    "short_answer_zh": "圣经清楚地教导地狱的刑罚是永恒的。普救论（所有人最终都会得救）虽然听起来吸引人，但与圣经的教导不符。永恒地狱的教义彰显了罪的严重性和人类选择的真实性。",
    "short_answer_en": "Scripture clearly teaches hell's punishment is eternal. Universalism (everyone will eventually be saved) sounds appealing but contradicts biblical teaching. The doctrine of eternal hell reveals the seriousness of sin and the reality of human choice.",
    "detailed_answer_zh": "耶稣本人关于地狱的教导比圣经中任何其他人都多。祂在马太福音25:46说：「这些人要往永刑里去；那些义人要往永生里去。」这里「永」用的是同一个希腊词（aionios）——如果地狱不是永恒的，那天堂也不是。\n\n普救论——认为上帝最终会拯救所有人——虽然在情感上有吸引力，但面临几个严重的圣经和神学问题。首先，它直接与耶稣的教导矛盾（太7:13-14, 25:41-46）。其次，它实际上否定了人类选择的真实意义——如果最终所有人都会得救，那么今生的选择就不重要了。第三，它低估了罪对圣洁上帝的冒犯程度。\n\n地狱的永恒性反映了一个事实：罪不仅仅是违反规则，而是对无限圣洁的上帝的冒犯。冒犯的严重程度取决于被冒犯者的尊严——而上帝是无限尊贵的。这并不意味着我们应该以地狱来恐吓人，而是说我们应该严肃地对待罪，并且满怀感恩地宣传那使人脱离地狱的福音。",
    "detailed_answer_en": "Jesus Himself taught more about hell than anyone else in the Bible. In Matthew 25:46 He says: 'These will go away into eternal punishment, but the righteous into eternal life.' The same Greek word (aionios) is used for both — if hell isn't eternal, neither is heaven.\n\nUniversalism — the belief that God will eventually save everyone — is emotionally appealing but faces serious biblical and theological problems. First, it directly contradicts Jesus's teaching (Matt 7:13-14, 25:41-46). Second, it effectively negates the real significance of human choice — if everyone will eventually be saved, choices in this life don't truly matter. Third, it underestimates the gravity of sin's offense against a holy God.\n\nHell's eternality reflects the fact that sin is not merely breaking rules but offending an infinitely holy God. The severity of an offense depends on the dignity of the one offended — and God's dignity is infinite. This doesn't mean we should use hell to terrorize people, but that we should take sin seriously and proclaim with gratitude the gospel that delivers from hell.",
    "bible_verses": ["Matthew 25:46", "Matthew 7:13-14", "Mark 9:47-48", "2 Thessalonians 1:9", "Revelation 20:10"],
    "related_readings": ["The Great Divorce (C.S. Lewis)", "Hell Under Fire (Christopher Morgan & Robert Peterson)"],
    "tags": ["hell", "universalism", "judgment", "advanced"]
  },
  {
    "id": "q055",
    "category": "heaven_and_hell",
    "question_zh": "基督徒死后立刻去天堂吗？中间状态是什么？",
    "question_en": "Do Christians go to heaven immediately after death? What is the intermediate state?",
    "short_answer_zh": "基督徒死后灵魂立刻与主同在（中间状态），但最终的盼望是基督再来时身体的复活和新天新地的完全实现。",
    "short_answer_en": "After death, a Christian's soul immediately enters the Lord's presence (intermediate state), but the ultimate hope is bodily resurrection at Christ's return and the full realization of the new heaven and new earth.",
    "detailed_answer_zh": "保罗在腓立比书1:23说他渴望「离世与基督同在，因为这是好得无比的。」在路加福音23:43中，耶稣对十字架上的强盗说：「今日你要同我在乐园里了。」这些经文清楚表明，基督徒死后灵魂立刻进入上帝的同在。\n\n但这个「中间状态」不是最终目的地。基督教的终极盼望不是「灵魂上天堂」，而是身体的复活。哥林多前书15章详细论述了复活的身体——不再朽坏、不再软弱、充满荣耀。在基督再来的那一天，所有在基督里死了的人都将复活，拥有荣耀的新身体。\n\n这与许多东方宗教的灵魂轮回观和希腊哲学的灵肉二元论都不同。基督教教导身体不是灵魂的监狱，而是上帝美好创造的一部分，最终将被更新和荣耀化。我们的盼望不是逃离物质世界，而是物质世界本身被更新——这就是新天新地的应许。",
    "detailed_answer_en": "Paul says in Philippians 1:23 he desires 'to depart and be with Christ, for that is far better.' In Luke 23:43, Jesus tells the thief on the cross: 'Today you will be with me in paradise.' These passages clearly show that after death, a Christian's soul immediately enters God's presence.\n\nBut this 'intermediate state' is not the final destination. Christianity's ultimate hope isn't 'souls going to heaven' but bodily resurrection. 1 Corinthians 15 details the resurrection body — imperishable, powerful, glorious. On the day Christ returns, all who died in Christ will be raised with glorified new bodies.\n\nThis differs from Eastern religions' reincarnation and Greek philosophy's body-soul dualism. Christianity teaches the body is not the soul's prison but part of God's good creation, to be renewed and glorified. Our hope isn't escaping the material world but the material world itself being renewed — this is the promise of the new heaven and new earth.",
    "bible_verses": ["Philippians 1:23", "Luke 23:43", "1 Corinthians 15:42-44", "1 Thessalonians 4:16-17", "2 Corinthians 5:1-8"],
    "related_readings": ["Between Death and the Resurrection (Cornelis Venema)", "Surprised by Hope (N.T. Wright)"],
    "tags": ["heaven", "resurrection", "intermediate_state", "intermediate"]
  }
]
